iSYSTEMLabs/winIDEAExampleWorkspaces/SiliconLabs/EFM32GG11/targetInit/efm32gg11_sfr.h
};

#define System_Control_Space_NVIC (*(volatile struct System_Control_Space_NVIC_tag *) 0xe000e100)

struct System_Control_Space_SysTick_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t TICKINT:1;
      uint64_t CLKSOURCE:1;
      uint64_t reservedSpace0:13;
      uint64_t COUNTFLAG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYST_CSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RELOAD:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYST_RVR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CURRENT:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYST_CVR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TENMS:24;
      uint64_t reservedSpace0:6;
      uint64_t SKEW:1;
      uint64_t NOREF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYST_CALIB;

};

#define System_Control_Space_SysTick (*(volatile struct System_Control_Space_SysTick_tag *) 0xe000e010)

struct System_Control_Space_Memory_Protection_Unit_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEPARATE:1;
      uint64_t reservedSpace0:7;
      uint64_t DREGION:8;
      uint64_t IREGION:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_TYPE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t HFNMIENA:1;
      uint64_t PRIVDEFENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_CTRL;

  uint8_t MPU_RNR;
  uint8_t res0[3];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGION:4;
      uint64_t VALID:1;
      uint64_t ADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RBAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t SIZE:5;
      uint64_t reservedSpace0:2;
      uint64_t SRD:8;
      uint64_t B:1;
      uint64_t C:1;
      uint64_t S:1;
      uint64_t TEX:3;
      uint64_t reservedSpace1:2;
      uint64_t AP:3;
      uint64_t reservedSpace2:1;
      uint64_t XN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RASR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGION:4;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RBAR_A1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t SIZE:5;
      uint64_t reservedSpace0:2;
      uint64_t SRD:8;
      uint64_t B:1;
      uint64_t C:1;
      uint64_t S:1;
      uint64_t TEX:3;
      uint64_t reservedSpace1:2;
      uint64_t AP:3;
      uint64_t reservedSpace2:1;
      uint64_t XN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RASR_A1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGION:4;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RBAR_A2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t SIZE:5;
      uint64_t reservedSpace0:2;
      uint64_t SRD:8;
      uint64_t B:1;
      uint64_t C:1;
      uint64_t S:1;
      uint64_t TEX:3;
      uint64_t reservedSpace1:2;
      uint64_t AP:3;
      uint64_t reservedSpace2:1;
      uint64_t XN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RASR_A2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGION:4;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RBAR_A3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t SIZE:5;
      uint64_t reservedSpace0:2;
      uint64_t SRD:8;
      uint64_t B:1;
      uint64_t C:1;
      uint64_t S:1;
      uint64_t TEX:3;
      uint64_t reservedSpace1:2;
      uint64_t AP:3;
      uint64_t reservedSpace2:1;
      uint64_t XN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RASR_A3;

};

#define System_Control_Space_Memory_Protection_Unit (*(volatile struct System_Control_Space_Memory_Protection_Unit_tag *) 0xe000ed90)

struct MSC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDRFAULTEN:1;
      uint64_t CLKDISFAULTEN:1;
      uint64_t PWRUPONDEMAND:1;
      uint64_t IFCREADCLEAR:1;
      uint64_t TIMEOUTFAULTEN:1;
      uint64_t RAMECCERRFAULTEN:1;
      uint64_t EBIFAULTEN:1;
      uint64_t reservedSpace0:5;
      uint64_t WAITMODE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t IFCDIS:1;
      uint64_t AIDIS:1;
      uint64_t ICCDIS:1;
      uint64_t EBICDIS:1;
      uint64_t reservedSpace1:1;
      uint64_t PREFETCH:1;
      uint64_t USEHPROT:1;
      uint64_t QSPICDIS:1;
      uint64_t reservedSpace2:13;
      uint64_t MODE:2;
      uint64_t reservedSpace3:2;
      uint64_t SCBTP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) READCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WREN:1;
      uint64_t IRQERASEABORT:1;
      uint64_t reservedSpace0:3;
      uint64_t RWWEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WRITECTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LADDRIM:1;
      uint64_t ERASEPAGE:1;
      uint64_t WRITEEND:1;
      uint64_t WRITEONCE:1;
      uint64_t WRITETRIG:1;
      uint64_t ERASEABORT:1;
      uint64_t reservedSpace0:2;
      uint64_t ERASEMAIN0:1;
      uint64_t ERASEMAIN1:1;
      uint64_t reservedSpace1:2;
      uint64_t CLEARWDATA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WRITECMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDRB:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADDRB;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WDATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BUSY:1;
      uint64_t LOCKED:1;
      uint64_t INVADDR:1;
      uint64_t WDATAREADY:1;
      uint64_t WORDTIMEOUT:1;
      uint64_t ERASEABORTED:1;
      uint64_t PCRUNNING:1;
      uint64_t BANKSWITCHED:1;
      uint64_t reservedSpace0:16;
      uint64_t WDATAVALID:4;
      uint64_t PWRUPCKBDFAILCOUNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATUS;

  uint8_t res1[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERASE:1;
      uint64_t WRITE:1;
      uint64_t CHOF:1;
      uint64_t CMOF:1;
      uint64_t PWRUPF:1;
      uint64_t ICACHERR:1;
      uint64_t WDATAOV:1;
      uint64_t reservedSpace0:1;
      uint64_t LVEWRITE:1;
      uint64_t reservedSpace1:7;
      uint64_t RAMERR1B:1;
      uint64_t RAMERR2B:1;
      uint64_t RAM1ERR1B:1;
      uint64_t RAM1ERR2B:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERASE:1;
      uint64_t WRITE:1;
      uint64_t CHOF:1;
      uint64_t CMOF:1;
      uint64_t PWRUPF:1;
      uint64_t ICACHERR:1;
      uint64_t WDATAOV:1;
      uint64_t reservedSpace0:1;
      uint64_t LVEWRITE:1;
      uint64_t reservedSpace1:7;
      uint64_t RAMERR1B:1;
      uint64_t RAMERR2B:1;
      uint64_t RAM1ERR1B:1;
      uint64_t RAM1ERR2B:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERASE:1;
      uint64_t WRITE:1;
      uint64_t CHOF:1;
      uint64_t CMOF:1;
      uint64_t PWRUPF:1;
      uint64_t ICACHERR:1;
      uint64_t WDATAOV:1;
      uint64_t reservedSpace0:1;
      uint64_t LVEWRITE:1;
      uint64_t reservedSpace1:7;
      uint64_t RAMERR1B:1;
      uint64_t RAMERR2B:1;
      uint64_t RAM1ERR1B:1;
      uint64_t RAM1ERR2B:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERASE:1;
      uint64_t WRITE:1;
      uint64_t CHOF:1;
      uint64_t CMOF:1;
      uint64_t PWRUPF:1;
      uint64_t ICACHERR:1;
      uint64_t WDATAOV:1;
      uint64_t reservedSpace0:1;
      uint64_t LVEWRITE:1;
      uint64_t reservedSpace1:7;
      uint64_t RAMERR1B:1;
      uint64_t RAMERR2B:1;
      uint64_t RAM1ERR1B:1;
      uint64_t RAM1ERR2B:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKKEY:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LOCK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INVCACHE:1;
      uint64_t STARTPC:1;
      uint64_t STOPPC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CACHECMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CACHEHITS:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CACHEHITS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CACHEMISSES:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CACHEMISSES;

