iSYSTEMLabs/winIDEAExampleWorkspaces/SiliconLabs/EFM32GG11/targetInit/efm32gg11_sfr.h
  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKKEY:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MASSLOCK;

  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STDLY0:10;
      uint64_t reservedSpace0:2;
      uint64_t STDLY1:10;
      uint64_t reservedSpace1:2;
      uint64_t ASTWAIT:1;
      uint64_t STWSEN:1;
      uint64_t STWSAEN:1;
      uint64_t reservedSpace2:1;
      uint64_t STWS:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STARTUP;

  uint8_t res4[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BANKSWITCHLOCKKEY:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BANKSWITCHLOCK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWRUP:1;
      uint64_t SWITCHINGBANK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMD;

  uint8_t res5[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLRDIS:1;
      uint64_t BLWDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BOOTLOADERCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UNLOCKAAP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AAPUNLOCKCMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CACHELPLEVEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CACHECONFIG0;

  uint8_t res6[100];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RAMCACHEEN:1;
      uint64_t RAMWSEN:1;
      uint64_t RAMPREFETCHEN:1;
      uint64_t reservedSpace0:5;
      uint64_t RAM1CACHEEN:1;
      uint64_t RAM1WSEN:1;
      uint64_t RAM1PREFETCHEN:1;
      uint64_t reservedSpace1:5;
      uint64_t RAM2CACHEEN:1;
      uint64_t RAM2WSEN:1;
      uint64_t RAM2PREFETCHEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAMCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RAMECCEWEN:1;
      uint64_t RAMECCCHKEN:1;
      uint64_t RAM1ECCEWEN:1;
      uint64_t RAM1ECCCHKEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECCCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RAMECCADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAMECCADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RAM1ECCADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM1ECCADDR;

};

#define MSC (*(volatile struct MSC_tag *) 0x40000000)

struct EMU_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t EM2BLOCK:1;
      uint64_t EM2BODDIS:1;
      uint64_t EM01LD:1;
      uint64_t EM23VSCALEAUTOWSEN:1;
      uint64_t reservedSpace1:3;
      uint64_t EM23VSCALE:2;
      uint64_t reservedSpace2:6;
      uint64_t EM4HVSCALE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VMONRDY:1;
      uint64_t VMONAVDD:1;
      uint64_t VMONALTAVDD:1;
      uint64_t VMONDVDD:1;
      uint64_t VMONIO0:1;
      uint64_t VMONIO1:1;
      uint64_t reservedSpace0:1;
      uint64_t VMONBUVDD:1;
      uint64_t reservedSpace1:4;
      uint64_t BURDY:1;
      uint64_t reservedSpace2:3;
      uint64_t VSCALE:2;
      uint64_t VSCALEBUSY:1;
      uint64_t reservedSpace3:1;
      uint64_t EM4IORET:1;
      uint64_t reservedSpace4:5;
      uint64_t TEMPACTIVE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKKEY:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LOCK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RAMPOWERDOWN:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM0CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EM4UNLATCH:1;
      uint64_t reservedSpace0:3;
      uint64_t EM01VSCALE0:1;
      uint64_t reservedSpace1:1;
      uint64_t EM01VSCALE2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMD;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EM4STATE:1;
      uint64_t RETAINLFRCO:1;
      uint64_t RETAINLFXO:1;
      uint64_t RETAINULFRCO:1;
      uint64_t EM4IORETMODE:2;
      uint64_t reservedSpace0:10;
      uint64_t EM4ENTRY:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EM4CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEMPLOW:8;
      uint64_t TEMPHIGH:8;
      uint64_t EM4WUEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TEMPLIMITS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEMP:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TEMP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VMONAVDDFALL:1;
      uint64_t VMONAVDDRISE:1;
      uint64_t VMONALTAVDDFALL:1;
      uint64_t VMONALTAVDDRISE:1;
      uint64_t VMONDVDDFALL:1;
      uint64_t VMONDVDDRISE:1;
      uint64_t VMONIO0FALL:1;
      uint64_t VMONIO0RISE:1;
      uint64_t VMONIO1FALL:1;
      uint64_t VMONIO1RISE:1;
      uint64_t R5VREADY:1;
      uint64_t reservedSpace0:1;
      uint64_t VMONBUVDDFALL:1;
      uint64_t VMONBUVDDRISE:1;
      uint64_t reservedSpace1:2;
      uint64_t PFETOVERCURRENTLIMIT:1;
      uint64_t NFETOVERCURRENTLIMIT:1;
      uint64_t DCDCLPRUNNING:1;
      uint64_t DCDCLNRUNNING:1;
      uint64_t DCDCINBYPASS:1;
      uint64_t reservedSpace2:1;
      uint64_t BURDY:1;
      uint64_t R5VVSINT:1;
      uint64_t EM23WAKEUP:1;
      uint64_t VSCALEDONE:1;
      uint64_t reservedSpace3:3;
      uint64_t TEMP:1;
      uint64_t TEMPLOW:1;
      uint64_t TEMPHIGH:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VMONAVDDFALL:1;
      uint64_t VMONAVDDRISE:1;
      uint64_t VMONALTAVDDFALL:1;
      uint64_t VMONALTAVDDRISE:1;
      uint64_t VMONDVDDFALL:1;
      uint64_t VMONDVDDRISE:1;
      uint64_t VMONIO0FALL:1;
      uint64_t VMONIO0RISE:1;
      uint64_t VMONIO1FALL:1;
      uint64_t VMONIO1RISE:1;
      uint64_t R5VREADY:1;
      uint64_t reservedSpace0:1;
      uint64_t VMONBUVDDFALL:1;
      uint64_t VMONBUVDDRISE:1;
      uint64_t reservedSpace1:2;
      uint64_t PFETOVERCURRENTLIMIT:1;
      uint64_t NFETOVERCURRENTLIMIT:1;
      uint64_t DCDCLPRUNNING:1;
      uint64_t DCDCLNRUNNING:1;
      uint64_t DCDCINBYPASS:1;
      uint64_t reservedSpace2:1;
      uint64_t BURDY:1;
      uint64_t R5VVSINT:1;
      uint64_t EM23WAKEUP:1;
      uint64_t VSCALEDONE:1;
      uint64_t reservedSpace3:3;
      uint64_t TEMP:1;
      uint64_t TEMPLOW:1;
      uint64_t TEMPHIGH:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VMONAVDDFALL:1;
      uint64_t VMONAVDDRISE:1;
      uint64_t VMONALTAVDDFALL:1;
      uint64_t VMONALTAVDDRISE:1;
      uint64_t VMONDVDDFALL:1;
      uint64_t VMONDVDDRISE:1;
      uint64_t VMONIO0FALL:1;
      uint64_t VMONIO0RISE:1;
      uint64_t VMONIO1FALL:1;
      uint64_t VMONIO1RISE:1;
      uint64_t R5VREADY:1;
      uint64_t reservedSpace0:1;
      uint64_t VMONBUVDDFALL:1;
      uint64_t VMONBUVDDRISE:1;
      uint64_t reservedSpace1:2;
      uint64_t PFETOVERCURRENTLIMIT:1;
      uint64_t NFETOVERCURRENTLIMIT:1;
      uint64_t DCDCLPRUNNING:1;
      uint64_t DCDCLNRUNNING:1;
      uint64_t DCDCINBYPASS:1;
      uint64_t reservedSpace2:1;
      uint64_t BURDY:1;
      uint64_t R5VVSINT:1;
      uint64_t EM23WAKEUP:1;
      uint64_t VSCALEDONE:1;
      uint64_t reservedSpace3:3;
      uint64_t TEMP:1;
      uint64_t TEMPLOW:1;
      uint64_t TEMPHIGH:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VMONAVDDFALL:1;
      uint64_t VMONAVDDRISE:1;
      uint64_t VMONALTAVDDFALL:1;
      uint64_t VMONALTAVDDRISE:1;
      uint64_t VMONDVDDFALL:1;
      uint64_t VMONDVDDRISE:1;
      uint64_t VMONIO0FALL:1;
      uint64_t VMONIO0RISE:1;
      uint64_t VMONIO1FALL:1;
      uint64_t VMONIO1RISE:1;
      uint64_t R5VREADY:1;
      uint64_t reservedSpace0:1;
      uint64_t VMONBUVDDFALL:1;
      uint64_t VMONBUVDDRISE:1;
      uint64_t reservedSpace1:2;
      uint64_t PFETOVERCURRENTLIMIT:1;
      uint64_t NFETOVERCURRENTLIMIT:1;
      uint64_t DCDCLPRUNNING:1;
      uint64_t DCDCLNRUNNING:1;
      uint64_t DCDCINBYPASS:1;
      uint64_t reservedSpace2:1;
      uint64_t BURDY:1;
      uint64_t R5VVSINT:1;
      uint64_t EM23WAKEUP:1;
      uint64_t VSCALEDONE:1;
      uint64_t reservedSpace3:3;
      uint64_t TEMP:1;
      uint64_t TEMPLOW:1;
      uint64_t TEMPHIGH:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKKEY:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWRLOCK;

