iSYSTEMLabs/winIDEAExampleWorkspaces/SiliconLabs/EFM32GG11/targetInit/efm32gg11_sfr.h
  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t ANASW:1;
      uint64_t reservedSpace1:4;
      uint64_t REGPWRSEL:1;
      uint64_t reservedSpace2:2;
      uint64_t IMMEDIATEPWRSWITCH:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWRCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCDCMODE:2;
      uint64_t reservedSpace0:2;
      uint64_t DCDCMODEEM23:1;
      uint64_t DCDCMODEEM4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCDCCTRL;

  uint8_t res2[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LNFORCECCM:1;
      uint64_t LPCMPHYSDIS:1;
      uint64_t LPCMPHYSHI:1;
      uint64_t reservedSpace0:2;
      uint64_t LNFORCECCMIMM:1;
      uint64_t reservedSpace1:2;
      uint64_t PFETCNT:4;
      uint64_t NFETCNT:4;
      uint64_t BYPLIMSEL:4;
      uint64_t LPCLIMILIMSEL:3;
      uint64_t reservedSpace2:1;
      uint64_t LNCLIMILIMSEL:3;
      uint64_t reservedSpace3:1;
      uint64_t LPCMPBIASEM234H:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCDCMISCCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t ZDETILIMSEL:3;
      uint64_t reservedSpace1:1;
      uint64_t ZDETBLANKDLY:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCDCZDETCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t CLIMBLANKDLY:2;
      uint64_t reservedSpace1:3;
      uint64_t BYPLIMEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCDCCLIMCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMPENR1:3;
      uint64_t reservedSpace0:1;
      uint64_t COMPENR2:5;
      uint64_t reservedSpace1:3;
      uint64_t COMPENR3:4;
      uint64_t reservedSpace2:4;
      uint64_t COMPENC1:2;
      uint64_t reservedSpace3:2;
      uint64_t COMPENC2:3;
      uint64_t reservedSpace4:1;
      uint64_t COMPENC3:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCDCLNCOMPCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t LNATT:1;
      uint64_t reservedSpace1:6;
      uint64_t LNVREF:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCDCLNVCTRL;

  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LPATT:1;
      uint64_t LPVREF:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCDCLPVCTRL;

  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:12;
      uint64_t LPCMPHYSSELEM234H:4;
      uint64_t reservedSpace1:8;
      uint64_t LPVREFDUTYEN:1;
      uint64_t LPBLANK:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCDCLPCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RCOBAND:3;
      uint64_t reservedSpace0:21;
      uint64_t RCOTRIM:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCDCLNFREQCTRL;

  uint8_t res5[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCDCCTRLBUSY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCDCSYNC;

  uint8_t res6[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:1;
      uint64_t RISEWU:1;
      uint64_t FALLWU:1;
      uint64_t reservedSpace1:4;
      uint64_t FALLTHRESFINE:4;
      uint64_t FALLTHRESCOARSE:4;
      uint64_t RISETHRESFINE:4;
      uint64_t RISETHRESCOARSE:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VMONAVDDCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:1;
      uint64_t RISEWU:1;
      uint64_t FALLWU:1;
      uint64_t reservedSpace1:4;
      uint64_t THRESFINE:4;
      uint64_t THRESCOARSE:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VMONALTAVDDCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:1;
      uint64_t RISEWU:1;
      uint64_t FALLWU:1;
      uint64_t reservedSpace1:4;
      uint64_t THRESFINE:4;
      uint64_t THRESCOARSE:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VMONDVDDCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:1;
      uint64_t RISEWU:1;
      uint64_t FALLWU:1;
      uint64_t RETDIS:1;
      uint64_t reservedSpace1:3;
      uint64_t THRESFINE:4;
      uint64_t THRESCOARSE:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VMONIO0CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:1;
      uint64_t RISEWU:1;
      uint64_t FALLWU:1;
      uint64_t RETDIS:1;
      uint64_t reservedSpace1:3;
      uint64_t THRESFINE:4;
      uint64_t THRESCOARSE:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VMONIO1CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:1;
      uint64_t RISEWU:1;
      uint64_t FALLWU:1;
      uint64_t reservedSpace1:4;
      uint64_t THRESFINE:4;
      uint64_t THRESCOARSE:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VMONBUVDDCTRL;

  uint8_t res7[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RAMPOWERDOWN:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM1CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RAMPOWERDOWN:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM2CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t STATEN:1;
      uint64_t BUVINPROBEEN:1;
      uint64_t reservedSpace0:5;
      uint64_t VOUTRES:2;
      uint64_t reservedSpace1:2;
      uint64_t PWRRES:2;
      uint64_t reservedSpace2:2;
      uint64_t BUACTPWRCON:2;
      uint64_t reservedSpace3:2;
      uint64_t BUINACTPWRCON:2;
      uint64_t reservedSpace4:9;
      uint64_t DISMAXCOMP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BUCTRL;

  uint8_t res8[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BYPASS:1;
      uint64_t EM4WUEN:1;
      uint64_t IMONEN:1;
      uint64_t reservedSpace0:5;
      uint64_t INPUTMODE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R5VCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENAMUX:1;
      uint64_t reservedSpace0:11;
      uint64_t AMUXSEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R5VADCCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OUTLEVEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R5VOUTLEVEL;

  uint8_t res9[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VREGIDETDIS:1;
      uint64_t VBUSDETDIS:1;
      uint64_t VREGODETDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R5VDETCTRL;

  uint8_t res10[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t LPCMPBIASEM01:2;
      uint64_t reservedSpace1:2;
      uint64_t LPCMPHYSSELEM01:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCDCLPEM01CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VREGIDET:1;
      uint64_t VBUSDET:1;
      uint64_t VREGODET:1;
      uint64_t VBUSGTVREGI:1;
      uint64_t LDODROPOUTDET:1;
      uint64_t COLDSTART:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R5VSTATUS;

  uint8_t res11[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OUTLEVELBUSY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R5VSYNC;

  uint8_t res12[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACMP0UNLOCK:1;
      uint64_t ACMP1UNLOCK:1;
      uint64_t PCNT0UNLOCK:1;
      uint64_t PCNT1UNLOCK:1;
      uint64_t PCNT2UNLOCK:1;
      uint64_t I2C0UNLOCK:1;
      uint64_t I2C1UNLOCK:1;
      uint64_t DAC0UNLOCK:1;
      uint64_t IDAC0UNLOCK:1;
      uint64_t ADC0UNLOCK:1;
      uint64_t LETIMER0UNLOCK:1;
      uint64_t WDOG0UNLOCK:1;
      uint64_t WDOG1UNLOCK:1;
      uint64_t LESENSE0UNLOCK:1;
      uint64_t CSENUNLOCK:1;
      uint64_t LEUART0UNLOCK:1;
      uint64_t LEUART1UNLOCK:1;
      uint64_t LCDUNLOCK:1;
      uint64_t LETIMER1UNLOCK:1;
      uint64_t I2C2UNLOCK:1;
      uint64_t ADC1UNLOCK:1;
      uint64_t ACMP2UNLOCK:1;
      uint64_t ACMP3UNLOCK:1;
      uint64_t RTCUNLOCK:1;
      uint64_t USBUNLOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EM23PERNORETAINCMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACMP0LOCKED:1;
      uint64_t ACMP1LOCKED:1;
      uint64_t PCNT0LOCKED:1;
      uint64_t PCNT1LOCKED:1;
      uint64_t PCNT2LOCKED:1;
      uint64_t I2C0LOCKED:1;
      uint64_t I2C1LOCKED:1;
      uint64_t DAC0LOCKED:1;
      uint64_t IDAC0LOCKED:1;
      uint64_t ADC0LOCKED:1;
      uint64_t LETIMER0LOCKED:1;
      uint64_t WDOG0LOCKED:1;
      uint64_t WDOG1LOCKED:1;
      uint64_t LESENSE0LOCKED:1;
      uint64_t CSENLOCKED:1;
      uint64_t LEUART0LOCKED:1;
      uint64_t LEUART1LOCKED:1;
      uint64_t LCDLOCKED:1;
      uint64_t LETIMER1LOCKED:1;
      uint64_t I2C2LOCKED:1;
      uint64_t ADC1LOCKED:1;
      uint64_t ACMP2LOCKED:1;
      uint64_t ACMP3LOCKED:1;
      uint64_t RTCLOCKED:1;
      uint64_t USBLOCKED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EM23PERNORETAINSTATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACMP0DIS:1;
      uint64_t ACMP1DIS:1;
      uint64_t PCNT0DIS:1;
      uint64_t PCNT1DIS:1;
      uint64_t PCNT2DIS:1;
      uint64_t I2C0DIS:1;
      uint64_t I2C1DIS:1;
      uint64_t DAC0DIS:1;
      uint64_t IDAC0DIS:1;
      uint64_t ADC0DIS:1;
      uint64_t LETIMER0DIS:1;
      uint64_t WDOG0DIS:1;
      uint64_t WDOG1DIS:1;
      uint64_t LESENSE0DIS:1;
      uint64_t CSENDIS:1;
      uint64_t LEUART0DIS:1;
      uint64_t LEUART1DIS:1;
      uint64_t LCDDIS:1;
      uint64_t LETIMER1DIS:1;
      uint64_t I2C2DIS:1;
      uint64_t ADC1DIS:1;
      uint64_t ACMP2DIS:1;
      uint64_t ACMP3DIS:1;
      uint64_t RTCDIS:1;
      uint64_t USBDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EM23PERNORETAINCTRL;

