iSYSTEMLabs/winIDEAExampleWorkspaces/SiliconLabs/EFM32GG11/targetInit/efm32gg11_sfr.h
};

#define EMU (*(volatile struct EMU_tag *) 0x400e3000)

struct RMU_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDOGRMODE:3;
      uint64_t reservedSpace0:1;
      uint64_t LOCKUPRMODE:3;
      uint64_t reservedSpace1:1;
      uint64_t SYSRMODE:3;
      uint64_t reservedSpace2:1;
      uint64_t PINRMODE:3;
      uint64_t reservedSpace3:9;
      uint64_t RESETSTATE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PORST:1;
      uint64_t reservedSpace0:1;
      uint64_t AVDDBOD:1;
      uint64_t DVDDBOD:1;
      uint64_t DECBOD:1;
      uint64_t reservedSpace1:3;
      uint64_t EXTRST:1;
      uint64_t LOCKUPRST:1;
      uint64_t SYSREQRST:1;
      uint64_t WDOGRST:1;
      uint64_t BUMODERST:1;
      uint64_t reservedSpace2:3;
      uint64_t EM4RST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RSTCAUSE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RCCLR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMD;

  uint32_t RST;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKKEY:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LOCK;

};

#define RMU (*(volatile struct RMU_tag *) 0x400e5000)

struct CMU_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLKOUTSEL0:5;
      uint64_t CLKOUTSEL1:5;
      uint64_t CLKOUTSEL2:5;
      uint64_t reservedSpace0:1;
      uint64_t WSHFLE:1;
      uint64_t reservedSpace1:3;
      uint64_t HFPERCLKEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TUNING:7;
      uint64_t reservedSpace0:1;
      uint64_t FINETUNING:6;
      uint64_t reservedSpace1:2;
      uint64_t FREQRANGE:5;
      uint64_t CMPBIAS:3;
      uint64_t LDOHP:1;
      uint64_t CLKDIV:2;
      uint64_t FINETUNINGEN:1;
      uint64_t VREFTC:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USHFRCOCTRL;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TUNING:7;
      uint64_t reservedSpace0:1;
      uint64_t FINETUNING:6;
      uint64_t reservedSpace1:2;
      uint64_t FREQRANGE:5;
      uint64_t CMPBIAS:3;
      uint64_t LDOHP:1;
      uint64_t CLKDIV:2;
      uint64_t FINETUNINGEN:1;
      uint64_t VREFTC:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HFRCOCTRL;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TUNING:7;
      uint64_t reservedSpace0:1;
      uint64_t FINETUNING:6;
      uint64_t reservedSpace1:2;
      uint64_t FREQRANGE:5;
      uint64_t CMPBIAS:3;
      uint64_t LDOHP:1;
      uint64_t CLKDIV:2;
      uint64_t FINETUNINGEN:1;
      uint64_t VREFTC:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AUXHFRCOCTRL;

  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TUNING:9;
      uint64_t reservedSpace0:7;
      uint64_t ENVREF:1;
      uint64_t ENCHOP:1;
      uint64_t ENDEM:1;
      uint64_t reservedSpace1:1;
      uint64_t VREFUPDATE:2;
      uint64_t reservedSpace2:2;
      uint64_t TIMEOUT:2;
      uint64_t reservedSpace3:2;
      uint64_t GMCCURTUNE:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LFRCOCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t HFXOX2EN:1;
      uint64_t PEAKDETMODE:2;
      uint64_t reservedSpace1:18;
      uint64_t LFTIMEOUT:3;
      uint64_t reservedSpace2:1;
      uint64_t AUTOSTARTEM0EM1:1;
      uint64_t AUTOSTARTSELEM0EM1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HFXOCTRL;

  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IBTRIMXOCORE:11;
      uint64_t CTUNE:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HFXOSTARTUPCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IBTRIMXOCORE:11;
      uint64_t CTUNE:9;
      uint64_t reservedSpace0:6;
      uint64_t PEAKDETEN:1;
      uint64_t PEAKMONEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HFXOSTEADYSTATECTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STARTUPTIMEOUT:4;
      uint64_t STEADYTIMEOUT:4;
      uint64_t reservedSpace0:4;
      uint64_t PEAKDETTIMEOUT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HFXOTIMEOUTCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TUNING:7;
      uint64_t reservedSpace0:1;
      uint64_t MODE:2;
      uint64_t reservedSpace1:1;
      uint64_t GAIN:2;
      uint64_t reservedSpace2:1;
      uint64_t HIGHAMPL:1;
      uint64_t AGC:1;
      uint64_t CUR:2;
      uint64_t reservedSpace3:2;
      uint64_t BUFCUR:1;
      uint64_t reservedSpace4:3;
      uint64_t TIMEOUT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LFXOCTRL;

  uint8_t res5[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:1;
      uint64_t EDGESEL:1;
      uint64_t AUTORECOVER:1;
      uint64_t REFSEL:2;
      uint64_t reservedSpace0:1;
      uint64_t DITHEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DPLLCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M:12;
      uint64_t reservedSpace0:4;
      uint64_t N:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DPLLCTRL1;

  uint8_t res6[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UPSEL:3;
      uint64_t reservedSpace0:1;
      uint64_t DOWNSEL:4;
      uint64_t CONT:1;
      uint64_t reservedSpace1:7;
      uint64_t PRSUPSEL:5;
      uint64_t reservedSpace2:3;
      uint64_t PRSDOWNSEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CALCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CALCNT:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CALCNT;

