iSYSTEMLabs/winIDEAExampleWorkspaces/SiliconLabs/EFM32GG11/targetInit/efm32gg11_sfr.h
  uint8_t res7[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HFRCOEN:1;
      uint64_t HFRCODIS:1;
      uint64_t HFXOEN:1;
      uint64_t HFXODIS:1;
      uint64_t AUXHFRCOEN:1;
      uint64_t AUXHFRCODIS:1;
      uint64_t LFRCOEN:1;
      uint64_t LFRCODIS:1;
      uint64_t LFXOEN:1;
      uint64_t LFXODIS:1;
      uint64_t USHFRCOEN:1;
      uint64_t USHFRCODIS:1;
      uint64_t DPLLEN:1;
      uint64_t DPLLDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OSCENCMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CALSTART:1;
      uint64_t CALSTOP:1;
      uint64_t reservedSpace0:2;
      uint64_t HFXOPEAKDETSTART:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMD;

  uint8_t res8[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DBG:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DBGCLKSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HF:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HFCLKSEL;

  uint8_t res9[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LFA:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LFACLKSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LFB:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LFBCLKSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LFE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LFECLKSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LFC:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LFCCLKSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HFRCOENS:1;
      uint64_t HFRCORDY:1;
      uint64_t HFXOENS:1;
      uint64_t HFXORDY:1;
      uint64_t AUXHFRCOENS:1;
      uint64_t AUXHFRCORDY:1;
      uint64_t LFRCOENS:1;
      uint64_t LFRCORDY:1;
      uint64_t LFXOENS:1;
      uint64_t LFXORDY:1;
      uint64_t USHFRCOENS:1;
      uint64_t USHFRCORDY:1;
      uint64_t DPLLENS:1;
      uint64_t DPLLRDY:1;
      uint64_t reservedSpace0:2;
      uint64_t CALRDY:1;
      uint64_t SDIOCLKENS:1;
      uint64_t QSPI0CLKENS:1;
      uint64_t reservedSpace1:3;
      uint64_t HFXOPEAKDETRDY:1;
      uint64_t reservedSpace2:2;
      uint64_t HFXOAMPLOW:1;
      uint64_t reservedSpace3:1;
      uint64_t LFXOPHASE:1;
      uint64_t LFRCOPHASE:1;
      uint64_t ULFRCOPHASE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SELECTED:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HFCLKSTATUS;

  uint8_t res10[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IBTRIMXOCORE:11;
      uint64_t reservedSpace0:5;
      uint64_t IBTRIMXOCOREMON:11;
      uint64_t reservedSpace1:3;
      uint64_t VALID:1;
      uint64_t MONVALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HFXOTRIMSTATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HFRCORDY:1;
      uint64_t HFXORDY:1;
      uint64_t LFRCORDY:1;
      uint64_t LFXORDY:1;
      uint64_t AUXHFRCORDY:1;
      uint64_t CALRDY:1;
      uint64_t CALOF:1;
      uint64_t USHFRCORDY:1;
      uint64_t HFXODISERR:1;
      uint64_t HFXOAUTOSW:1;
      uint64_t reservedSpace0:1;
      uint64_t HFXOPEAKDETRDY:1;
      uint64_t reservedSpace1:1;
      uint64_t HFRCODIS:1;
      uint64_t LFTIMEOUTERR:1;
      uint64_t DPLLRDY:1;
      uint64_t DPLLLOCKFAILLOW:1;
      uint64_t DPLLLOCKFAILHIGH:1;
      uint64_t reservedSpace2:9;
      uint64_t LFXOEDGE:1;
      uint64_t LFRCOEDGE:1;
      uint64_t ULFRCOEDGE:1;
      uint64_t reservedSpace3:1;
      uint64_t CMUERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HFRCORDY:1;
      uint64_t HFXORDY:1;
      uint64_t LFRCORDY:1;
      uint64_t LFXORDY:1;
      uint64_t AUXHFRCORDY:1;
      uint64_t CALRDY:1;
      uint64_t CALOF:1;
      uint64_t USHFRCORDY:1;
      uint64_t HFXODISERR:1;
      uint64_t HFXOAUTOSW:1;
      uint64_t reservedSpace0:1;
      uint64_t HFXOPEAKDETRDY:1;
      uint64_t reservedSpace1:1;
      uint64_t HFRCODIS:1;
      uint64_t LFTIMEOUTERR:1;
      uint64_t DPLLRDY:1;
      uint64_t DPLLLOCKFAILLOW:1;
      uint64_t DPLLLOCKFAILHIGH:1;
      uint64_t reservedSpace2:9;
      uint64_t LFXOEDGE:1;
      uint64_t LFRCOEDGE:1;
      uint64_t ULFRCOEDGE:1;
      uint64_t reservedSpace3:1;
      uint64_t CMUERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HFRCORDY:1;
      uint64_t HFXORDY:1;
      uint64_t LFRCORDY:1;
      uint64_t LFXORDY:1;
      uint64_t AUXHFRCORDY:1;
      uint64_t CALRDY:1;
      uint64_t CALOF:1;
      uint64_t USHFRCORDY:1;
      uint64_t HFXODISERR:1;
      uint64_t HFXOAUTOSW:1;
      uint64_t reservedSpace0:1;
      uint64_t HFXOPEAKDETRDY:1;
      uint64_t reservedSpace1:1;
      uint64_t HFRCODIS:1;
      uint64_t LFTIMEOUTERR:1;
      uint64_t DPLLRDY:1;
      uint64_t DPLLLOCKFAILLOW:1;
      uint64_t DPLLLOCKFAILHIGH:1;
      uint64_t reservedSpace2:9;
      uint64_t LFXOEDGE:1;
      uint64_t LFRCOEDGE:1;
      uint64_t ULFRCOEDGE:1;
      uint64_t reservedSpace3:1;
      uint64_t CMUERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HFRCORDY:1;
      uint64_t HFXORDY:1;
      uint64_t LFRCORDY:1;
      uint64_t LFXORDY:1;
      uint64_t AUXHFRCORDY:1;
      uint64_t CALRDY:1;
      uint64_t CALOF:1;
      uint64_t USHFRCORDY:1;
      uint64_t HFXODISERR:1;
      uint64_t HFXOAUTOSW:1;
      uint64_t reservedSpace0:1;
      uint64_t HFXOPEAKDETRDY:1;
      uint64_t reservedSpace1:1;
      uint64_t HFRCODIS:1;
      uint64_t LFTIMEOUTERR:1;
      uint64_t DPLLRDY:1;
      uint64_t DPLLLOCKFAILLOW:1;
      uint64_t DPLLLOCKFAILHIGH:1;
      uint64_t reservedSpace2:9;
      uint64_t LFXOEDGE:1;
      uint64_t LFRCOEDGE:1;
      uint64_t ULFRCOEDGE:1;
      uint64_t reservedSpace3:1;
      uint64_t CMUERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LE:1;
      uint64_t CRYPTO0_bitfield:1;
      uint64_t EBI_bitfield:1;
      uint64_t ETH_bitfield:1;
      uint64_t SDIO_bitfield:1;
      uint64_t GPIO_bitfield:1;
      uint64_t PRS_bitfield:1;
      uint64_t LDMA_bitfield:1;
      uint64_t GPCRC_bitfield:1;
      uint64_t QSPI0_bitfield:1;
      uint64_t USB_bitfield:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HFBUSCLKEN0;

  uint8_t res11[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMER0_bitfield:1;
      uint64_t TIMER1_bitfield:1;
      uint64_t TIMER2_bitfield:1;
      uint64_t TIMER3_bitfield:1;
      uint64_t TIMER4_bitfield:1;
      uint64_t TIMER5_bitfield:1;
      uint64_t TIMER6_bitfield:1;
      uint64_t USART0_bitfield:1;
      uint64_t USART1_bitfield:1;
      uint64_t USART2_bitfield:1;
      uint64_t USART3_bitfield:1;
      uint64_t USART4_bitfield:1;
      uint64_t USART5_bitfield:1;
      uint64_t ACMP0_bitfield:1;
      uint64_t ACMP1_bitfield:1;
      uint64_t ACMP2_bitfield:1;
      uint64_t ACMP3_bitfield:1;
      uint64_t I2C0_bitfield:1;
      uint64_t I2C1_bitfield:1;
      uint64_t I2C2_bitfield:1;
      uint64_t ADC0_bitfield:1;
      uint64_t ADC1_bitfield:1;
      uint64_t CRYOTIMER_bitfield:1;
      uint64_t IDAC0_bitfield:1;
      uint64_t TRNG0_bitfield:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HFPERCLKEN0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WTIMER0_bitfield:1;
      uint64_t WTIMER1_bitfield:1;
      uint64_t WTIMER2_bitfield:1;
      uint64_t WTIMER3_bitfield:1;
      uint64_t UART0_bitfield:1;
      uint64_t UART1_bitfield:1;
      uint64_t CAN0_bitfield:1;
      uint64_t CAN1_bitfield:1;
      uint64_t VDAC0_bitfield:1;
      uint64_t CSEN_bitfield:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HFPERCLKEN1;

