iSYSTEMLabs/winIDEAExampleWorkspaces/SiliconLabs/EFM32GG11/targetInit/efm32gg11_sfr.h
  uint8_t res23[104];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USBCLKSEL:3;
      uint64_t reservedSpace0:4;
      uint64_t USBCLKEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USBCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USBCREN:1;
      uint64_t USBLSCRMD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USBCRCTRL;

};

#define CMU (*(volatile struct CMU_tag *) 0x400e4000)

struct CRYPTO0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES:1;
      uint64_t KEYBUFDIS:1;
      uint64_t SHA:1;
      uint64_t reservedSpace0:7;
      uint64_t NOBUSYSTALL:1;
      uint64_t reservedSpace1:3;
      uint64_t INCWIDTH:2;
      uint64_t DMA0MODE:2;
      uint64_t reservedSpace2:2;
      uint64_t DMA0RSEL:2;
      uint64_t reservedSpace3:2;
      uint64_t DMA1MODE:2;
      uint64_t reservedSpace4:2;
      uint64_t DMA1RSEL:2;
      uint64_t reservedSpace5:1;
      uint64_t COMBDMA0WEREQ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODULUS:4;
      uint64_t MODOP:1;
      uint64_t reservedSpace0:3;
      uint64_t MULWIDTH:2;
      uint64_t RESULTWIDTH:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WAC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INSTR:8;
      uint64_t reservedSpace0:1;
      uint64_t SEQSTART:1;
      uint64_t SEQSTOP:1;
      uint64_t SEQSTEP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMD;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEQRUNNING:1;
      uint64_t INSTRRUNNING:1;
      uint64_t DMAACTIVE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA0ZERO:4;
      uint64_t reservedSpace0:4;
      uint64_t DDATA0LSBS:4;
      uint64_t reservedSpace1:4;
      uint64_t DDATA0MSBS:4;
      uint64_t DDATA1MSB:1;
      uint64_t reservedSpace2:3;
      uint64_t CARRY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSTATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t V0:3;
      uint64_t reservedSpace0:5;
      uint64_t V1:3;
      uint64_t reservedSpace1:5;
      uint64_t SEQPART:1;
      uint64_t SEQSKIP:1;
      uint64_t reservedSpace2:2;
      uint64_t SEQIP:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSTATUS;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEY:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) KEY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEYBUF:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) KEYBUF;

  uint8_t res2[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LENGTHA:14;
      uint64_t reservedSpace0:6;
      uint64_t BLOCKSIZE:2;
      uint64_t reservedSpace1:2;
      uint64_t DMA0SKIP:2;
      uint64_t DMA1SKIP:2;
      uint64_t DMA0PRESA:1;
      uint64_t DMA1PRESA:1;
      uint64_t reservedSpace2:1;
      uint64_t HALT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEQCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LENGTHB:14;
      uint64_t reservedSpace0:14;
      uint64_t DMA0PRESB:1;
      uint64_t DMA1PRESB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEQCTRLB;

  uint8_t res3[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INSTRDONE:1;
      uint64_t SEQDONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INSTRDONE:1;
      uint64_t SEQDONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INSTRDONE:1;
      uint64_t SEQDONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INSTRDONE:1;
      uint64_t SEQDONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INSTR0:8;
      uint64_t INSTR1:8;
      uint64_t INSTR2:8;
      uint64_t INSTR3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEQ0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INSTR4:8;
      uint64_t INSTR5:8;
      uint64_t INSTR6:8;
      uint64_t INSTR7:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEQ1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INSTR8:8;
      uint64_t INSTR9:8;
      uint64_t INSTR10:8;
      uint64_t INSTR11:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEQ2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INSTR12:8;
      uint64_t INSTR13:8;
      uint64_t INSTR14:8;
      uint64_t INSTR15:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEQ3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INSTR16:8;
      uint64_t INSTR17:8;
      uint64_t INSTR18:8;
      uint64_t INSTR19:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEQ4;

  uint8_t res4[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA3:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA3;

  uint8_t res5[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA0XOR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA0XOR;

  uint8_t res6[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA0BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA0BYTE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA1BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA1BYTE;

