iSYSTEMLabs/winIDEAExampleWorkspaces/SiliconLabs/EFM32GG11/targetInit/efm32gg11_sfr.h
  uint8_t res7[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA0XORBYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA0XORBYTE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA0BYTE12:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA0BYTE12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA0BYTE13:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA0BYTE13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA0BYTE14:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA0BYTE14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA0BYTE15:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA0BYTE15;

  uint8_t res8[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DDATA0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DDATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DDATA1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DDATA1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DDATA2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DDATA2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DDATA3:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DDATA3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DDATA4:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DDATA4;

  uint8_t res9[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DDATA0BIG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DDATA0BIG;

  uint8_t res10[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DDATA0BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DDATA0BYTE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DDATA1BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DDATA1BYTE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DDATA0BYTE32:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DDATA0BYTE32;

  uint8_t res11[52];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QDATA0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QDATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QDATA1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QDATA1;

  uint8_t res12[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QDATA1BIG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QDATA1BIG;

  uint8_t res13[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QDATA0BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QDATA0BYTE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QDATA1BYTE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QDATA1BYTE;

};

#define CRYPTO0 (*(volatile struct CRYPTO0_tag *) 0x400f0000)

struct LESENSE_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCANMODE:2;
      uint64_t PRSSEL:5;
      uint64_t SCANCONF:2;
      uint64_t reservedSpace0:2;
      uint64_t ALTEXMAP:1;
      uint64_t reservedSpace1:1;
      uint64_t DUALSAMPLE:1;
      uint64_t reservedSpace2:2;
      uint64_t BUFOW:1;
      uint64_t STRSCANRES:1;
      uint64_t reservedSpace3:1;
      uint64_t BUFIDL:1;
      uint64_t DMAWU:2;
      uint64_t DEBUGRUN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AUXPRESC:2;
      uint64_t reservedSpace0:2;
      uint64_t LFPRESC:3;
      uint64_t reservedSpace1:1;
      uint64_t PCPRESC:3;
      uint64_t reservedSpace2:1;
      uint64_t PCTOP:8;
      uint64_t reservedSpace3:2;
      uint64_t STARTDLY:2;
      uint64_t reservedSpace4:4;
      uint64_t AUXSTARTUP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DACCH0EN:1;
      uint64_t DACCH1EN:1;
      uint64_t DACCH0DATA:1;
      uint64_t DACCH1DATA:1;
      uint64_t reservedSpace0:2;
      uint64_t DACSTARTUP:1;
      uint64_t reservedSpace1:1;
      uint64_t DACCONVTRIG:1;
      uint64_t reservedSpace2:11;
      uint64_t ACMP0MODE:2;
      uint64_t ACMP1MODE:2;
      uint64_t ACMP0INV:1;
      uint64_t ACMP1INV:1;
      uint64_t ACMP0HYSTEN:1;
      uint64_t ACMP1HYSTEN:1;
      uint64_t WARMUPMODE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PERCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DISABLE:1;
      uint64_t ERRCHK:1;
      uint64_t INTMAP:1;
      uint64_t HYSTPRS0:1;
      uint64_t HYSTPRS1:1;
      uint64_t HYSTPRS2:1;
      uint64_t HYSTIRQ:1;
      uint64_t PRSCNT:1;
      uint64_t INPUT:1;
      uint64_t reservedSpace0:1;
      uint64_t PRSSEL0:5;
      uint64_t PRSSEL1:5;
      uint64_t PRSSEL2:5;
      uint64_t PRSSEL3:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DECCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BIASMODE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BIASCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WINSIZE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVALCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DECCMPVAL:5;
      uint64_t reservedSpace0:3;
      uint64_t DECCMPMASK:5;
      uint64_t reservedSpace1:3;
      uint64_t DECCMPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRSCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t START:1;
      uint64_t STOP:1;
      uint64_t DECODE:1;
      uint64_t CLEARBUF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHEN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCANRES:16;
      uint64_t STEPDIR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCANRES;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BUFDATAV:1;
      uint64_t BUFHALFFULL:1;
      uint64_t BUFFULL:1;
      uint64_t RUNNING:1;
      uint64_t SCANACTIVE:1;
      uint64_t DACACTIVE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RD:4;
      uint64_t WR:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BUFDATA:16;
      uint64_t BUFDATASRC:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BUFDATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CURCH:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CURCH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DECSTATE:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DECSTATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SENSORSTATE:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SENSORSTATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0:2;
      uint64_t CH1:2;
      uint64_t CH2:2;
      uint64_t CH3:2;
      uint64_t CH4:2;
      uint64_t CH5:2;
      uint64_t CH6:2;
      uint64_t CH7:2;
      uint64_t CH8:2;
      uint64_t CH9:2;
      uint64_t CH10:2;
      uint64_t CH11:2;
      uint64_t CH12:2;
      uint64_t CH13:2;
      uint64_t CH14:2;
      uint64_t CH15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IDLECONF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IDLECONF0:2;
      uint64_t IDLECONF1:2;
      uint64_t IDLECONF2:2;
      uint64_t IDLECONF3:2;
      uint64_t IDLECONF4:2;
      uint64_t IDLECONF5:2;
      uint64_t IDLECONF6:2;
      uint64_t IDLECONF7:2;
      uint64_t AEX0:1;
      uint64_t AEX1:1;
      uint64_t AEX2:1;
      uint64_t AEX3:1;
      uint64_t AEX4:1;
      uint64_t AEX5:1;
      uint64_t AEX6:1;
      uint64_t AEX7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALTEXCONF;

