iSYSTEMLabs/winIDEAExampleWorkspaces/SiliconLabs/EFM32GG11/targetInit/efm32gg11_sfr.h
  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0:1;
      uint64_t CH1:1;
      uint64_t CH2:1;
      uint64_t CH3:1;
      uint64_t CH4:1;
      uint64_t CH5:1;
      uint64_t CH6:1;
      uint64_t CH7:1;
      uint64_t CH8:1;
      uint64_t CH9:1;
      uint64_t CH10:1;
      uint64_t CH11:1;
      uint64_t CH12:1;
      uint64_t CH13:1;
      uint64_t CH14:1;
      uint64_t CH15:1;
      uint64_t SCANCOMPLETE:1;
      uint64_t DEC:1;
      uint64_t DECERR:1;
      uint64_t BUFDATAV:1;
      uint64_t BUFLEVEL:1;
      uint64_t BUFOF:1;
      uint64_t CNTOF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0:1;
      uint64_t CH1:1;
      uint64_t CH2:1;
      uint64_t CH3:1;
      uint64_t CH4:1;
      uint64_t CH5:1;
      uint64_t CH6:1;
      uint64_t CH7:1;
      uint64_t CH8:1;
      uint64_t CH9:1;
      uint64_t CH10:1;
      uint64_t CH11:1;
      uint64_t CH12:1;
      uint64_t CH13:1;
      uint64_t CH14:1;
      uint64_t CH15:1;
      uint64_t SCANCOMPLETE:1;
      uint64_t DEC:1;
      uint64_t DECERR:1;
      uint64_t BUFDATAV:1;
      uint64_t BUFLEVEL:1;
      uint64_t BUFOF:1;
      uint64_t CNTOF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0:1;
      uint64_t CH1:1;
      uint64_t CH2:1;
      uint64_t CH3:1;
      uint64_t CH4:1;
      uint64_t CH5:1;
      uint64_t CH6:1;
      uint64_t CH7:1;
      uint64_t CH8:1;
      uint64_t CH9:1;
      uint64_t CH10:1;
      uint64_t CH11:1;
      uint64_t CH12:1;
      uint64_t CH13:1;
      uint64_t CH14:1;
      uint64_t CH15:1;
      uint64_t SCANCOMPLETE:1;
      uint64_t DEC:1;
      uint64_t DECERR:1;
      uint64_t BUFDATAV:1;
      uint64_t BUFLEVEL:1;
      uint64_t BUFOF:1;
      uint64_t CNTOF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0:1;
      uint64_t CH1:1;
      uint64_t CH2:1;
      uint64_t CH3:1;
      uint64_t CH4:1;
      uint64_t CH5:1;
      uint64_t CH6:1;
      uint64_t CH7:1;
      uint64_t CH8:1;
      uint64_t CH9:1;
      uint64_t CH10:1;
      uint64_t CH11:1;
      uint64_t CH12:1;
      uint64_t CH13:1;
      uint64_t CH14:1;
      uint64_t CH15:1;
      uint64_t SCANCOMPLETE:1;
      uint64_t DEC:1;
      uint64_t DECERR:1;
      uint64_t BUFDATAV:1;
      uint64_t BUFLEVEL:1;
      uint64_t BUFOF:1;
      uint64_t CNTOF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:7;
      uint64_t CMD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYNCBUSY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0PEN:1;
      uint64_t CH1PEN:1;
      uint64_t CH2PEN:1;
      uint64_t CH3PEN:1;
      uint64_t CH4PEN:1;
      uint64_t CH5PEN:1;
      uint64_t CH6PEN:1;
      uint64_t CH7PEN:1;
      uint64_t CH8PEN:1;
      uint64_t CH9PEN:1;
      uint64_t CH10PEN:1;
      uint64_t CH11PEN:1;
      uint64_t CH12PEN:1;
      uint64_t CH13PEN:1;
      uint64_t CH14PEN:1;
      uint64_t CH15PEN:1;
      uint64_t ALTEX0PEN:1;
      uint64_t ALTEX1PEN:1;
      uint64_t ALTEX2PEN:1;
      uint64_t ALTEX3PEN:1;
      uint64_t ALTEX4PEN:1;
      uint64_t ALTEX5PEN:1;
      uint64_t ALTEX6PEN:1;
      uint64_t ALTEX7PEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ROUTEPEN;

  uint8_t res1[152];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:4;
      uint64_t MASK:4;
      uint64_t NEXTSTATE:5;
      uint64_t reservedSpace0:1;
      uint64_t CHAIN:1;
      uint64_t SETIF:1;
      uint64_t PRSACT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ST0_TCONFA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:4;
      uint64_t MASK:4;
      uint64_t NEXTSTATE:5;
      uint64_t reservedSpace0:2;
      uint64_t SETIF:1;
      uint64_t PRSACT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ST0_TCONFB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:4;
      uint64_t MASK:4;
      uint64_t NEXTSTATE:5;
      uint64_t reservedSpace0:1;
      uint64_t CHAIN:1;
      uint64_t SETIF:1;
      uint64_t PRSACT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ST1_TCONFA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:4;
      uint64_t MASK:4;
      uint64_t NEXTSTATE:5;
      uint64_t reservedSpace0:2;
      uint64_t SETIF:1;
      uint64_t PRSACT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ST1_TCONFB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:4;
      uint64_t MASK:4;
      uint64_t NEXTSTATE:5;
      uint64_t reservedSpace0:1;
      uint64_t CHAIN:1;
      uint64_t SETIF:1;
      uint64_t PRSACT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ST2_TCONFA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:4;
      uint64_t MASK:4;
      uint64_t NEXTSTATE:5;
      uint64_t reservedSpace0:2;
      uint64_t SETIF:1;
      uint64_t PRSACT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ST2_TCONFB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:4;
      uint64_t MASK:4;
      uint64_t NEXTSTATE:5;
      uint64_t reservedSpace0:1;
      uint64_t CHAIN:1;
      uint64_t SETIF:1;
      uint64_t PRSACT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ST3_TCONFA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:4;
      uint64_t MASK:4;
      uint64_t NEXTSTATE:5;
      uint64_t reservedSpace0:2;
      uint64_t SETIF:1;
      uint64_t PRSACT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ST3_TCONFB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:4;
      uint64_t MASK:4;
      uint64_t NEXTSTATE:5;
      uint64_t reservedSpace0:1;
      uint64_t CHAIN:1;
      uint64_t SETIF:1;
      uint64_t PRSACT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ST4_TCONFA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:4;
      uint64_t MASK:4;
      uint64_t NEXTSTATE:5;
      uint64_t reservedSpace0:2;
      uint64_t SETIF:1;
      uint64_t PRSACT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ST4_TCONFB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:4;
      uint64_t MASK:4;
      uint64_t NEXTSTATE:5;
      uint64_t reservedSpace0:1;
      uint64_t CHAIN:1;
      uint64_t SETIF:1;
      uint64_t PRSACT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ST5_TCONFA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:4;
      uint64_t MASK:4;
      uint64_t NEXTSTATE:5;
      uint64_t reservedSpace0:2;
      uint64_t SETIF:1;
      uint64_t PRSACT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ST5_TCONFB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:4;
      uint64_t MASK:4;
      uint64_t NEXTSTATE:5;
      uint64_t reservedSpace0:1;
      uint64_t CHAIN:1;
      uint64_t SETIF:1;
      uint64_t PRSACT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ST6_TCONFA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:4;
      uint64_t MASK:4;
      uint64_t NEXTSTATE:5;
      uint64_t reservedSpace0:2;
      uint64_t SETIF:1;
      uint64_t PRSACT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ST6_TCONFB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:4;
      uint64_t MASK:4;
      uint64_t NEXTSTATE:5;
      uint64_t reservedSpace0:1;
      uint64_t CHAIN:1;
      uint64_t SETIF:1;
      uint64_t PRSACT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ST7_TCONFA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:4;
      uint64_t MASK:4;
      uint64_t NEXTSTATE:5;
      uint64_t reservedSpace0:2;
      uint64_t SETIF:1;
      uint64_t PRSACT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ST7_TCONFB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:4;
      uint64_t MASK:4;
      uint64_t NEXTSTATE:5;
      uint64_t reservedSpace0:1;
      uint64_t CHAIN:1;
      uint64_t SETIF:1;
      uint64_t PRSACT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ST8_TCONFA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:4;
      uint64_t MASK:4;
      uint64_t NEXTSTATE:5;
      uint64_t reservedSpace0:2;
      uint64_t SETIF:1;
      uint64_t PRSACT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ST8_TCONFB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:4;
      uint64_t MASK:4;
      uint64_t NEXTSTATE:5;
      uint64_t reservedSpace0:1;
      uint64_t CHAIN:1;
      uint64_t SETIF:1;
      uint64_t PRSACT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ST9_TCONFA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:4;
      uint64_t MASK:4;
      uint64_t NEXTSTATE:5;
      uint64_t reservedSpace0:2;
      uint64_t SETIF:1;
      uint64_t PRSACT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ST9_TCONFB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:4;
      uint64_t MASK:4;
      uint64_t NEXTSTATE:5;
      uint64_t reservedSpace0:1;
      uint64_t CHAIN:1;
      uint64_t SETIF:1;
      uint64_t PRSACT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ST10_TCONFA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:4;
      uint64_t MASK:4;
      uint64_t NEXTSTATE:5;
      uint64_t reservedSpace0:2;
      uint64_t SETIF:1;
      uint64_t PRSACT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ST10_TCONFB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:4;
      uint64_t MASK:4;
      uint64_t NEXTSTATE:5;
      uint64_t reservedSpace0:1;
      uint64_t CHAIN:1;
      uint64_t SETIF:1;
      uint64_t PRSACT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ST11_TCONFA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:4;
      uint64_t MASK:4;
      uint64_t NEXTSTATE:5;
      uint64_t reservedSpace0:2;
      uint64_t SETIF:1;
      uint64_t PRSACT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ST11_TCONFB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:4;
      uint64_t MASK:4;
      uint64_t NEXTSTATE:5;
      uint64_t reservedSpace0:1;
      uint64_t CHAIN:1;
      uint64_t SETIF:1;
      uint64_t PRSACT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ST12_TCONFA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:4;
      uint64_t MASK:4;
      uint64_t NEXTSTATE:5;
      uint64_t reservedSpace0:2;
      uint64_t SETIF:1;
      uint64_t PRSACT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ST12_TCONFB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:4;
      uint64_t MASK:4;
      uint64_t NEXTSTATE:5;
      uint64_t reservedSpace0:1;
      uint64_t CHAIN:1;
      uint64_t SETIF:1;
      uint64_t PRSACT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ST13_TCONFA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:4;
      uint64_t MASK:4;
      uint64_t NEXTSTATE:5;
      uint64_t reservedSpace0:2;
      uint64_t SETIF:1;
      uint64_t PRSACT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ST13_TCONFB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:4;
      uint64_t MASK:4;
      uint64_t NEXTSTATE:5;
      uint64_t reservedSpace0:1;
      uint64_t CHAIN:1;
      uint64_t SETIF:1;
      uint64_t PRSACT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ST14_TCONFA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:4;
      uint64_t MASK:4;
      uint64_t NEXTSTATE:5;
      uint64_t reservedSpace0:2;
      uint64_t SETIF:1;
      uint64_t PRSACT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ST14_TCONFB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:4;
      uint64_t MASK:4;
      uint64_t NEXTSTATE:5;
      uint64_t reservedSpace0:1;
      uint64_t CHAIN:1;
      uint64_t SETIF:1;
      uint64_t PRSACT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ST15_TCONFA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:4;
      uint64_t MASK:4;
      uint64_t NEXTSTATE:5;
      uint64_t reservedSpace0:2;
      uint64_t SETIF:1;
      uint64_t PRSACT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ST15_TCONFB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:4;
      uint64_t MASK:4;
      uint64_t NEXTSTATE:5;
      uint64_t reservedSpace0:1;
      uint64_t CHAIN:1;
      uint64_t SETIF:1;
      uint64_t PRSACT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ST16_TCONFA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:4;
      uint64_t MASK:4;
      uint64_t NEXTSTATE:5;
      uint64_t reservedSpace0:2;
      uint64_t SETIF:1;
      uint64_t PRSACT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ST16_TCONFB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:4;
      uint64_t MASK:4;
      uint64_t NEXTSTATE:5;
      uint64_t reservedSpace0:1;
      uint64_t CHAIN:1;
      uint64_t SETIF:1;
      uint64_t PRSACT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ST17_TCONFA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:4;
      uint64_t MASK:4;
      uint64_t NEXTSTATE:5;
      uint64_t reservedSpace0:2;
      uint64_t SETIF:1;
      uint64_t PRSACT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ST17_TCONFB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:4;
      uint64_t MASK:4;
      uint64_t NEXTSTATE:5;
      uint64_t reservedSpace0:1;
      uint64_t CHAIN:1;
      uint64_t SETIF:1;
      uint64_t PRSACT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ST18_TCONFA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:4;
      uint64_t MASK:4;
      uint64_t NEXTSTATE:5;
      uint64_t reservedSpace0:2;
      uint64_t SETIF:1;
      uint64_t PRSACT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ST18_TCONFB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:4;
      uint64_t MASK:4;
      uint64_t NEXTSTATE:5;
      uint64_t reservedSpace0:1;
      uint64_t CHAIN:1;
      uint64_t SETIF:1;
      uint64_t PRSACT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ST19_TCONFA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:4;
      uint64_t MASK:4;
      uint64_t NEXTSTATE:5;
      uint64_t reservedSpace0:2;
      uint64_t SETIF:1;
      uint64_t PRSACT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ST19_TCONFB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:4;
      uint64_t MASK:4;
      uint64_t NEXTSTATE:5;
      uint64_t reservedSpace0:1;
      uint64_t CHAIN:1;
      uint64_t SETIF:1;
      uint64_t PRSACT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ST20_TCONFA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:4;
      uint64_t MASK:4;
      uint64_t NEXTSTATE:5;
      uint64_t reservedSpace0:2;
      uint64_t SETIF:1;
      uint64_t PRSACT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ST20_TCONFB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:4;
      uint64_t MASK:4;
      uint64_t NEXTSTATE:5;
      uint64_t reservedSpace0:1;
      uint64_t CHAIN:1;
      uint64_t SETIF:1;
      uint64_t PRSACT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ST21_TCONFA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:4;
      uint64_t MASK:4;
      uint64_t NEXTSTATE:5;
      uint64_t reservedSpace0:2;
      uint64_t SETIF:1;
      uint64_t PRSACT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ST21_TCONFB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:4;
      uint64_t MASK:4;
      uint64_t NEXTSTATE:5;
      uint64_t reservedSpace0:1;
      uint64_t CHAIN:1;
      uint64_t SETIF:1;
      uint64_t PRSACT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ST22_TCONFA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:4;
      uint64_t MASK:4;
      uint64_t NEXTSTATE:5;
      uint64_t reservedSpace0:2;
      uint64_t SETIF:1;
      uint64_t PRSACT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ST22_TCONFB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:4;
      uint64_t MASK:4;
      uint64_t NEXTSTATE:5;
      uint64_t reservedSpace0:1;
      uint64_t CHAIN:1;
      uint64_t SETIF:1;
      uint64_t PRSACT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ST23_TCONFA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:4;
      uint64_t MASK:4;
      uint64_t NEXTSTATE:5;
      uint64_t reservedSpace0:2;
      uint64_t SETIF:1;
      uint64_t PRSACT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ST23_TCONFB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:4;
      uint64_t MASK:4;
      uint64_t NEXTSTATE:5;
      uint64_t reservedSpace0:1;
      uint64_t CHAIN:1;
      uint64_t SETIF:1;
      uint64_t PRSACT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ST24_TCONFA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:4;
      uint64_t MASK:4;
      uint64_t NEXTSTATE:5;
      uint64_t reservedSpace0:2;
      uint64_t SETIF:1;
      uint64_t PRSACT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ST24_TCONFB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:4;
      uint64_t MASK:4;
      uint64_t NEXTSTATE:5;
      uint64_t reservedSpace0:1;
      uint64_t CHAIN:1;
      uint64_t SETIF:1;
      uint64_t PRSACT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ST25_TCONFA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:4;
      uint64_t MASK:4;
      uint64_t NEXTSTATE:5;
      uint64_t reservedSpace0:2;
      uint64_t SETIF:1;
      uint64_t PRSACT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ST25_TCONFB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:4;
      uint64_t MASK:4;
      uint64_t NEXTSTATE:5;
      uint64_t reservedSpace0:1;
      uint64_t CHAIN:1;
      uint64_t SETIF:1;
      uint64_t PRSACT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ST26_TCONFA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:4;
      uint64_t MASK:4;
      uint64_t NEXTSTATE:5;
      uint64_t reservedSpace0:2;
      uint64_t SETIF:1;
      uint64_t PRSACT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ST26_TCONFB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:4;
      uint64_t MASK:4;
      uint64_t NEXTSTATE:5;
      uint64_t reservedSpace0:1;
      uint64_t CHAIN:1;
      uint64_t SETIF:1;
      uint64_t PRSACT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ST27_TCONFA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:4;
      uint64_t MASK:4;
      uint64_t NEXTSTATE:5;
      uint64_t reservedSpace0:2;
      uint64_t SETIF:1;
      uint64_t PRSACT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ST27_TCONFB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:4;
      uint64_t MASK:4;
      uint64_t NEXTSTATE:5;
      uint64_t reservedSpace0:1;
      uint64_t CHAIN:1;
      uint64_t SETIF:1;
      uint64_t PRSACT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ST28_TCONFA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:4;
      uint64_t MASK:4;
      uint64_t NEXTSTATE:5;
      uint64_t reservedSpace0:2;
      uint64_t SETIF:1;
      uint64_t PRSACT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ST28_TCONFB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:4;
      uint64_t MASK:4;
      uint64_t NEXTSTATE:5;
      uint64_t reservedSpace0:1;
      uint64_t CHAIN:1;
      uint64_t SETIF:1;
      uint64_t PRSACT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ST29_TCONFA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:4;
      uint64_t MASK:4;
      uint64_t NEXTSTATE:5;
      uint64_t reservedSpace0:2;
      uint64_t SETIF:1;
      uint64_t PRSACT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ST29_TCONFB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:4;
      uint64_t MASK:4;
      uint64_t NEXTSTATE:5;
      uint64_t reservedSpace0:1;
      uint64_t CHAIN:1;
      uint64_t SETIF:1;
      uint64_t PRSACT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ST30_TCONFA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:4;
      uint64_t MASK:4;
      uint64_t NEXTSTATE:5;
      uint64_t reservedSpace0:2;
      uint64_t SETIF:1;
      uint64_t PRSACT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ST30_TCONFB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:4;
      uint64_t MASK:4;
      uint64_t NEXTSTATE:5;
      uint64_t reservedSpace0:1;
      uint64_t CHAIN:1;
      uint64_t SETIF:1;
      uint64_t PRSACT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ST31_TCONFA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:4;
      uint64_t MASK:4;
      uint64_t NEXTSTATE:5;
      uint64_t reservedSpace0:2;
      uint64_t SETIF:1;
      uint64_t PRSACT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ST31_TCONFB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:16;
      uint64_t DATASRC:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BUF0_DATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:16;
      uint64_t DATASRC:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BUF1_DATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:16;
      uint64_t DATASRC:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BUF2_DATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:16;
      uint64_t DATASRC:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BUF3_DATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:16;
      uint64_t DATASRC:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BUF4_DATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:16;
      uint64_t DATASRC:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BUF5_DATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:16;
      uint64_t DATASRC:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BUF6_DATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:16;
      uint64_t DATASRC:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BUF7_DATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:16;
      uint64_t DATASRC:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BUF8_DATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:16;
      uint64_t DATASRC:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BUF9_DATA;

