iSYSTEMLabs/winIDEAExampleWorkspaces/SiliconLabs/EFM32GG11/targetInit/efm32gg11_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:16;
      uint64_t DATASRC:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BUF10_DATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:16;
      uint64_t DATASRC:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BUF11_DATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:16;
      uint64_t DATASRC:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BUF12_DATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:16;
      uint64_t DATASRC:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BUF13_DATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:16;
      uint64_t DATASRC:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BUF14_DATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:16;
      uint64_t DATASRC:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BUF15_DATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTIME:6;
      uint64_t SAMPLEDLY:8;
      uint64_t MEASUREDLY:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH0_TIMING;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRES:12;
      uint64_t SAMPLE:2;
      uint64_t SETIF:3;
      uint64_t EXMODE:2;
      uint64_t EXCLK:1;
      uint64_t SAMPLECLK:1;
      uint64_t ALTEX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH0_INTERACT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMPTHRES:16;
      uint64_t COMP:1;
      uint64_t DECODE:1;
      uint64_t STRSAMPLE:2;
      uint64_t SCANRESINV:1;
      uint64_t MODE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH0_EVAL;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTIME:6;
      uint64_t SAMPLEDLY:8;
      uint64_t MEASUREDLY:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH1_TIMING;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRES:12;
      uint64_t SAMPLE:2;
      uint64_t SETIF:3;
      uint64_t EXMODE:2;
      uint64_t EXCLK:1;
      uint64_t SAMPLECLK:1;
      uint64_t ALTEX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH1_INTERACT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMPTHRES:16;
      uint64_t COMP:1;
      uint64_t DECODE:1;
      uint64_t STRSAMPLE:2;
      uint64_t SCANRESINV:1;
      uint64_t MODE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH1_EVAL;

  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTIME:6;
      uint64_t SAMPLEDLY:8;
      uint64_t MEASUREDLY:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH2_TIMING;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRES:12;
      uint64_t SAMPLE:2;
      uint64_t SETIF:3;
      uint64_t EXMODE:2;
      uint64_t EXCLK:1;
      uint64_t SAMPLECLK:1;
      uint64_t ALTEX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH2_INTERACT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMPTHRES:16;
      uint64_t COMP:1;
      uint64_t DECODE:1;
      uint64_t STRSAMPLE:2;
      uint64_t SCANRESINV:1;
      uint64_t MODE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH2_EVAL;

  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTIME:6;
      uint64_t SAMPLEDLY:8;
      uint64_t MEASUREDLY:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH3_TIMING;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRES:12;
      uint64_t SAMPLE:2;
      uint64_t SETIF:3;
      uint64_t EXMODE:2;
      uint64_t EXCLK:1;
      uint64_t SAMPLECLK:1;
      uint64_t ALTEX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH3_INTERACT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMPTHRES:16;
      uint64_t COMP:1;
      uint64_t DECODE:1;
      uint64_t STRSAMPLE:2;
      uint64_t SCANRESINV:1;
      uint64_t MODE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH3_EVAL;

  uint8_t res5[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTIME:6;
      uint64_t SAMPLEDLY:8;
      uint64_t MEASUREDLY:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH4_TIMING;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRES:12;
      uint64_t SAMPLE:2;
      uint64_t SETIF:3;
      uint64_t EXMODE:2;
      uint64_t EXCLK:1;
      uint64_t SAMPLECLK:1;
      uint64_t ALTEX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH4_INTERACT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMPTHRES:16;
      uint64_t COMP:1;
      uint64_t DECODE:1;
      uint64_t STRSAMPLE:2;
      uint64_t SCANRESINV:1;
      uint64_t MODE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH4_EVAL;

  uint8_t res6[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTIME:6;
      uint64_t SAMPLEDLY:8;
      uint64_t MEASUREDLY:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH5_TIMING;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRES:12;
      uint64_t SAMPLE:2;
      uint64_t SETIF:3;
      uint64_t EXMODE:2;
      uint64_t EXCLK:1;
      uint64_t SAMPLECLK:1;
      uint64_t ALTEX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH5_INTERACT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMPTHRES:16;
      uint64_t COMP:1;
      uint64_t DECODE:1;
      uint64_t STRSAMPLE:2;
      uint64_t SCANRESINV:1;
      uint64_t MODE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH5_EVAL;

  uint8_t res7[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTIME:6;
      uint64_t SAMPLEDLY:8;
      uint64_t MEASUREDLY:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH6_TIMING;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRES:12;
      uint64_t SAMPLE:2;
      uint64_t SETIF:3;
      uint64_t EXMODE:2;
      uint64_t EXCLK:1;
      uint64_t SAMPLECLK:1;
      uint64_t ALTEX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH6_INTERACT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMPTHRES:16;
      uint64_t COMP:1;
      uint64_t DECODE:1;
      uint64_t STRSAMPLE:2;
      uint64_t SCANRESINV:1;
      uint64_t MODE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH6_EVAL;

  uint8_t res8[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTIME:6;
      uint64_t SAMPLEDLY:8;
      uint64_t MEASUREDLY:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH7_TIMING;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRES:12;
      uint64_t SAMPLE:2;
      uint64_t SETIF:3;
      uint64_t EXMODE:2;
      uint64_t EXCLK:1;
      uint64_t SAMPLECLK:1;
      uint64_t ALTEX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH7_INTERACT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMPTHRES:16;
      uint64_t COMP:1;
      uint64_t DECODE:1;
      uint64_t STRSAMPLE:2;
      uint64_t SCANRESINV:1;
      uint64_t MODE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH7_EVAL;

  uint8_t res9[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTIME:6;
      uint64_t SAMPLEDLY:8;
      uint64_t MEASUREDLY:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH8_TIMING;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRES:12;
      uint64_t SAMPLE:2;
      uint64_t SETIF:3;
      uint64_t EXMODE:2;
      uint64_t EXCLK:1;
      uint64_t SAMPLECLK:1;
      uint64_t ALTEX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH8_INTERACT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMPTHRES:16;
      uint64_t COMP:1;
      uint64_t DECODE:1;
      uint64_t STRSAMPLE:2;
      uint64_t SCANRESINV:1;
      uint64_t MODE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH8_EVAL;

  uint8_t res10[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTIME:6;
      uint64_t SAMPLEDLY:8;
      uint64_t MEASUREDLY:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH9_TIMING;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRES:12;
      uint64_t SAMPLE:2;
      uint64_t SETIF:3;
      uint64_t EXMODE:2;
      uint64_t EXCLK:1;
      uint64_t SAMPLECLK:1;
      uint64_t ALTEX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH9_INTERACT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMPTHRES:16;
      uint64_t COMP:1;
      uint64_t DECODE:1;
      uint64_t STRSAMPLE:2;
      uint64_t SCANRESINV:1;
      uint64_t MODE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH9_EVAL;

  uint8_t res11[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTIME:6;
      uint64_t SAMPLEDLY:8;
      uint64_t MEASUREDLY:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH10_TIMING;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRES:12;
      uint64_t SAMPLE:2;
      uint64_t SETIF:3;
      uint64_t EXMODE:2;
      uint64_t EXCLK:1;
      uint64_t SAMPLECLK:1;
      uint64_t ALTEX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH10_INTERACT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMPTHRES:16;
      uint64_t COMP:1;
      uint64_t DECODE:1;
      uint64_t STRSAMPLE:2;
      uint64_t SCANRESINV:1;
      uint64_t MODE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH10_EVAL;

  uint8_t res12[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTIME:6;
      uint64_t SAMPLEDLY:8;
      uint64_t MEASUREDLY:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH11_TIMING;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRES:12;
      uint64_t SAMPLE:2;
      uint64_t SETIF:3;
      uint64_t EXMODE:2;
      uint64_t EXCLK:1;
      uint64_t SAMPLECLK:1;
      uint64_t ALTEX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH11_INTERACT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMPTHRES:16;
      uint64_t COMP:1;
      uint64_t DECODE:1;
      uint64_t STRSAMPLE:2;
      uint64_t SCANRESINV:1;
      uint64_t MODE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH11_EVAL;

  uint8_t res13[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTIME:6;
      uint64_t SAMPLEDLY:8;
      uint64_t MEASUREDLY:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH12_TIMING;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRES:12;
      uint64_t SAMPLE:2;
      uint64_t SETIF:3;
      uint64_t EXMODE:2;
      uint64_t EXCLK:1;
      uint64_t SAMPLECLK:1;
      uint64_t ALTEX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH12_INTERACT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMPTHRES:16;
      uint64_t COMP:1;
      uint64_t DECODE:1;
      uint64_t STRSAMPLE:2;
      uint64_t SCANRESINV:1;
      uint64_t MODE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH12_EVAL;

  uint8_t res14[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTIME:6;
      uint64_t SAMPLEDLY:8;
      uint64_t MEASUREDLY:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH13_TIMING;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRES:12;
      uint64_t SAMPLE:2;
      uint64_t SETIF:3;
      uint64_t EXMODE:2;
      uint64_t EXCLK:1;
      uint64_t SAMPLECLK:1;
      uint64_t ALTEX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH13_INTERACT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMPTHRES:16;
      uint64_t COMP:1;
      uint64_t DECODE:1;
      uint64_t STRSAMPLE:2;
      uint64_t SCANRESINV:1;
      uint64_t MODE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH13_EVAL;

  uint8_t res15[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTIME:6;
      uint64_t SAMPLEDLY:8;
      uint64_t MEASUREDLY:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH14_TIMING;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRES:12;
      uint64_t SAMPLE:2;
      uint64_t SETIF:3;
      uint64_t EXMODE:2;
      uint64_t EXCLK:1;
      uint64_t SAMPLECLK:1;
      uint64_t ALTEX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH14_INTERACT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMPTHRES:16;
      uint64_t COMP:1;
      uint64_t DECODE:1;
      uint64_t STRSAMPLE:2;
      uint64_t SCANRESINV:1;
      uint64_t MODE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH14_EVAL;

  uint8_t res16[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTIME:6;
      uint64_t SAMPLEDLY:8;
      uint64_t MEASUREDLY:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH15_TIMING;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRES:12;
      uint64_t SAMPLE:2;
      uint64_t SETIF:3;
      uint64_t EXMODE:2;
      uint64_t EXCLK:1;
      uint64_t SAMPLECLK:1;
      uint64_t ALTEX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH15_INTERACT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMPTHRES:16;
      uint64_t COMP:1;
      uint64_t DECODE:1;
      uint64_t STRSAMPLE:2;
      uint64_t SCANRESINV:1;
      uint64_t MODE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH15_EVAL;

