iSYSTEMLabs/winIDEAExampleWorkspaces/SiliconLabs/EFM32GG11/targetInit/efm32gg11_sfr.h
};

#define LESENSE (*(volatile struct LESENSE_tag *) 0x40055000)

struct EBI_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:2;
      uint64_t MODE1:2;
      uint64_t MODE2:2;
      uint64_t MODE3:2;
      uint64_t BANK0EN:1;
      uint64_t BANK1EN:1;
      uint64_t BANK2EN:1;
      uint64_t BANK3EN:1;
      uint64_t NOIDLE:1;
      uint64_t NOIDLE1:1;
      uint64_t NOIDLE2:1;
      uint64_t NOIDLE3:1;
      uint64_t ARDYEN:1;
      uint64_t ARDYTODIS:1;
      uint64_t ARDY1EN:1;
      uint64_t ARDYTO1DIS:1;
      uint64_t ARDY2EN:1;
      uint64_t ARDYTO2DIS:1;
      uint64_t ARDY3EN:1;
      uint64_t ARDYTO3DIS:1;
      uint64_t BL:1;
      uint64_t BL1:1;
      uint64_t BL2:1;
      uint64_t BL3:1;
      uint64_t reservedSpace0:2;
      uint64_t ITS:1;
      uint64_t ALTMAP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDRSETUP:3;
      uint64_t reservedSpace0:5;
      uint64_t ADDRHOLD:3;
      uint64_t reservedSpace1:17;
      uint64_t HALFALE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADDRTIMING;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDSETUP:3;
      uint64_t reservedSpace0:5;
      uint64_t RDSTRB:7;
      uint64_t reservedSpace1:1;
      uint64_t RDHOLD:3;
      uint64_t reservedSpace2:9;
      uint64_t HALFRE:1;
      uint64_t PREFETCH:1;
      uint64_t PAGEMODE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RDTIMING;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WRSETUP:3;
      uint64_t reservedSpace0:5;
      uint64_t WRSTRB:7;
      uint64_t reservedSpace1:1;
      uint64_t WRHOLD:3;
      uint64_t reservedSpace2:9;
      uint64_t HALFWE:1;
      uint64_t WBUFDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WRTIMING;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSPOL:1;
      uint64_t REPOL:1;
      uint64_t WEPOL:1;
      uint64_t ALEPOL:1;
      uint64_t ARDYPOL:1;
      uint64_t BLPOL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) POLARITY;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDRSETUP:3;
      uint64_t reservedSpace0:5;
      uint64_t ADDRHOLD:3;
      uint64_t reservedSpace1:17;
      uint64_t HALFALE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADDRTIMING1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDSETUP:3;
      uint64_t reservedSpace0:5;
      uint64_t RDSTRB:7;
      uint64_t reservedSpace1:1;
      uint64_t RDHOLD:3;
      uint64_t reservedSpace2:9;
      uint64_t HALFRE:1;
      uint64_t PREFETCH:1;
      uint64_t PAGEMODE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RDTIMING1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WRSETUP:3;
      uint64_t reservedSpace0:5;
      uint64_t WRSTRB:7;
      uint64_t reservedSpace1:1;
      uint64_t WRHOLD:3;
      uint64_t reservedSpace2:9;
      uint64_t HALFWE:1;
      uint64_t WBUFDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WRTIMING1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSPOL:1;
      uint64_t REPOL:1;
      uint64_t WEPOL:1;
      uint64_t ALEPOL:1;
      uint64_t ARDYPOL:1;
      uint64_t BLPOL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) POLARITY1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDRSETUP:3;
      uint64_t reservedSpace0:5;
      uint64_t ADDRHOLD:3;
      uint64_t reservedSpace1:17;
      uint64_t HALFALE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADDRTIMING2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDSETUP:3;
      uint64_t reservedSpace0:5;
      uint64_t RDSTRB:7;
      uint64_t reservedSpace1:1;
      uint64_t RDHOLD:3;
      uint64_t reservedSpace2:9;
      uint64_t HALFRE:1;
      uint64_t PREFETCH:1;
      uint64_t PAGEMODE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RDTIMING2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WRSETUP:3;
      uint64_t reservedSpace0:5;
      uint64_t WRSTRB:7;
      uint64_t reservedSpace1:1;
      uint64_t WRHOLD:3;
      uint64_t reservedSpace2:9;
      uint64_t HALFWE:1;
      uint64_t WBUFDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WRTIMING2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSPOL:1;
      uint64_t REPOL:1;
      uint64_t WEPOL:1;
      uint64_t ALEPOL:1;
      uint64_t ARDYPOL:1;
      uint64_t BLPOL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) POLARITY2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDRSETUP:3;
      uint64_t reservedSpace0:5;
      uint64_t ADDRHOLD:3;
      uint64_t reservedSpace1:17;
      uint64_t HALFALE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADDRTIMING3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDSETUP:3;
      uint64_t reservedSpace0:5;
      uint64_t RDSTRB:7;
      uint64_t reservedSpace1:1;
      uint64_t RDHOLD:3;
      uint64_t reservedSpace2:9;
      uint64_t HALFRE:1;
      uint64_t PREFETCH:1;
      uint64_t PAGEMODE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RDTIMING3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WRSETUP:3;
      uint64_t reservedSpace0:5;
      uint64_t WRSTRB:7;
      uint64_t reservedSpace1:1;
      uint64_t WRHOLD:3;
      uint64_t reservedSpace2:9;
      uint64_t HALFWE:1;
      uint64_t WBUFDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WRTIMING3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSPOL:1;
      uint64_t REPOL:1;
      uint64_t WEPOL:1;
      uint64_t ALEPOL:1;
      uint64_t ARDYPOL:1;
      uint64_t BLPOL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) POLARITY3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAGELEN:2;
      uint64_t reservedSpace0:2;
      uint64_t INCHIT:1;
      uint64_t reservedSpace1:3;
      uint64_t RDPA:4;
      uint64_t reservedSpace2:8;
      uint64_t KEEPOPEN:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAGECTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:3;
      uint64_t BANKSEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NANDCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ECCSTART:1;
      uint64_t ECCSTOP:1;
      uint64_t ECCCLEAR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AHBACT:1;
      uint64_t reservedSpace0:3;
      uint64_t ECCACT:1;
      uint64_t reservedSpace1:3;
      uint64_t TFTPIXEL0EMPTY:1;
      uint64_t TFTPIXEL1EMPTY:1;
      uint64_t TFTPIXELFULL:1;
      uint64_t reservedSpace2:1;
      uint64_t DDACT:1;
      uint64_t TFTDDEMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ECCPARITY:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECCPARITY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DD:2;
      uint64_t MASKBLEND:4;
      uint64_t reservedSpace0:2;
      uint64_t SHIFTDCLKEN:1;
      uint64_t FBCTRIG:1;
      uint64_t INTERLEAVE:2;
      uint64_t COLOR1SRC:1;
      uint64_t reservedSpace1:3;
      uint64_t WIDTH:2;
      uint64_t reservedSpace2:1;
      uint64_t ALIASBANKEN:1;
      uint64_t BANKSEL:2;
      uint64_t ALIASBANK:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFTCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HCNT:11;
      uint64_t reservedSpace0:5;
      uint64_t VCNT:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFTSTATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PIXEL0FORMAT:3;
      uint64_t reservedSpace0:5;
      uint64_t PIXEL1FORMAT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFTCOLORFORMAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRAMEBASE:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFTFRAMEBASE;

