iSYSTEMLabs/winIDEAExampleWorkspaces/SiliconLabs/EFM32GG11/targetInit/efm32gg11_sfr.h
  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HSTRIDE:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFTSTRIDE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HSZ:10;
      uint64_t reservedSpace0:6;
      uint64_t VSZ:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFTSIZE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HSYNC:7;
      uint64_t reservedSpace0:1;
      uint64_t HFPORCH:8;
      uint64_t reservedSpace1:2;
      uint64_t HBPORCH:8;
      uint64_t reservedSpace2:2;
      uint64_t HSYNCSTART:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFTHPORCH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VSYNC:7;
      uint64_t reservedSpace0:1;
      uint64_t VFPORCH:12;
      uint64_t VBPORCH:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFTVPORCH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCLKPERIOD:12;
      uint64_t TFTSTART:12;
      uint64_t TFTSETUP:3;
      uint64_t reservedSpace0:1;
      uint64_t TFTHOLD:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFTTIMING;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSPOL:1;
      uint64_t DCLKPOL:1;
      uint64_t DATAENPOL:1;
      uint64_t HSYNCPOL:1;
      uint64_t VSYNCPOL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFTPOLARITY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFTDD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALPHA:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFTALPHA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFTPIXEL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFTPIXEL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFTPIXEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TFTMASK:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFTMASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VSYNC:1;
      uint64_t HSYNC:1;
      uint64_t VBPORCH:1;
      uint64_t VFPORCH:1;
      uint64_t DDEMPTY:1;
      uint64_t DDJIT:1;
      uint64_t TFTPIXEL0EMPTY:1;
      uint64_t TFTPIXEL1EMPTY:1;
      uint64_t TFTPIXELFULL:1;
      uint64_t TFTPIXELOF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VSYNC:1;
      uint64_t HSYNC:1;
      uint64_t VBPORCH:1;
      uint64_t VFPORCH:1;
      uint64_t DDEMPTY:1;
      uint64_t DDJIT:1;
      uint64_t TFTPIXEL0EMPTY:1;
      uint64_t TFTPIXEL1EMPTY:1;
      uint64_t TFTPIXELFULL:1;
      uint64_t TFTPIXELOF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VSYNC:1;
      uint64_t HSYNC:1;
      uint64_t VBPORCH:1;
      uint64_t VFPORCH:1;
      uint64_t DDEMPTY:1;
      uint64_t DDJIT:1;
      uint64_t TFTPIXEL0EMPTY:1;
      uint64_t TFTPIXEL1EMPTY:1;
      uint64_t TFTPIXELFULL:1;
      uint64_t TFTPIXELOF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VSYNC:1;
      uint64_t HSYNC:1;
      uint64_t VBPORCH:1;
      uint64_t VFPORCH:1;
      uint64_t DDEMPTY:1;
      uint64_t DDJIT:1;
      uint64_t TFTPIXEL0EMPTY:1;
      uint64_t TFTPIXEL1EMPTY:1;
      uint64_t TFTPIXELFULL:1;
      uint64_t TFTPIXELOF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EBIPEN:1;
      uint64_t CS0PEN:1;
      uint64_t CS1PEN:1;
      uint64_t CS2PEN:1;
      uint64_t CS3PEN:1;
      uint64_t ALEPEN:1;
      uint64_t ARDYPEN:1;
      uint64_t BLPEN:1;
      uint64_t reservedSpace0:4;
      uint64_t NANDPEN:1;
      uint64_t reservedSpace1:3;
      uint64_t ALB:2;
      uint64_t APEN:5;
      uint64_t reservedSpace2:1;
      uint64_t TFTPEN:1;
      uint64_t DATAENPEN:1;
      uint64_t CSTFTPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ROUTEPEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EBILOC:6;
      uint64_t reservedSpace0:2;
      uint64_t CSLOC:6;
      uint64_t reservedSpace1:2;
      uint64_t NANDLOC:6;
      uint64_t reservedSpace2:2;
      uint64_t TFTLOC:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ROUTELOC0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADLOC:6;
      uint64_t reservedSpace0:2;
      uint64_t ALOC:6;
      uint64_t reservedSpace1:2;
      uint64_t RDYLOC:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ROUTELOC1;

};

#define EBI (*(volatile struct EBI_tag *) 0x4000b000)

struct ETH_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t LOOPBACKLOCAL:1;
      uint64_t ENBRX:1;
      uint64_t ENBTX:1;
      uint64_t MANPORTEN:1;
      uint64_t CLRALLSTATSREGS:1;
      uint64_t INCALLSTATSREGS:1;
      uint64_t STATSWREN:1;
      uint64_t BACKPRESSURE:1;
      uint64_t TXSTRT:1;
      uint64_t TXHALT:1;
      uint64_t TXPFRMREQ:1;
      uint64_t TXPFRMZERO:1;
      uint64_t reservedSpace1:2;
      uint64_t STORERXTS:1;
      uint64_t PFCENB:1;
      uint64_t TXPFCPRIORPFRM:1;
      uint64_t FLUSHRXPKT:1;
      uint64_t TXLPIEN:1;
      uint64_t PTPUNICASTEN:1;
      uint64_t reservedSpace2:1;
      uint64_t STOREUDPOFFSET:1;
      uint64_t reservedSpace3:1;
      uint64_t ONESTEPSYNCMODE:1;
      uint64_t PFCCTRL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NETWORKCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SPEED:1;
      uint64_t FULLDUPLEX:1;
      uint64_t DISCRDNONVLANFRAMES:1;
      uint64_t JUMBOFRAMES:1;
      uint64_t COPYALLFRAMES:1;
      uint64_t NOBROADCAST:1;
      uint64_t MULTICASTHASHEN:1;
      uint64_t UNICASTHASHEN:1;
      uint64_t RX1536BYTEFRAMES:1;
      uint64_t reservedSpace0:3;
      uint64_t RETRYTEST:1;
      uint64_t PAUSEEN:1;
      uint64_t RXBUFFOFFSET:2;
      uint64_t LENFIELDERRFRMDISCRD:1;
      uint64_t FCSREMOVE:1;
      uint64_t MDCCLKDIV:3;
      uint64_t reservedSpace1:2;
      uint64_t DISCOPYOFPFRAMES:1;
      uint64_t RXCHKSUMOFFLOADEN:1;
      uint64_t ENHALFDUPLEXRX:1;
      uint64_t IGNORERXFCS:1;
      uint64_t reservedSpace2:1;
      uint64_t IPGSTRTCHEN:1;
      uint64_t NSPCHANGE:1;
      uint64_t IGNOREIPGRXER:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NETWORKCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t MDIOIN:1;
      uint64_t MANDONE:1;
      uint64_t reservedSpace1:3;
      uint64_t PFCNEGOTIATE:1;
      uint64_t LPIINDICATE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NETWORKSTATUS;

