iSYSTEMLabs/winIDEAExampleWorkspaces/SiliconLabs/EFM32GG11/targetInit/efm32gg11_sfr.h
  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AMBABRSTLEN:5;
      uint64_t HDRDATASPLITEN:1;
      uint64_t reservedSpace0:2;
      uint64_t RXPBUFSIZE:2;
      uint64_t TXPBUFSIZE:1;
      uint64_t TXPBUFTCPEN:1;
      uint64_t INFLASTDBUFSIZEEN:1;
      uint64_t reservedSpace1:3;
      uint64_t RXBUFSIZE:8;
      uint64_t FRCDISCARDONERR:1;
      uint64_t FRCMAXAMBABRSTRX:1;
      uint64_t FRCMAXAMBABRSTTX:1;
      uint64_t reservedSpace2:1;
      uint64_t RXBDEXTNDMODEEN:1;
      uint64_t TXBDEXTENDMODEEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMACFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USEDBITREAD:1;
      uint64_t COLOCCRD:1;
      uint64_t RETRYLMTEXCD:1;
      uint64_t TXGO:1;
      uint64_t AMBAERR:1;
      uint64_t TXCMPLT:1;
      uint64_t TXUNDERRUN:1;
      uint64_t LATECOLOCCRD:1;
      uint64_t RESPNOTOK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXSTATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t DMARXQPTR:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXQPTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t DMATXQPTR:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXQPTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BUFFNOTAVAIL:1;
      uint64_t FRMRX:1;
      uint64_t RXOVERRUN:1;
      uint64_t RESPNOTOK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXSTATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MNGMNTDONE:1;
      uint64_t RXCMPLT:1;
      uint64_t RXUSEDBITREAD:1;
      uint64_t TXUSEDBITREAD:1;
      uint64_t TXUNDERRUN:1;
      uint64_t RTRYLMTORLATECOL:1;
      uint64_t AMBAERR:1;
      uint64_t TXCMPLT:1;
      uint64_t reservedSpace0:2;
      uint64_t RXOVERRUN:1;
      uint64_t RESPNOTOK:1;
      uint64_t NONZEROPFRMQUANT:1;
      uint64_t PAUSETIMEZERO:1;
      uint64_t PFRMTX:1;
      uint64_t reservedSpace1:3;
      uint64_t PTPDLYREQFRMRX:1;
      uint64_t PTPSYNCFRMRX:1;
      uint64_t PTPDLYREQFRMTX:1;
      uint64_t PTPSYNCFRMTX:1;
      uint64_t PTPPDLYREQFRMRX:1;
      uint64_t PTPPDLYRESPFRMRX:1;
      uint64_t PTPPDLYREQFRMTX:1;
      uint64_t PTPPDLYRESPFRMTX:1;
      uint64_t TSUSECREGINCR:1;
      uint64_t RXLPIINDC:1;
      uint64_t WOLEVNTRX:1;
      uint64_t TSUTIMERCOMP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MNGMNTDONE:1;
      uint64_t RXCMPLT:1;
      uint64_t RXUSEDBITREAD:1;
      uint64_t TXUSEDBITREAD:1;
      uint64_t TXUNDERRUN:1;
      uint64_t RTRYLMTORLATECOL:1;
      uint64_t AMBAERR:1;
      uint64_t TXCMPLT:1;
      uint64_t reservedSpace0:2;
      uint64_t RXOVERRUN:1;
      uint64_t RESPNOTOK:1;
      uint64_t NONZEROPFRMQUANT:1;
      uint64_t PAUSETIMEZERO:1;
      uint64_t PFRMTX:1;
      uint64_t reservedSpace1:3;
      uint64_t PTPDLYREQFRMRX:1;
      uint64_t PTPSYNCFRMRX:1;
      uint64_t PTPDLYREQFRMTX:1;
      uint64_t PTPSYNCFRMTX:1;
      uint64_t PTPPDLYREQFRMRX:1;
      uint64_t PTPPDLYRESPFRMRX:1;
      uint64_t PTPPDLYREQFRMTX:1;
      uint64_t PTPPDLYRESPFRMTX:1;
      uint64_t TSUSECREGINCR:1;
      uint64_t RXLPIINDC:1;
      uint64_t WOLEVNTRX:1;
      uint64_t TSUTIMERCOMP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IENS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MNGMNTDONE:1;
      uint64_t RXCMPLT:1;
      uint64_t RXUSEDBITREAD:1;
      uint64_t TXUSEDBITREAD:1;
      uint64_t TXUNDERRUN:1;
      uint64_t RTRYLMTORLATECOL:1;
      uint64_t AMBAERR:1;
      uint64_t TXCMPLT:1;
      uint64_t reservedSpace0:2;
      uint64_t RXOVERRUN:1;
      uint64_t RESPNOTOK:1;
      uint64_t NONZEROPFRMQUANT:1;
      uint64_t PAUSETIMEZERO:1;
      uint64_t PFRMTX:1;
      uint64_t reservedSpace1:3;
      uint64_t PTPDLYREQFRMRX:1;
      uint64_t PTPSYNCFRMRX:1;
      uint64_t PTPDLYREQFRMTX:1;
      uint64_t PTPSYNCFRMTX:1;
      uint64_t PTPPDLYREQFRMRX:1;
      uint64_t PTPPDLYRESPFRMRX:1;
      uint64_t PTPPDLYREQFRMTX:1;
      uint64_t PTPPDLYRESPFRMTX:1;
      uint64_t TSUSECREGINCR:1;
      uint64_t RXLPIINDC:1;
      uint64_t WOLEVNTRX:1;
      uint64_t TSUTIMERCOMP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IENC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MNGMNTDONE:1;
      uint64_t RXCMPLT:1;
      uint64_t RXUSEDBITREAD:1;
      uint64_t TXUSEDBITREAD:1;
      uint64_t TXUNDERRUN:1;
      uint64_t RTRYLMTORLATECOL:1;
      uint64_t AMBAERR:1;
      uint64_t TXCMPLT:1;
      uint64_t UNUSED:1;
      uint64_t reservedSpace0:1;
      uint64_t RXOVERRUN:1;
      uint64_t RESPNOTOK:1;
      uint64_t NONZEROPFRMQUANT:1;
      uint64_t PAUSETIMEZERO:1;
      uint64_t PFRMTX:1;
      uint64_t reservedSpace1:3;
      uint64_t PTPDLYREQFRMRX:1;
      uint64_t PTPSYNCFRMRX:1;
      uint64_t PTPDLYREQFRMTX:1;
      uint64_t PTPSYNCFRMTX:1;
      uint64_t PTPPDLYREQFRMRX:1;
      uint64_t PTPPDLYRESPFRMRX:1;
      uint64_t PTPPDLYREQFRMTX:1;
      uint64_t PTPPDLYRESPFRMTX:1;
      uint64_t TSUSECREGINCR:1;
      uint64_t RXLPIINDC:1;
      uint64_t WOLEVNTRX:1;
      uint64_t TSUTIMERCOMP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IENRO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PHYRWDATA:16;
      uint64_t WRITE10:2;
      uint64_t REGADDR:5;
      uint64_t PHYADDR:5;
      uint64_t OPERATION:2;
      uint64_t WRITE1:1;
      uint64_t WRITE0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PHYMNGMNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QUANT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXPAUSEQUANT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QUANT:16;
      uint64_t QUANTP1:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXPAUSEQUANT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMATXCUTTHRUTHR:10;
      uint64_t reservedSpace0:21;
      uint64_t DMATXCUTTHRU:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PBUFTXCUTTHRU;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMARXCUTTHRUTHR:10;
      uint64_t reservedSpace0:21;
      uint64_t DMARXCUTTHRU:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PBUFRXCUTTHRU;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t JUMBOMAXLEN:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) JUMBOMAXLEN;

  uint8_t res1[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXINTMOD:8;
      uint64_t reservedSpace0:8;
      uint64_t TXINTMOD:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMOD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSWAKETIME:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSWAKETIME;

