iSYSTEMLabs/winIDEAExampleWorkspaces/SiliconLabs/EFM32GG11/targetInit/efm32gg11_sfr.h
  uint8_t res2[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HASHBOTTOM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HASHTOP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPECADDR1BOTTOM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:16;
      uint64_t FILTERTYPE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPECADDR1TOP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPECADDR2BOTTOM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:16;
      uint64_t FILTERTYPE:1;
      uint64_t reservedSpace0:7;
      uint64_t FILTERBYTEMASK:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPECADDR2TOP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPECADDR3BOTTOM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:16;
      uint64_t FILTERTYPE:1;
      uint64_t reservedSpace0:7;
      uint64_t FILTERBYTEMASK:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPECADDR3TOP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPECADDR4BOTTOM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:16;
      uint64_t FILTERTYPE:1;
      uint64_t reservedSpace0:7;
      uint64_t FILTERBYTEMASK:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPECADDR4TOP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCH:16;
      uint64_t reservedSpace0:15;
      uint64_t ENBCOPY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPECTYPE1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCH:16;
      uint64_t reservedSpace0:15;
      uint64_t ENBCOPY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPECTYPE2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCH:16;
      uint64_t reservedSpace0:15;
      uint64_t ENBCOPY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPECTYPE3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCH:16;
      uint64_t reservedSpace0:15;
      uint64_t ENBCOPY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPECTYPE4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:16;
      uint64_t WOLMASK0:1;
      uint64_t WOLMASK1:1;
      uint64_t WOLMASK2:1;
      uint64_t WOLMASK3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WOLREG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IPGSTRETCH:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STRETCHRATIO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCH:16;
      uint64_t reservedSpace0:15;
      uint64_t ENBPROCESSING:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STACKEDVLAN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VECTORENB:8;
      uint64_t VECTOR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXPFCPAUSE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDRMASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MASKADD1BOTTOM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDRMASK:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MASKADD1TOP;

  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXPTPUNICAST;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXPTPUNICAST;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMPVAL:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TSUNSECCMP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMPVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TSUSECCMP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMPVAL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TSUMSBSECCMP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMERSEC:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TSUPTPTXMSBSEC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMERSEC:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TSUPTPRXMSBSEC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMERSEC:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TSUPEERTXMSBSEC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMERSEC:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TSUPEERRXMSBSEC;

  uint8_t res4[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OCTETSTXEDBOTTOM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OCTETSTXEDTOP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRAMESTXEDOK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BROADCASTTXED;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MULTICASTTXED;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFRAMESTXED;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRAMESTXED64;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRAMESTXED65;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRAMESTXED128;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRAMESTXED256;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRAMESTXED512;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRAMESTXED1024;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRAMESTXED1519;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXUNDERRUNS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:18;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SINGLECOLS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:18;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MULTICOLS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EXCESSCOLS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LATECOLS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:18;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEFERREDFRAMES;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRSERRS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OCTETSRXEDBOTTOM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OCTETSRXEDTOP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRAMESRXEDOK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BROADCASTRXED;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MULTICASTRXED;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFRAMESRXED;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRAMESRXED64;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRAMESRXED65;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRAMESRXED128;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRAMESRXED256;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRAMESRXED512;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRAMESRXED1024;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRAMESRXED1519;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UNDERSIZEFRAMES;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EXCESSIVERXLEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXJABBERS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FCSERRS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXLENERRS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXSYMBOLERRS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALIGNERRS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:18;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXRESOURCEERRS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXOVERRUNS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXIPCKERRS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXTCPCKERRS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXUDPCKERRS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AUTOFLUSHEDPKTS;

