iSYSTEMLabs/winIDEAExampleWorkspaces/SiliconLabs/EFM32GG11/targetInit/efm32gg11_sfr.h
};

#define SDIO (*(volatile struct SDIO_tag *) 0x400f1000)

struct GPIO_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DRIVESTRENGTH:1;
      uint64_t reservedSpace0:3;
      uint64_t SLEWRATE:3;
      uint64_t reservedSpace1:5;
      uint64_t DINDIS:1;
      uint64_t reservedSpace2:3;
      uint64_t DRIVESTRENGTHALT:1;
      uint64_t reservedSpace3:3;
      uint64_t SLEWRATEALT:3;
      uint64_t reservedSpace4:5;
      uint64_t DINDISALT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PA_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE0:4;
      uint64_t MODE1:4;
      uint64_t MODE2:4;
      uint64_t MODE3:4;
      uint64_t MODE4:4;
      uint64_t MODE5:4;
      uint64_t MODE6:4;
      uint64_t MODE7:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PA_MODEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE8:4;
      uint64_t MODE9:4;
      uint64_t MODE10:4;
      uint64_t MODE11:4;
      uint64_t MODE12:4;
      uint64_t MODE13:4;
      uint64_t MODE14:4;
      uint64_t MODE15:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PA_MODEH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DOUT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PA_DOUT;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DOUTTGL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PA_DOUTTGL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PA_DIN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PINLOCKN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PA_PINLOCKN;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OVTDIS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PA_OVTDIS;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DRIVESTRENGTH:1;
      uint64_t reservedSpace0:3;
      uint64_t SLEWRATE:3;
      uint64_t reservedSpace1:5;
      uint64_t DINDIS:1;
      uint64_t reservedSpace2:3;
      uint64_t DRIVESTRENGTHALT:1;
      uint64_t reservedSpace3:3;
      uint64_t SLEWRATEALT:3;
      uint64_t reservedSpace4:5;
      uint64_t DINDISALT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PB_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE0:4;
      uint64_t MODE1:4;
      uint64_t MODE2:4;
      uint64_t MODE3:4;
      uint64_t MODE4:4;
      uint64_t MODE5:4;
      uint64_t MODE6:4;
      uint64_t MODE7:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PB_MODEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE8:4;
      uint64_t MODE9:4;
      uint64_t MODE10:4;
      uint64_t MODE11:4;
      uint64_t MODE12:4;
      uint64_t MODE13:4;
      uint64_t MODE14:4;
      uint64_t MODE15:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PB_MODEH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DOUT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PB_DOUT;

  uint8_t res3[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DOUTTGL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PB_DOUTTGL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PB_DIN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PINLOCKN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PB_PINLOCKN;

  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OVTDIS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PB_OVTDIS;

  uint8_t res5[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DRIVESTRENGTH:1;
      uint64_t reservedSpace0:3;
      uint64_t SLEWRATE:3;
      uint64_t reservedSpace1:5;
      uint64_t DINDIS:1;
      uint64_t reservedSpace2:3;
      uint64_t DRIVESTRENGTHALT:1;
      uint64_t reservedSpace3:3;
      uint64_t SLEWRATEALT:3;
      uint64_t reservedSpace4:5;
      uint64_t DINDISALT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PC_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE0:4;
      uint64_t MODE1:4;
      uint64_t MODE2:4;
      uint64_t MODE3:4;
      uint64_t MODE4:4;
      uint64_t MODE5:4;
      uint64_t MODE6:4;
      uint64_t MODE7:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PC_MODEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE8:4;
      uint64_t MODE9:4;
      uint64_t MODE10:4;
      uint64_t MODE11:4;
      uint64_t MODE12:4;
      uint64_t MODE13:4;
      uint64_t MODE14:4;
      uint64_t MODE15:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PC_MODEH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DOUT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PC_DOUT;

  uint8_t res6[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DOUTTGL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PC_DOUTTGL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PC_DIN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PINLOCKN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PC_PINLOCKN;

  uint8_t res7[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OVTDIS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PC_OVTDIS;

  uint8_t res8[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DRIVESTRENGTH:1;
      uint64_t reservedSpace0:3;
      uint64_t SLEWRATE:3;
      uint64_t reservedSpace1:5;
      uint64_t DINDIS:1;
      uint64_t reservedSpace2:3;
      uint64_t DRIVESTRENGTHALT:1;
      uint64_t reservedSpace3:3;
      uint64_t SLEWRATEALT:3;
      uint64_t reservedSpace4:5;
      uint64_t DINDISALT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PD_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE0:4;
      uint64_t MODE1:4;
      uint64_t MODE2:4;
      uint64_t MODE3:4;
      uint64_t MODE4:4;
      uint64_t MODE5:4;
      uint64_t MODE6:4;
      uint64_t MODE7:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PD_MODEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE8:4;
      uint64_t MODE9:4;
      uint64_t MODE10:4;
      uint64_t MODE11:4;
      uint64_t MODE12:4;
      uint64_t MODE13:4;
      uint64_t MODE14:4;
      uint64_t MODE15:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PD_MODEH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DOUT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PD_DOUT;

  uint8_t res9[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DOUTTGL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PD_DOUTTGL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PD_DIN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PINLOCKN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PD_PINLOCKN;

  uint8_t res10[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OVTDIS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PD_OVTDIS;

  uint8_t res11[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DRIVESTRENGTH:1;
      uint64_t reservedSpace0:3;
      uint64_t SLEWRATE:3;
      uint64_t reservedSpace1:5;
      uint64_t DINDIS:1;
      uint64_t reservedSpace2:3;
      uint64_t DRIVESTRENGTHALT:1;
      uint64_t reservedSpace3:3;
      uint64_t SLEWRATEALT:3;
      uint64_t reservedSpace4:5;
      uint64_t DINDISALT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PE_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE0:4;
      uint64_t MODE1:4;
      uint64_t MODE2:4;
      uint64_t MODE3:4;
      uint64_t MODE4:4;
      uint64_t MODE5:4;
      uint64_t MODE6:4;
      uint64_t MODE7:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PE_MODEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE8:4;
      uint64_t MODE9:4;
      uint64_t MODE10:4;
      uint64_t MODE11:4;
      uint64_t MODE12:4;
      uint64_t MODE13:4;
      uint64_t MODE14:4;
      uint64_t MODE15:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PE_MODEH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DOUT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PE_DOUT;

  uint8_t res12[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DOUTTGL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PE_DOUTTGL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PE_DIN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PINLOCKN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PE_PINLOCKN;

  uint8_t res13[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OVTDIS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PE_OVTDIS;

  uint8_t res14[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DRIVESTRENGTH:1;
      uint64_t reservedSpace0:3;
      uint64_t SLEWRATE:3;
      uint64_t reservedSpace1:5;
      uint64_t DINDIS:1;
      uint64_t reservedSpace2:3;
      uint64_t DRIVESTRENGTHALT:1;
      uint64_t reservedSpace3:3;
      uint64_t SLEWRATEALT:3;
      uint64_t reservedSpace4:5;
      uint64_t DINDISALT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PF_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE0:4;
      uint64_t MODE1:4;
      uint64_t MODE2:4;
      uint64_t MODE3:4;
      uint64_t MODE4:4;
      uint64_t MODE5:4;
      uint64_t MODE6:4;
      uint64_t MODE7:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PF_MODEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE8:4;
      uint64_t MODE9:4;
      uint64_t MODE10:4;
      uint64_t MODE11:4;
      uint64_t MODE12:4;
      uint64_t MODE13:4;
      uint64_t MODE14:4;
      uint64_t MODE15:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PF_MODEH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DOUT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PF_DOUT;

  uint8_t res15[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DOUTTGL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PF_DOUTTGL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PF_DIN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PINLOCKN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PF_PINLOCKN;

  uint8_t res16[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OVTDIS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PF_OVTDIS;

  uint8_t res17[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DRIVESTRENGTH:1;
      uint64_t reservedSpace0:3;
      uint64_t SLEWRATE:3;
      uint64_t reservedSpace1:5;
      uint64_t DINDIS:1;
      uint64_t reservedSpace2:3;
      uint64_t DRIVESTRENGTHALT:1;
      uint64_t reservedSpace3:3;
      uint64_t SLEWRATEALT:3;
      uint64_t reservedSpace4:5;
      uint64_t DINDISALT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PG_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE0:4;
      uint64_t MODE1:4;
      uint64_t MODE2:4;
      uint64_t MODE3:4;
      uint64_t MODE4:4;
      uint64_t MODE5:4;
      uint64_t MODE6:4;
      uint64_t MODE7:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PG_MODEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE8:4;
      uint64_t MODE9:4;
      uint64_t MODE10:4;
      uint64_t MODE11:4;
      uint64_t MODE12:4;
      uint64_t MODE13:4;
      uint64_t MODE14:4;
      uint64_t MODE15:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PG_MODEH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DOUT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PG_DOUT;

  uint8_t res18[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DOUTTGL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PG_DOUTTGL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PG_DIN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PINLOCKN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PG_PINLOCKN;

  uint8_t res19[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OVTDIS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PG_OVTDIS;

  uint8_t res20[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DRIVESTRENGTH:1;
      uint64_t reservedSpace0:3;
      uint64_t SLEWRATE:3;
      uint64_t reservedSpace1:5;
      uint64_t DINDIS:1;
      uint64_t reservedSpace2:3;
      uint64_t DRIVESTRENGTHALT:1;
      uint64_t reservedSpace3:3;
      uint64_t SLEWRATEALT:3;
      uint64_t reservedSpace4:5;
      uint64_t DINDISALT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PH_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE0:4;
      uint64_t MODE1:4;
      uint64_t MODE2:4;
      uint64_t MODE3:4;
      uint64_t MODE4:4;
      uint64_t MODE5:4;
      uint64_t MODE6:4;
      uint64_t MODE7:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PH_MODEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE8:4;
      uint64_t MODE9:4;
      uint64_t MODE10:4;
      uint64_t MODE11:4;
      uint64_t MODE12:4;
      uint64_t MODE13:4;
      uint64_t MODE14:4;
      uint64_t MODE15:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PH_MODEH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DOUT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PH_DOUT;

  uint8_t res21[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DOUTTGL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PH_DOUTTGL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PH_DIN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PINLOCKN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PH_PINLOCKN;

  uint8_t res22[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OVTDIS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PH_OVTDIS;

  uint8_t res23[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DRIVESTRENGTH:1;
      uint64_t reservedSpace0:3;
      uint64_t SLEWRATE:3;
      uint64_t reservedSpace1:5;
      uint64_t DINDIS:1;
      uint64_t reservedSpace2:3;
      uint64_t DRIVESTRENGTHALT:1;
      uint64_t reservedSpace3:3;
      uint64_t SLEWRATEALT:3;
      uint64_t reservedSpace4:5;
      uint64_t DINDISALT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PI_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE0:4;
      uint64_t MODE1:4;
      uint64_t MODE2:4;
      uint64_t MODE3:4;
      uint64_t MODE4:4;
      uint64_t MODE5:4;
      uint64_t MODE6:4;
      uint64_t MODE7:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PI_MODEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE8:4;
      uint64_t MODE9:4;
      uint64_t MODE10:4;
      uint64_t MODE11:4;
      uint64_t MODE12:4;
      uint64_t MODE13:4;
      uint64_t MODE14:4;
      uint64_t MODE15:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PI_MODEH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DOUT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PI_DOUT;

  uint8_t res24[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DOUTTGL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PI_DOUTTGL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PI_DIN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PINLOCKN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PI_PINLOCKN;

  uint8_t res25[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OVTDIS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PI_OVTDIS;

  uint8_t res26[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DRIVESTRENGTH:1;
      uint64_t reservedSpace0:3;
      uint64_t SLEWRATE:3;
      uint64_t reservedSpace1:5;
      uint64_t DINDIS:1;
      uint64_t reservedSpace2:3;
      uint64_t DRIVESTRENGTHALT:1;
      uint64_t reservedSpace3:3;
      uint64_t SLEWRATEALT:3;
      uint64_t reservedSpace4:5;
      uint64_t DINDISALT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PJ_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE0:4;
      uint64_t MODE1:4;
      uint64_t MODE2:4;
      uint64_t MODE3:4;
      uint64_t MODE4:4;
      uint64_t MODE5:4;
      uint64_t MODE6:4;
      uint64_t MODE7:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PJ_MODEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE8:4;
      uint64_t MODE9:4;
      uint64_t MODE10:4;
      uint64_t MODE11:4;
      uint64_t MODE12:4;
      uint64_t MODE13:4;
      uint64_t MODE14:4;
      uint64_t MODE15:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PJ_MODEH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DOUT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PJ_DOUT;

  uint8_t res27[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DOUTTGL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PJ_DOUTTGL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PJ_DIN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PINLOCKN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PJ_PINLOCKN;

