iSYSTEMLabs/winIDEAExampleWorkspaces/SiliconLabs/EFM32GG11/targetInit/efm32gg11_sfr.h
  uint8_t res28[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OVTDIS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PJ_OVTDIS;

  uint8_t res29[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DRIVESTRENGTH:1;
      uint64_t reservedSpace0:3;
      uint64_t SLEWRATE:3;
      uint64_t reservedSpace1:5;
      uint64_t DINDIS:1;
      uint64_t reservedSpace2:3;
      uint64_t DRIVESTRENGTHALT:1;
      uint64_t reservedSpace3:3;
      uint64_t SLEWRATEALT:3;
      uint64_t reservedSpace4:5;
      uint64_t DINDISALT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PK_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE0:4;
      uint64_t MODE1:4;
      uint64_t MODE2:4;
      uint64_t MODE3:4;
      uint64_t MODE4:4;
      uint64_t MODE5:4;
      uint64_t MODE6:4;
      uint64_t MODE7:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PK_MODEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE8:4;
      uint64_t MODE9:4;
      uint64_t MODE10:4;
      uint64_t MODE11:4;
      uint64_t MODE12:4;
      uint64_t MODE13:4;
      uint64_t MODE14:4;
      uint64_t MODE15:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PK_MODEH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DOUT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PK_DOUT;

  uint8_t res30[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DOUTTGL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PK_DOUTTGL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PK_DIN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PINLOCKN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PK_PINLOCKN;

  uint8_t res31[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OVTDIS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PK_OVTDIS;

  uint8_t res32[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DRIVESTRENGTH:1;
      uint64_t reservedSpace0:3;
      uint64_t SLEWRATE:3;
      uint64_t reservedSpace1:5;
      uint64_t DINDIS:1;
      uint64_t reservedSpace2:3;
      uint64_t DRIVESTRENGTHALT:1;
      uint64_t reservedSpace3:3;
      uint64_t SLEWRATEALT:3;
      uint64_t reservedSpace4:5;
      uint64_t DINDISALT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PL_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE0:4;
      uint64_t MODE1:4;
      uint64_t MODE2:4;
      uint64_t MODE3:4;
      uint64_t MODE4:4;
      uint64_t MODE5:4;
      uint64_t MODE6:4;
      uint64_t MODE7:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PL_MODEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE8:4;
      uint64_t MODE9:4;
      uint64_t MODE10:4;
      uint64_t MODE11:4;
      uint64_t MODE12:4;
      uint64_t MODE13:4;
      uint64_t MODE14:4;
      uint64_t MODE15:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PL_MODEH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DOUT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PL_DOUT;

  uint8_t res33[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DOUTTGL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PL_DOUTTGL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PL_DIN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PINLOCKN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PL_PINLOCKN;

  uint8_t res34[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OVTDIS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PL_OVTDIS;

  uint8_t res35[452];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTIPSEL0:4;
      uint64_t EXTIPSEL1:4;
      uint64_t EXTIPSEL2:4;
      uint64_t EXTIPSEL3:4;
      uint64_t EXTIPSEL4:4;
      uint64_t EXTIPSEL5:4;
      uint64_t EXTIPSEL6:4;
      uint64_t EXTIPSEL7:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EXTIPSELL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTIPSEL8:4;
      uint64_t EXTIPSEL9:4;
      uint64_t EXTIPSEL10:4;
      uint64_t EXTIPSEL11:4;
      uint64_t EXTIPSEL12:4;
      uint64_t EXTIPSEL13:4;
      uint64_t EXTIPSEL14:4;
      uint64_t EXTIPSEL15:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EXTIPSELH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTIPINSEL0:2;
      uint64_t reservedSpace0:2;
      uint64_t EXTIPINSEL1:2;
      uint64_t reservedSpace1:2;
      uint64_t EXTIPINSEL2:2;
      uint64_t reservedSpace2:2;
      uint64_t EXTIPINSEL3:2;
      uint64_t reservedSpace3:2;
      uint64_t EXTIPINSEL4:2;
      uint64_t reservedSpace4:2;
      uint64_t EXTIPINSEL5:2;
      uint64_t reservedSpace5:2;
      uint64_t EXTIPINSEL6:2;
      uint64_t reservedSpace6:2;
      uint64_t EXTIPINSEL7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EXTIPINSELL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTIPINSEL8:2;
      uint64_t reservedSpace0:2;
      uint64_t EXTIPINSEL9:2;
      uint64_t reservedSpace1:2;
      uint64_t EXTIPINSEL10:2;
      uint64_t reservedSpace2:2;
      uint64_t EXTIPINSEL11:2;
      uint64_t reservedSpace3:2;
      uint64_t EXTIPINSEL12:2;
      uint64_t reservedSpace4:2;
      uint64_t EXTIPINSEL13:2;
      uint64_t reservedSpace5:2;
      uint64_t EXTIPINSEL14:2;
      uint64_t reservedSpace6:2;
      uint64_t EXTIPINSEL15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EXTIPINSELH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTIRISE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EXTIRISE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTIFALL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EXTIFALL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t EM4WU0:1;
      uint64_t EM4WU1:1;
      uint64_t EM4WU2:1;
      uint64_t EM4WU3:1;
      uint64_t EM4WU4:1;
      uint64_t EM4WU5:1;
      uint64_t EM4WU6:1;
      uint64_t EM4WU7:1;
      uint64_t EM4WU8:1;
      uint64_t EM4WU9:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EXTILEVEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXT:16;
      uint64_t EM4WU:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXT:16;
      uint64_t EM4WU:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXT:16;
      uint64_t EM4WU:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXT:16;
      uint64_t EM4WU:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t EM4WUEN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EM4WUEN;

  uint8_t res36[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWCLKTCKPEN:1;
      uint64_t SWDIOTMSPEN:1;
      uint64_t TDOPEN:1;
      uint64_t TDIPEN:1;
      uint64_t SWVPEN:1;
      uint64_t reservedSpace0:11;
      uint64_t ETMTCLKPEN:1;
      uint64_t ETMTD0PEN:1;
      uint64_t ETMTD1PEN:1;
      uint64_t ETMTD2PEN:1;
      uint64_t ETMTD3PEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ROUTEPEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWVLOC:6;
      uint64_t ETMLOC:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ROUTELOC0;

