iSYSTEMLabs/winIDEAExampleWorkspaces/SiliconLabs/EFM32GG11/targetInit/efm32gg11_sfr.h
  uint8_t res12[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIGSEL:4;
      uint64_t reservedSpace0:12;
      uint64_t SOURCESEL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH10_REQSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t ARBSLOTS:2;
      uint64_t reservedSpace1:2;
      uint64_t SRCINCSIGN:1;
      uint64_t DSTINCSIGN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH10_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOOPCNT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH10_LOOP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STRUCTTYPE:2;
      uint64_t reservedSpace0:1;
      uint64_t STRUCTREQ:1;
      uint64_t XFERCNT:11;
      uint64_t BYTESWAP:1;
      uint64_t BLOCKSIZE:4;
      uint64_t DONEIFSEN:1;
      uint64_t REQMODE:1;
      uint64_t DECLOOPCNT:1;
      uint64_t IGNORESREQ:1;
      uint64_t SRCINC:2;
      uint64_t SIZE:2;
      uint64_t DSTINC:2;
      uint64_t SRCMODE:1;
      uint64_t DSTMODE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH10_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRCADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH10_SRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DSTADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH10_DST;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LINKMODE:1;
      uint64_t LINK:1;
      uint64_t LINKADDR:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH10_LINK;

  uint8_t res13[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIGSEL:4;
      uint64_t reservedSpace0:12;
      uint64_t SOURCESEL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH11_REQSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t ARBSLOTS:2;
      uint64_t reservedSpace1:2;
      uint64_t SRCINCSIGN:1;
      uint64_t DSTINCSIGN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH11_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOOPCNT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH11_LOOP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STRUCTTYPE:2;
      uint64_t reservedSpace0:1;
      uint64_t STRUCTREQ:1;
      uint64_t XFERCNT:11;
      uint64_t BYTESWAP:1;
      uint64_t BLOCKSIZE:4;
      uint64_t DONEIFSEN:1;
      uint64_t REQMODE:1;
      uint64_t DECLOOPCNT:1;
      uint64_t IGNORESREQ:1;
      uint64_t SRCINC:2;
      uint64_t SIZE:2;
      uint64_t DSTINC:2;
      uint64_t SRCMODE:1;
      uint64_t DSTMODE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH11_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRCADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH11_SRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DSTADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH11_DST;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LINKMODE:1;
      uint64_t LINK:1;
      uint64_t LINKADDR:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH11_LINK;

  uint8_t res14[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIGSEL:4;
      uint64_t reservedSpace0:12;
      uint64_t SOURCESEL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH12_REQSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t ARBSLOTS:2;
      uint64_t reservedSpace1:2;
      uint64_t SRCINCSIGN:1;
      uint64_t DSTINCSIGN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH12_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOOPCNT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH12_LOOP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STRUCTTYPE:2;
      uint64_t reservedSpace0:1;
      uint64_t STRUCTREQ:1;
      uint64_t XFERCNT:11;
      uint64_t BYTESWAP:1;
      uint64_t BLOCKSIZE:4;
      uint64_t DONEIFSEN:1;
      uint64_t REQMODE:1;
      uint64_t DECLOOPCNT:1;
      uint64_t IGNORESREQ:1;
      uint64_t SRCINC:2;
      uint64_t SIZE:2;
      uint64_t DSTINC:2;
      uint64_t SRCMODE:1;
      uint64_t DSTMODE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH12_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRCADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH12_SRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DSTADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH12_DST;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LINKMODE:1;
      uint64_t LINK:1;
      uint64_t LINKADDR:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH12_LINK;

  uint8_t res15[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIGSEL:4;
      uint64_t reservedSpace0:12;
      uint64_t SOURCESEL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH13_REQSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t ARBSLOTS:2;
      uint64_t reservedSpace1:2;
      uint64_t SRCINCSIGN:1;
      uint64_t DSTINCSIGN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH13_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOOPCNT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH13_LOOP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STRUCTTYPE:2;
      uint64_t reservedSpace0:1;
      uint64_t STRUCTREQ:1;
      uint64_t XFERCNT:11;
      uint64_t BYTESWAP:1;
      uint64_t BLOCKSIZE:4;
      uint64_t DONEIFSEN:1;
      uint64_t REQMODE:1;
      uint64_t DECLOOPCNT:1;
      uint64_t IGNORESREQ:1;
      uint64_t SRCINC:2;
      uint64_t SIZE:2;
      uint64_t DSTINC:2;
      uint64_t SRCMODE:1;
      uint64_t DSTMODE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH13_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRCADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH13_SRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DSTADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH13_DST;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LINKMODE:1;
      uint64_t LINK:1;
      uint64_t LINKADDR:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH13_LINK;

  uint8_t res16[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIGSEL:4;
      uint64_t reservedSpace0:12;
      uint64_t SOURCESEL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH14_REQSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t ARBSLOTS:2;
      uint64_t reservedSpace1:2;
      uint64_t SRCINCSIGN:1;
      uint64_t DSTINCSIGN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH14_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOOPCNT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH14_LOOP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STRUCTTYPE:2;
      uint64_t reservedSpace0:1;
      uint64_t STRUCTREQ:1;
      uint64_t XFERCNT:11;
      uint64_t BYTESWAP:1;
      uint64_t BLOCKSIZE:4;
      uint64_t DONEIFSEN:1;
      uint64_t REQMODE:1;
      uint64_t DECLOOPCNT:1;
      uint64_t IGNORESREQ:1;
      uint64_t SRCINC:2;
      uint64_t SIZE:2;
      uint64_t DSTINC:2;
      uint64_t SRCMODE:1;
      uint64_t DSTMODE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH14_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRCADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH14_SRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DSTADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH14_DST;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LINKMODE:1;
      uint64_t LINK:1;
      uint64_t LINKADDR:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH14_LINK;

  uint8_t res17[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIGSEL:4;
      uint64_t reservedSpace0:12;
      uint64_t SOURCESEL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH15_REQSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t ARBSLOTS:2;
      uint64_t reservedSpace1:2;
      uint64_t SRCINCSIGN:1;
      uint64_t DSTINCSIGN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH15_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOOPCNT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH15_LOOP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STRUCTTYPE:2;
      uint64_t reservedSpace0:1;
      uint64_t STRUCTREQ:1;
      uint64_t XFERCNT:11;
      uint64_t BYTESWAP:1;
      uint64_t BLOCKSIZE:4;
      uint64_t DONEIFSEN:1;
      uint64_t REQMODE:1;
      uint64_t DECLOOPCNT:1;
      uint64_t IGNORESREQ:1;
      uint64_t SRCINC:2;
      uint64_t SIZE:2;
      uint64_t DSTINC:2;
      uint64_t SRCMODE:1;
      uint64_t DSTMODE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH15_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRCADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH15_SRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DSTADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH15_DST;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LINKMODE:1;
      uint64_t LINK:1;
      uint64_t LINKADDR:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH15_LINK;

  uint8_t res18[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIGSEL:4;
      uint64_t reservedSpace0:12;
      uint64_t SOURCESEL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH16_REQSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t ARBSLOTS:2;
      uint64_t reservedSpace1:2;
      uint64_t SRCINCSIGN:1;
      uint64_t DSTINCSIGN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH16_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOOPCNT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH16_LOOP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STRUCTTYPE:2;
      uint64_t reservedSpace0:1;
      uint64_t STRUCTREQ:1;
      uint64_t XFERCNT:11;
      uint64_t BYTESWAP:1;
      uint64_t BLOCKSIZE:4;
      uint64_t DONEIFSEN:1;
      uint64_t REQMODE:1;
      uint64_t DECLOOPCNT:1;
      uint64_t IGNORESREQ:1;
      uint64_t SRCINC:2;
      uint64_t SIZE:2;
      uint64_t DSTINC:2;
      uint64_t SRCMODE:1;
      uint64_t DSTMODE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH16_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRCADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH16_SRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DSTADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH16_DST;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LINKMODE:1;
      uint64_t LINK:1;
      uint64_t LINKADDR:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH16_LINK;

  uint8_t res19[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIGSEL:4;
      uint64_t reservedSpace0:12;
      uint64_t SOURCESEL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH17_REQSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t ARBSLOTS:2;
      uint64_t reservedSpace1:2;
      uint64_t SRCINCSIGN:1;
      uint64_t DSTINCSIGN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH17_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOOPCNT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH17_LOOP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STRUCTTYPE:2;
      uint64_t reservedSpace0:1;
      uint64_t STRUCTREQ:1;
      uint64_t XFERCNT:11;
      uint64_t BYTESWAP:1;
      uint64_t BLOCKSIZE:4;
      uint64_t DONEIFSEN:1;
      uint64_t REQMODE:1;
      uint64_t DECLOOPCNT:1;
      uint64_t IGNORESREQ:1;
      uint64_t SRCINC:2;
      uint64_t SIZE:2;
      uint64_t DSTINC:2;
      uint64_t SRCMODE:1;
      uint64_t DSTMODE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH17_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRCADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH17_SRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DSTADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH17_DST;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LINKMODE:1;
      uint64_t LINK:1;
      uint64_t LINKADDR:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH17_LINK;

  uint8_t res20[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIGSEL:4;
      uint64_t reservedSpace0:12;
      uint64_t SOURCESEL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH18_REQSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t ARBSLOTS:2;
      uint64_t reservedSpace1:2;
      uint64_t SRCINCSIGN:1;
      uint64_t DSTINCSIGN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH18_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOOPCNT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH18_LOOP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STRUCTTYPE:2;
      uint64_t reservedSpace0:1;
      uint64_t STRUCTREQ:1;
      uint64_t XFERCNT:11;
      uint64_t BYTESWAP:1;
      uint64_t BLOCKSIZE:4;
      uint64_t DONEIFSEN:1;
      uint64_t REQMODE:1;
      uint64_t DECLOOPCNT:1;
      uint64_t IGNORESREQ:1;
      uint64_t SRCINC:2;
      uint64_t SIZE:2;
      uint64_t DSTINC:2;
      uint64_t SRCMODE:1;
      uint64_t DSTMODE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH18_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRCADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH18_SRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DSTADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH18_DST;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LINKMODE:1;
      uint64_t LINK:1;
      uint64_t LINKADDR:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH18_LINK;

  uint8_t res21[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIGSEL:4;
      uint64_t reservedSpace0:12;
      uint64_t SOURCESEL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH19_REQSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t ARBSLOTS:2;
      uint64_t reservedSpace1:2;
      uint64_t SRCINCSIGN:1;
      uint64_t DSTINCSIGN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH19_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOOPCNT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH19_LOOP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STRUCTTYPE:2;
      uint64_t reservedSpace0:1;
      uint64_t STRUCTREQ:1;
      uint64_t XFERCNT:11;
      uint64_t BYTESWAP:1;
      uint64_t BLOCKSIZE:4;
      uint64_t DONEIFSEN:1;
      uint64_t REQMODE:1;
      uint64_t DECLOOPCNT:1;
      uint64_t IGNORESREQ:1;
      uint64_t SRCINC:2;
      uint64_t SIZE:2;
      uint64_t DSTINC:2;
      uint64_t SRCMODE:1;
      uint64_t DSTMODE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH19_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRCADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH19_SRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DSTADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH19_DST;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LINKMODE:1;
      uint64_t LINK:1;
      uint64_t LINKADDR:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH19_LINK;

  uint8_t res22[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIGSEL:4;
      uint64_t reservedSpace0:12;
      uint64_t SOURCESEL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH20_REQSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t ARBSLOTS:2;
      uint64_t reservedSpace1:2;
      uint64_t SRCINCSIGN:1;
      uint64_t DSTINCSIGN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH20_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOOPCNT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH20_LOOP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STRUCTTYPE:2;
      uint64_t reservedSpace0:1;
      uint64_t STRUCTREQ:1;
      uint64_t XFERCNT:11;
      uint64_t BYTESWAP:1;
      uint64_t BLOCKSIZE:4;
      uint64_t DONEIFSEN:1;
      uint64_t REQMODE:1;
      uint64_t DECLOOPCNT:1;
      uint64_t IGNORESREQ:1;
      uint64_t SRCINC:2;
      uint64_t SIZE:2;
      uint64_t DSTINC:2;
      uint64_t SRCMODE:1;
      uint64_t DSTMODE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH20_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRCADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH20_SRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DSTADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH20_DST;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LINKMODE:1;
      uint64_t LINK:1;
      uint64_t LINKADDR:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH20_LINK;

