iSYSTEMLabs/winIDEAExampleWorkspaces/SiliconLabs/EFM32GG11/targetInit/efm32gg11_sfr.h
  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATAB:1;
      uint64_t DATAA:1;
      uint64_t TXRQSTNEWDAT:1;
      uint64_t CLRINTPND:1;
      uint64_t CONTROL:1;
      uint64_t ARBACC:1;
      uint64_t MASKACC:1;
      uint64_t WRRD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MIR1_CMDMASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASK:29;
      uint64_t reservedSpace0:1;
      uint64_t MDIR:1;
      uint64_t MXTD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MIR1_MASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID:29;
      uint64_t DIR:1;
      uint64_t XTD:1;
      uint64_t MSGVAL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MIR1_ARB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DLC:4;
      uint64_t reservedSpace0:3;
      uint64_t EOB:1;
      uint64_t TXRQST:1;
      uint64_t RMTEN:1;
      uint64_t RXIE:1;
      uint64_t TXIE:1;
      uint64_t UMASK:1;
      uint64_t INTPND:1;
      uint64_t MESSAGEOF:1;
      uint64_t DATAVALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MIR1_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA0:8;
      uint64_t DATA1:8;
      uint64_t DATA2:8;
      uint64_t DATA3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MIR1_DATAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA4:8;
      uint64_t DATA5:8;
      uint64_t DATA6:8;
      uint64_t DATA7:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MIR1_DATAH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSGNUM:6;
      uint64_t reservedSpace0:9;
      uint64_t BUSY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MIR1_CMDREQ;

};

#define CAN0 (*(volatile struct CAN0_tag *) 0x40004000)

struct CAN1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t INIT:1;
      uint64_t IE:1;
      uint64_t SIE:1;
      uint64_t EIE:1;
      uint64_t reservedSpace0:1;
      uint64_t DAR:1;
      uint64_t CCE:1;
      uint64_t TEST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LEC:3;
      uint64_t TXOK:1;
      uint64_t RXOK:1;
      uint64_t EPASS:1;
      uint64_t EWARN:1;
      uint64_t BOFF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEC:8;
      uint64_t REC:7;
      uint64_t RECERRP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERRCNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BRP:6;
      uint64_t SJW:2;
      uint64_t TSEG1:4;
      uint64_t TSEG2:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BITTIMING;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTID:6;
      uint64_t reservedSpace0:9;
      uint64_t INTSTAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t BASIC:1;
      uint64_t SILENT:1;
      uint64_t LBACK:1;
      uint64_t TX:2;
      uint64_t RX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TEST;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BRPE:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BRPE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXRQSTOUT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRANSREQ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MESSAGEDATA;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MESSAGESTATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:15;
      uint64_t DBGHALT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CONFIG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MESSAGE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IF0IF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MESSAGE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IF0IFS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MESSAGE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IF0IFC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MESSAGE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IF0IEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STATUS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IF1IF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STATUS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IF1IFS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STATUS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IF1IFC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STATUS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IF1IEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXPEN:1;
      uint64_t reservedSpace0:1;
      uint64_t RXLOC:6;
      uint64_t TXLOC:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ROUTE;

  uint8_t res1[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATAB:1;
      uint64_t DATAA:1;
      uint64_t TXRQSTNEWDAT:1;
      uint64_t CLRINTPND:1;
      uint64_t CONTROL:1;
      uint64_t ARBACC:1;
      uint64_t MASKACC:1;
      uint64_t WRRD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MIR0_CMDMASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASK:29;
      uint64_t reservedSpace0:1;
      uint64_t MDIR:1;
      uint64_t MXTD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MIR0_MASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID:29;
      uint64_t DIR:1;
      uint64_t XTD:1;
      uint64_t MSGVAL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MIR0_ARB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DLC:4;
      uint64_t reservedSpace0:3;
      uint64_t EOB:1;
      uint64_t TXRQST:1;
      uint64_t RMTEN:1;
      uint64_t RXIE:1;
      uint64_t TXIE:1;
      uint64_t UMASK:1;
      uint64_t INTPND:1;
      uint64_t MESSAGEOF:1;
      uint64_t DATAVALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MIR0_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA0:8;
      uint64_t DATA1:8;
      uint64_t DATA2:8;
      uint64_t DATA3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MIR0_DATAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA4:8;
      uint64_t DATA5:8;
      uint64_t DATA6:8;
      uint64_t DATA7:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MIR0_DATAH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSGNUM:6;
      uint64_t reservedSpace0:9;
      uint64_t BUSY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MIR0_CMDREQ;

