iSYSTEMLabs/winIDEAExampleWorkspaces/SiliconLabs/EFM32GG11/targetInit/efm32gg11_sfr.h
  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATAB:1;
      uint64_t DATAA:1;
      uint64_t TXRQSTNEWDAT:1;
      uint64_t CLRINTPND:1;
      uint64_t CONTROL:1;
      uint64_t ARBACC:1;
      uint64_t MASKACC:1;
      uint64_t WRRD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MIR1_CMDMASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASK:29;
      uint64_t reservedSpace0:1;
      uint64_t MDIR:1;
      uint64_t MXTD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MIR1_MASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID:29;
      uint64_t DIR:1;
      uint64_t XTD:1;
      uint64_t MSGVAL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MIR1_ARB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DLC:4;
      uint64_t reservedSpace0:3;
      uint64_t EOB:1;
      uint64_t TXRQST:1;
      uint64_t RMTEN:1;
      uint64_t RXIE:1;
      uint64_t TXIE:1;
      uint64_t UMASK:1;
      uint64_t INTPND:1;
      uint64_t MESSAGEOF:1;
      uint64_t DATAVALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MIR1_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA0:8;
      uint64_t DATA1:8;
      uint64_t DATA2:8;
      uint64_t DATA3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MIR1_DATAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA4:8;
      uint64_t DATA5:8;
      uint64_t DATA6:8;
      uint64_t DATA7:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MIR1_DATAH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSGNUM:6;
      uint64_t reservedSpace0:9;
      uint64_t BUSY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MIR1_CMDREQ;

};

#define CAN1 (*(volatile struct CAN1_tag *) 0x40004400)

struct TIMER0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t SYNC:1;
      uint64_t OSMEN:1;
      uint64_t QDM:1;
      uint64_t DEBUGRUN:1;
      uint64_t DMACLRACT:1;
      uint64_t RISEA:2;
      uint64_t FALLA:2;
      uint64_t reservedSpace1:1;
      uint64_t X2CNT:1;
      uint64_t DISSYNCOUT:1;
      uint64_t reservedSpace2:1;
      uint64_t CLKSEL:2;
      uint64_t reservedSpace3:6;
      uint64_t PRESC:4;
      uint64_t ATI:1;
      uint64_t RSSCOIST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t START:1;
      uint64_t STOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUNNING:1;
      uint64_t DIR:1;
      uint64_t TOPBV:1;
      uint64_t reservedSpace0:5;
      uint64_t CCVBV0:1;
      uint64_t CCVBV1:1;
      uint64_t CCVBV2:1;
      uint64_t CCVBV3:1;
      uint64_t reservedSpace1:4;
      uint64_t ICV0:1;
      uint64_t ICV1:1;
      uint64_t ICV2:1;
      uint64_t ICV3:1;
      uint64_t reservedSpace2:4;
      uint64_t CCPOL0:1;
      uint64_t CCPOL1:1;
      uint64_t CCPOL2:1;
      uint64_t CCPOL3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OF:1;
      uint64_t UF:1;
      uint64_t DIRCHG:1;
      uint64_t reservedSpace0:1;
      uint64_t CC0:1;
      uint64_t CC1:1;
      uint64_t CC2:1;
      uint64_t CC3:1;
      uint64_t ICBOF0:1;
      uint64_t ICBOF1:1;
      uint64_t ICBOF2:1;
      uint64_t ICBOF3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OF:1;
      uint64_t UF:1;
      uint64_t DIRCHG:1;
      uint64_t reservedSpace0:1;
      uint64_t CC0:1;
      uint64_t CC1:1;
      uint64_t CC2:1;
      uint64_t CC3:1;
      uint64_t ICBOF0:1;
      uint64_t ICBOF1:1;
      uint64_t ICBOF2:1;
      uint64_t ICBOF3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OF:1;
      uint64_t UF:1;
      uint64_t DIRCHG:1;
      uint64_t reservedSpace0:1;
      uint64_t CC0:1;
      uint64_t CC1:1;
      uint64_t CC2:1;
      uint64_t CC3:1;
      uint64_t ICBOF0:1;
      uint64_t ICBOF1:1;
      uint64_t ICBOF2:1;
      uint64_t ICBOF3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OF:1;
      uint64_t UF:1;
      uint64_t DIRCHG:1;
      uint64_t reservedSpace0:1;
      uint64_t CC0:1;
      uint64_t CC1:1;
      uint64_t CC2:1;
      uint64_t CC3:1;
      uint64_t ICBOF0:1;
      uint64_t ICBOF1:1;
      uint64_t ICBOF2:1;
      uint64_t ICBOF3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TOP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TOP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TOPB:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TOPB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CNT;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMERLOCKKEY:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LOCK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CC0PEN:1;
      uint64_t CC1PEN:1;
      uint64_t CC2PEN:1;
      uint64_t CC3PEN:1;
      uint64_t reservedSpace0:4;
      uint64_t CDTI0PEN:1;
      uint64_t CDTI1PEN:1;
      uint64_t CDTI2PEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ROUTEPEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CC0LOC:6;
      uint64_t reservedSpace0:2;
      uint64_t CC1LOC:6;
      uint64_t reservedSpace1:2;
      uint64_t CC2LOC:6;
      uint64_t reservedSpace2:2;
      uint64_t CC3LOC:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ROUTELOC0;

