iSYSTEMLabs/winIDEAExampleWorkspaces/SiliconLabs/EFM32GG11/targetInit/efm32gg11_sfr.h
  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDTI0LOC:6;
      uint64_t reservedSpace0:2;
      uint64_t CDTI1LOC:6;
      uint64_t reservedSpace1:2;
      uint64_t CDTI2LOC:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ROUTELOC2;

  uint8_t res2[32];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:2;
      uint64_t OUTINV:1;
      uint64_t reservedSpace0:1;
      uint64_t COIST:1;
      uint64_t reservedSpace1:3;
      uint64_t CMOA:2;
      uint64_t COFOA:2;
      uint64_t CUFOA:2;
      uint64_t reservedSpace2:2;
      uint64_t PRSSEL:5;
      uint64_t reservedSpace3:3;
      uint64_t ICEDGE:2;
      uint64_t ICEVCTRL:2;
      uint64_t PRSCONF:1;
      uint64_t INSEL:1;
      uint64_t FILT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CC0_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CCV:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CC0_CCV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CCVP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CC0_CCVP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CCVB:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CC0_CCVB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:2;
      uint64_t OUTINV:1;
      uint64_t reservedSpace0:1;
      uint64_t COIST:1;
      uint64_t reservedSpace1:3;
      uint64_t CMOA:2;
      uint64_t COFOA:2;
      uint64_t CUFOA:2;
      uint64_t reservedSpace2:2;
      uint64_t PRSSEL:5;
      uint64_t reservedSpace3:3;
      uint64_t ICEDGE:2;
      uint64_t ICEVCTRL:2;
      uint64_t PRSCONF:1;
      uint64_t INSEL:1;
      uint64_t FILT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CC1_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CCV:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CC1_CCV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CCVP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CC1_CCVP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CCVB:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CC1_CCVB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:2;
      uint64_t OUTINV:1;
      uint64_t reservedSpace0:1;
      uint64_t COIST:1;
      uint64_t reservedSpace1:3;
      uint64_t CMOA:2;
      uint64_t COFOA:2;
      uint64_t CUFOA:2;
      uint64_t reservedSpace2:2;
      uint64_t PRSSEL:5;
      uint64_t reservedSpace3:3;
      uint64_t ICEDGE:2;
      uint64_t ICEVCTRL:2;
      uint64_t PRSCONF:1;
      uint64_t INSEL:1;
      uint64_t FILT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CC2_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CCV:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CC2_CCV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CCVP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CC2_CCVP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CCVB:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CC2_CCVB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:2;
      uint64_t OUTINV:1;
      uint64_t reservedSpace0:1;
      uint64_t COIST:1;
      uint64_t reservedSpace1:3;
      uint64_t CMOA:2;
      uint64_t COFOA:2;
      uint64_t CUFOA:2;
      uint64_t reservedSpace2:2;
      uint64_t PRSSEL:5;
      uint64_t reservedSpace3:3;
      uint64_t ICEDGE:2;
      uint64_t ICEVCTRL:2;
      uint64_t PRSCONF:1;
      uint64_t INSEL:1;
      uint64_t FILT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CC3_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CCV:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CC3_CCV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CCVP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CC3_CCVP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CCVB:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CC3_CCVB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DTEN:1;
      uint64_t DTDAS:1;
      uint64_t DTIPOL:1;
      uint64_t DTCINV:1;
      uint64_t DTPRSSEL:5;
      uint64_t DTAR:1;
      uint64_t DTFATS:1;
      uint64_t reservedSpace0:13;
      uint64_t DTPRSEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DTCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DTPRESC:4;
      uint64_t reservedSpace0:4;
      uint64_t DTRISET:6;
      uint64_t reservedSpace1:2;
      uint64_t DTFALLT:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DTTIME;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DTPRS0FSEL:5;
      uint64_t reservedSpace0:3;
      uint64_t DTPRS1FSEL:5;
      uint64_t reservedSpace1:3;
      uint64_t DTFA:2;
      uint64_t reservedSpace2:6;
      uint64_t DTPRS0FEN:1;
      uint64_t DTPRS1FEN:1;
      uint64_t DTDBGFEN:1;
      uint64_t DTLOCKUPFEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DTFC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DTOGCC0EN:1;
      uint64_t DTOGCC1EN:1;
      uint64_t DTOGCC2EN:1;
      uint64_t DTOGCDTI0EN:1;
      uint64_t DTOGCDTI1EN:1;
      uint64_t DTOGCDTI2EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DTOGEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DTPRS0F:1;
      uint64_t DTPRS1F:1;
      uint64_t DTDBGF:1;
      uint64_t DTLOCKUPF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DTFAULT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DTPRS0FC:1;
      uint64_t DTPRS1FC:1;
      uint64_t DTDBGFC:1;
      uint64_t TLOCKUPFC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DTFAULTC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKKEY:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DTLOCK;

