iSYSTEMLabs/winIDEAExampleWorkspaces/SiliconLabs/EFM32GG11/targetInit/efm32gg11_sfr.h
  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXPRSSEL:5;
      uint64_t reservedSpace0:2;
      uint64_t RXPRS:1;
      uint64_t CLKPRSSEL:5;
      uint64_t reservedSpace1:2;
      uint64_t CLKPRS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INPUT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t MONO:1;
      uint64_t JUSTIFY:1;
      uint64_t DMASPLIT:1;
      uint64_t DELAY:1;
      uint64_t reservedSpace0:3;
      uint64_t FORMAT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2SCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t TXDELAY:3;
      uint64_t reservedSpace1:1;
      uint64_t CSSETUP:3;
      uint64_t reservedSpace2:1;
      uint64_t ICS:3;
      uint64_t reservedSpace3:1;
      uint64_t CSHOLD:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMING;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DBGHALT:1;
      uint64_t CTSINV:1;
      uint64_t CTSEN:1;
      uint64_t RTSINV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRLX;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TCMPVAL:8;
      uint64_t reservedSpace0:8;
      uint64_t TSTART:3;
      uint64_t reservedSpace1:1;
      uint64_t TSTOP:3;
      uint64_t reservedSpace2:1;
      uint64_t RESTARTEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMECMP0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TCMPVAL:8;
      uint64_t reservedSpace0:8;
      uint64_t TSTART:3;
      uint64_t reservedSpace1:1;
      uint64_t TSTOP:3;
      uint64_t reservedSpace2:1;
      uint64_t RESTARTEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMECMP1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TCMPVAL:8;
      uint64_t reservedSpace0:8;
      uint64_t TSTART:3;
      uint64_t reservedSpace1:1;
      uint64_t TSTOP:3;
      uint64_t reservedSpace2:1;
      uint64_t RESTARTEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMECMP2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXPEN:1;
      uint64_t TXPEN:1;
      uint64_t CSPEN:1;
      uint64_t CLKPEN:1;
      uint64_t CTSPEN:1;
      uint64_t RTSPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ROUTEPEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXLOC:6;
      uint64_t reservedSpace0:2;
      uint64_t TXLOC:6;
      uint64_t reservedSpace1:2;
      uint64_t CSLOC:6;
      uint64_t reservedSpace2:2;
      uint64_t CLKLOC:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ROUTELOC0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTSLOC:6;
      uint64_t reservedSpace0:2;
      uint64_t RTSLOC:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ROUTELOC1;

};

#define USART2 (*(volatile struct USART2_tag *) 0x40010800)

struct USART3_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYNC:1;
      uint64_t LOOPBK:1;
      uint64_t CCEN:1;
      uint64_t MPM:1;
      uint64_t MPAB:1;
      uint64_t OVS:2;
      uint64_t reservedSpace0:1;
      uint64_t CLKPOL:1;
      uint64_t CLKPHA:1;
      uint64_t MSBF:1;
      uint64_t CSMA:1;
      uint64_t TXBIL:1;
      uint64_t RXINV:1;
      uint64_t TXINV:1;
      uint64_t CSINV:1;
      uint64_t AUTOCS:1;
      uint64_t AUTOTRI:1;
      uint64_t SCMODE:1;
      uint64_t SCRETRANS:1;
      uint64_t SKIPPERRF:1;
      uint64_t BIT8DV:1;
      uint64_t ERRSDMA:1;
      uint64_t ERRSRX:1;
      uint64_t ERRSTX:1;
      uint64_t SSSEARLY:1;
      uint64_t reservedSpace1:2;
      uint64_t BYTESWAP:1;
      uint64_t AUTOTX:1;
      uint64_t MVDIS:1;
      uint64_t SMSDELAY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATABITS:4;
      uint64_t reservedSpace0:4;
      uint64_t PARITY:2;
      uint64_t reservedSpace1:2;
      uint64_t STOPBITS:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRAME;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t RXTEN:1;
      uint64_t TXTEN:1;
      uint64_t AUTOTXTEN:1;
      uint64_t TXARX0EN:1;
      uint64_t TXARX1EN:1;
      uint64_t TXARX2EN:1;
      uint64_t RXATX0EN:1;
      uint64_t RXATX1EN:1;
      uint64_t RXATX2EN:1;
      uint64_t reservedSpace1:3;
      uint64_t TSEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRIGCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXEN:1;
      uint64_t RXDIS:1;
      uint64_t TXEN:1;
      uint64_t TXDIS:1;
      uint64_t MASTEREN:1;
      uint64_t MASTERDIS:1;
      uint64_t RXBLOCKEN:1;
      uint64_t RXBLOCKDIS:1;
      uint64_t TXTRIEN:1;
      uint64_t TXTRIDIS:1;
      uint64_t CLEARTX:1;
      uint64_t CLEARRX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXENS:1;
      uint64_t TXENS:1;
      uint64_t MASTER:1;
      uint64_t RXBLOCK:1;
      uint64_t TXTRI:1;
      uint64_t TXC:1;
      uint64_t TXBL:1;
      uint64_t RXDATAV:1;
      uint64_t RXFULL:1;
      uint64_t TXBDRIGHT:1;
      uint64_t TXBSRIGHT:1;
      uint64_t RXDATAVRIGHT:1;
      uint64_t RXFULLRIGHT:1;
      uint64_t TXIDLE:1;
      uint64_t TIMERRESTARTED:1;
      uint64_t reservedSpace0:1;
      uint64_t TXBUFCNT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t DIV:20;
      uint64_t reservedSpace1:8;
      uint64_t AUTOBAUDEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLKDIV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:9;
      uint64_t reservedSpace0:5;
      uint64_t PERR:1;
      uint64_t FERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXDATAX;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXDATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA0:9;
      uint64_t reservedSpace0:5;
      uint64_t PERR0:1;
      uint64_t FERR0:1;
      uint64_t RXDATA1:9;
      uint64_t reservedSpace1:5;
      uint64_t PERR1:1;
      uint64_t FERR1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXDOUBLEX;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA0:8;
      uint64_t RXDATA1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXDOUBLE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATAP:9;
      uint64_t reservedSpace0:5;
      uint64_t PERRP:1;
      uint64_t FERRP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXDATAXP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATAP0:9;
      uint64_t reservedSpace0:5;
      uint64_t PERRP0:1;
      uint64_t FERRP0:1;
      uint64_t RXDATAP1:9;
      uint64_t reservedSpace1:5;
      uint64_t PERRP1:1;
      uint64_t FERRP1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXDOUBLEXP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATAX:9;
      uint64_t reservedSpace0:2;
      uint64_t UBRXAT:1;
      uint64_t TXTRIAT:1;
      uint64_t TXBREAK:1;
      uint64_t TXDISAT:1;
      uint64_t RXENAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXDATAX;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXDATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA0:9;
      uint64_t reservedSpace0:2;
      uint64_t UBRXAT0:1;
      uint64_t TXTRIAT0:1;
      uint64_t TXBREAK0:1;
      uint64_t TXDISAT0:1;
      uint64_t RXENAT0:1;
      uint64_t TXDATA1:9;
      uint64_t reservedSpace1:2;
      uint64_t UBRXAT1:1;
      uint64_t TXTRIAT1:1;
      uint64_t TXBREAK1:1;
      uint64_t TXDISAT1:1;
      uint64_t RXENAT1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXDOUBLEX;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA0:8;
      uint64_t TXDATA1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXDOUBLE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXC:1;
      uint64_t TXBL:1;
      uint64_t RXDATAV:1;
      uint64_t RXFULL:1;
      uint64_t RXOF:1;
      uint64_t RXUF:1;
      uint64_t TXOF:1;
      uint64_t TXUF:1;
      uint64_t PERR:1;
      uint64_t FERR:1;
      uint64_t MPAF:1;
      uint64_t SSM:1;
      uint64_t CCF:1;
      uint64_t TXIDLE:1;
      uint64_t TCMP0:1;
      uint64_t TCMP1:1;
      uint64_t TCMP2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXC:1;
      uint64_t reservedSpace0:2;
      uint64_t RXFULL:1;
      uint64_t RXOF:1;
      uint64_t RXUF:1;
      uint64_t TXOF:1;
      uint64_t TXUF:1;
      uint64_t PERR:1;
      uint64_t FERR:1;
      uint64_t MPAF:1;
      uint64_t SSM:1;
      uint64_t CCF:1;
      uint64_t TXIDLE:1;
      uint64_t TCMP0:1;
      uint64_t TCMP1:1;
      uint64_t TCMP2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXC:1;
      uint64_t reservedSpace0:2;
      uint64_t RXFULL:1;
      uint64_t RXOF:1;
      uint64_t RXUF:1;
      uint64_t TXOF:1;
      uint64_t TXUF:1;
      uint64_t PERR:1;
      uint64_t FERR:1;
      uint64_t MPAF:1;
      uint64_t SSM:1;
      uint64_t CCF:1;
      uint64_t TXIDLE:1;
      uint64_t TCMP0:1;
      uint64_t TCMP1:1;
      uint64_t TCMP2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXC:1;
      uint64_t TXBL:1;
      uint64_t RXDATAV:1;
      uint64_t RXFULL:1;
      uint64_t RXOF:1;
      uint64_t RXUF:1;
      uint64_t TXOF:1;
      uint64_t TXUF:1;
      uint64_t PERR:1;
      uint64_t FERR:1;
      uint64_t MPAF:1;
      uint64_t SSM:1;
      uint64_t CCF:1;
      uint64_t TXIDLE:1;
      uint64_t TCMP0:1;
      uint64_t TCMP1:1;
      uint64_t TCMP2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IREN:1;
      uint64_t IRPW:2;
      uint64_t IRFILT:1;
      uint64_t reservedSpace0:3;
      uint64_t IRPRSEN:1;
      uint64_t IRPRSSEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRCTRL;

