iSYSTEMLabs/winIDEAExampleWorkspaces/SiliconLabs/EFM32GG11/targetInit/efm32gg11_sfr.h
  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXPRSSEL:5;
      uint64_t reservedSpace0:2;
      uint64_t RXPRS:1;
      uint64_t CLKPRSSEL:5;
      uint64_t reservedSpace1:2;
      uint64_t CLKPRS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INPUT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t MONO:1;
      uint64_t JUSTIFY:1;
      uint64_t DMASPLIT:1;
      uint64_t DELAY:1;
      uint64_t reservedSpace0:3;
      uint64_t FORMAT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2SCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t TXDELAY:3;
      uint64_t reservedSpace1:1;
      uint64_t CSSETUP:3;
      uint64_t reservedSpace2:1;
      uint64_t ICS:3;
      uint64_t reservedSpace3:1;
      uint64_t CSHOLD:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMING;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DBGHALT:1;
      uint64_t CTSINV:1;
      uint64_t CTSEN:1;
      uint64_t RTSINV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRLX;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TCMPVAL:8;
      uint64_t reservedSpace0:8;
      uint64_t TSTART:3;
      uint64_t reservedSpace1:1;
      uint64_t TSTOP:3;
      uint64_t reservedSpace2:1;
      uint64_t RESTARTEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMECMP0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TCMPVAL:8;
      uint64_t reservedSpace0:8;
      uint64_t TSTART:3;
      uint64_t reservedSpace1:1;
      uint64_t TSTOP:3;
      uint64_t reservedSpace2:1;
      uint64_t RESTARTEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMECMP1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TCMPVAL:8;
      uint64_t reservedSpace0:8;
      uint64_t TSTART:3;
      uint64_t reservedSpace1:1;
      uint64_t TSTOP:3;
      uint64_t reservedSpace2:1;
      uint64_t RESTARTEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMECMP2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXPEN:1;
      uint64_t TXPEN:1;
      uint64_t CSPEN:1;
      uint64_t CLKPEN:1;
      uint64_t CTSPEN:1;
      uint64_t RTSPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ROUTEPEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXLOC:6;
      uint64_t reservedSpace0:2;
      uint64_t TXLOC:6;
      uint64_t reservedSpace1:2;
      uint64_t CSLOC:6;
      uint64_t reservedSpace2:2;
      uint64_t CLKLOC:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ROUTELOC0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTSLOC:6;
      uint64_t reservedSpace0:2;
      uint64_t RTSLOC:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ROUTELOC1;

};

#define UART1 (*(volatile struct UART1_tag *) 0x40014400)

struct QSPI0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENBSPI:1;
      uint64_t SELCLKPOL:1;
      uint64_t SELCLKPHASE:1;
      uint64_t PHYMODEENABLE:1;
      uint64_t reservedSpace0:3;
      uint64_t ENBDIRACCCTLR:1;
      uint64_t ENBLEGACYIPMODE:1;
      uint64_t PERIPHSELDEC:1;
      uint64_t PERIPHCSLINES:2;
      uint64_t reservedSpace1:2;
      uint64_t WRPROTFLASH:1;
      uint64_t reservedSpace2:1;
      uint64_t ENBAHBADDRREMAP:1;
      uint64_t ENTERXIPMODE:1;
      uint64_t ENTERXIPMODEIMM:1;
      uint64_t MSTRBAUDDIV:4;
      uint64_t ENABLEAHBDECODER:1;
      uint64_t ENABLEDTRPROTOCOL:1;
      uint64_t PIPELINEPHY:1;
      uint64_t reservedSpace3:3;
      uint64_t CRCENABLE:1;
      uint64_t DUALBYTEOPCODEEN:1;
      uint64_t IDLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CONFIG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDOPCODENONXIP:8;
      uint64_t INSTRTYPE:2;
      uint64_t DDREN:1;
      uint64_t reservedSpace0:1;
      uint64_t ADDRXFERTYPESTDMODE:2;
      uint64_t reservedSpace1:2;
      uint64_t DATAXFERTYPEEXTMODE:2;
      uint64_t reservedSpace2:2;
      uint64_t MODEBITENABLE:1;
      uint64_t reservedSpace3:3;
      uint64_t DUMMYRDCLKCYCLES:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEVINSTRRDCONFIG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WROPCODE:8;
      uint64_t WELDIS:1;
      uint64_t reservedSpace0:3;
      uint64_t ADDRXFERTYPESTDMODE:2;
      uint64_t reservedSpace1:2;
      uint64_t DATAXFERTYPEEXTMODE:2;
      uint64_t reservedSpace2:6;
      uint64_t DUMMYWRCLKCYCLES:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEVINSTRWRCONFIG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DINIT:8;
      uint64_t DAFTER:8;
      uint64_t DBTWN:8;
      uint64_t DNSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEVDELAY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BYPASS:1;
      uint64_t DELAY:4;
      uint64_t reservedSpace0:3;
      uint64_t DQSENABLE:1;
      uint64_t reservedSpace1:7;
      uint64_t DDRREADDELAY:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RDDATACAPTURE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NUMADDRBYTES:4;
      uint64_t BYTESPERDEVICEPAGE:12;
      uint64_t BYTESPERSUBSECTOR:5;
      uint64_t MEMSIZEONCS0:2;
      uint64_t MEMSIZEONCS1:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEVSIZECONFIG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRAMPARTITIONCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INDAHBADDRTRIGGER;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REMAPADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:8;
      uint64_t CHUNKSIZE:3;
      uint64_t reservedSpace0:4;
      uint64_t CRCOUTENABLE:1;
      uint64_t RXCRCDATAUP:8;
      uint64_t RXCRCDATALOW:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MODEBITCONFIG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRAMFILLINDACREAD:16;
      uint64_t SRAMFILLINDACWRITE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRAMFILL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LEVEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXTHRESH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LEVEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXTHRESH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPCODE:8;
      uint64_t POLLINGBITINDEX:3;
      uint64_t reservedSpace0:2;
      uint64_t POLLINGPOLARITY:1;
      uint64_t DISABLEPOLLING:1;
      uint64_t ENABLEPOLLINGEXP:1;
      uint64_t POLLCOUNT:8;
      uint64_t POLLREPDELAY:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WRITECOMPLETIONCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NOOFPOLLSBEFEXP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NOOFPOLLSBEFEXP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODEMFAIL:1;
      uint64_t UNDERFLOWDET:1;
      uint64_t INDIRECTOPDONE:1;
      uint64_t INDIRECTREADREJECT:1;
      uint64_t PROTWRATTEMPT:1;
      uint64_t ILLEGALACCESSDET:1;
      uint64_t INDIRECTXFERLEVELBREACH:1;
      uint64_t RECVOVERFLOW:1;
      uint64_t TXFIFONOTFULL:1;
      uint64_t TXFIFOFULL:1;
      uint64_t RXFIFONOTEMPTY:1;
      uint64_t RXFIFOFULL:1;
      uint64_t INDRDSRAMFULL:1;
      uint64_t POLLEXPINT:1;
      uint64_t STIGREQINT:1;
      uint64_t reservedSpace0:1;
      uint64_t RXCRCDATAERR:1;
      uint64_t RXCRCDATAVAL:1;
      uint64_t TXCRCCHUNKBRK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQSTATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODEMFAILMASK:1;
      uint64_t UNDERFLOWDETMASK:1;
      uint64_t INDIRECTOPDONEMASK:1;
      uint64_t INDIRECTREADREJECTMASK:1;
      uint64_t PROTWRATTEMPTMASK:1;
      uint64_t ILLEGALACCESSDETMASK:1;
      uint64_t INDIRECTXFERLEVELBREACHMASK:1;
      uint64_t RECVOVERFLOWMASK:1;
      uint64_t TXFIFONOTFULLMASK:1;
      uint64_t TXFIFOFULLMASK:1;
      uint64_t RXFIFONOTEMPTYMASK:1;
      uint64_t RXFIFOFULLMASK:1;
      uint64_t INDRDSRAMFULLMASK:1;
      uint64_t POLLEXPINTMASK:1;
      uint64_t STIGREQMASK:1;
      uint64_t reservedSpace0:1;
      uint64_t RXCRCDATAERRMASK:1;
      uint64_t RXCRCDATAVALMASK:1;
      uint64_t TXCRCCHUNKBRKMASK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQMASK;

