iSYSTEMLabs/winIDEAExampleWorkspaces/SiliconLabs/EFM32GG11/targetInit/efm32gg11_sfr.h
  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SUBSECTOR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LOWERWRPROT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SUBSECTOR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UPPERWRPROT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INV:1;
      uint64_t ENB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WRPROTCTRL;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t START:1;
      uint64_t CANCEL:1;
      uint64_t RDSTATUS:1;
      uint64_t SRAMFULL:1;
      uint64_t RDQUEUED:1;
      uint64_t INDOPSDONESTATUS:1;
      uint64_t NUMINDOPSDONE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INDIRECTREADXFERCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LEVEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INDIRECTREADXFERWATERMARK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INDIRECTREADXFERSTART;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INDIRECTREADXFERNUMBYTES;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t START:1;
      uint64_t CANCEL:1;
      uint64_t WRSTATUS:1;
      uint64_t reservedSpace0:1;
      uint64_t WRQUEUED:1;
      uint64_t INDOPSDONESTATUS:1;
      uint64_t NUMINDOPSDONE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INDIRECTWRITEXFERCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LEVEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INDIRECTWRITEXFERWATERMARK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INDIRECTWRITEXFERSTART;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INDIRECTWRITEXFERNUMBYTES;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INDRANGEWIDTH:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INDIRECTTRIGGERADDRRANGE;

  uint8_t res3[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRIGGERMEMBANKREQ:1;
      uint64_t MEMBANKREQINPROGRESS:1;
      uint64_t reservedSpace0:6;
      uint64_t MEMBANKREADDATA:8;
      uint64_t NBOFSTIGREADBYTES:3;
      uint64_t reservedSpace1:1;
      uint64_t MEMBANKADDR:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASHCOMMANDCTRLMEM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMDEXEC:1;
      uint64_t CMDEXECSTATUS:1;
      uint64_t STIGMEMBANKEN:1;
      uint64_t reservedSpace0:4;
      uint64_t NUMDUMMYCYCLES:5;
      uint64_t NUMWRDATABYTES:3;
      uint64_t ENBWRITEDATA:1;
      uint64_t NUMADDRBYTES:2;
      uint64_t ENBMODEBIT:1;
      uint64_t ENBCOMDADDR:1;
      uint64_t NUMRDDATABYTES:3;
      uint64_t ENBREADDATA:1;
      uint64_t CMDOPCODE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASHCMDCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASHCMDADDR;

  uint8_t res4[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASHRDDATALOWER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASHRDDATAUPPER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASHWRDATALOWER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASHWRDATAUPPER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DEVICESTATUS:8;
      uint64_t DEVICESTATUSVALID:1;
      uint64_t reservedSpace0:7;
      uint64_t DEVICESTATUSNBDUMMY:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) POLLINGFLASHSTATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PHYCONFIGRXDLLDELAY:7;
      uint64_t reservedSpace0:9;
      uint64_t PHYCONFIGTXDLLDELAY:7;
      uint64_t reservedSpace1:6;
      uint64_t PHYCONFIGRXDLLBYPASS:1;
      uint64_t PHYCONFIGRESET:1;
      uint64_t PHYCONFIGRESYNC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PHYCONFIGURATION;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PHYMASTERINITIALDELAY:7;
      uint64_t reservedSpace0:9;
      uint64_t PHYMASTERNBINDICATIONS:3;
      uint64_t reservedSpace1:1;
      uint64_t PHYMASTERPHASEDETECTSELECTOR:3;
      uint64_t PHYMASTERBYPASSMODE:1;
      uint64_t PHYMASTERLOCKMODE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PHYMASTERCONTROL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DLLOBSERVABLELOWERDLLLOCK:1;
      uint64_t DLLOBSERVABLELOWERLOCKMODE:2;
      uint64_t DLLOBSERVABLELOWERUNLOCKCOUNTER:5;
      uint64_t DLLOBSERVABLELOWERLOCKVALUE:7;
      uint64_t DLLOBSERVABLELOWERLOOPBACKLOCK:1;
      uint64_t DLLOBSERVABLELOWERDLLLOCKDEC:8;
      uint64_t DLLOBSERVABLELOWERDLLLOCKINC:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DLLOBSERVABLELOWER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DLLOBSERVABLEUPPERRXDECODEROUTPUT:7;
      uint64_t reservedSpace0:9;
      uint64_t DLLOBSERVABLEUPPERTXDECODEROUTPUT:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DLLOBSERVABLEUPPER;

  uint8_t res5[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTSTIGOPCODE:8;
      uint64_t EXTPOLLOPCODE:8;
      uint64_t EXTWRITEOPCODE:8;
      uint64_t EXTREADOPCODE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPCODEEXTLOWER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t EXTWELOPCODE:8;
      uint64_t WELOPCODE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPCODEEXTUPPER;

  uint8_t res6[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONF:2;
      uint64_t reservedSpace0:6;
      uint64_t MODULEID:16;
      uint64_t FIXPATCH:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MODULEID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDLYMUXSEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCLKPEN:1;
      uint64_t CS0PEN:1;
      uint64_t CS1PEN:1;
      uint64_t reservedSpace0:2;
      uint64_t DQ0PEN:1;
      uint64_t DQ1PEN:1;
      uint64_t DQ2PEN:1;
      uint64_t DQ3PEN:1;
      uint64_t DQ4PEN:1;
      uint64_t DQ5PEN:1;
      uint64_t DQ6PEN:1;
      uint64_t DQ7PEN:1;
      uint64_t DQSPEN:1;
      uint64_t SCLKINPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ROUTEPEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QSPILOC:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ROUTELOC0;

