iSYSTEMLabs/winIDEAExampleWorkspaces/SiliconLabs/EFM32GG11/targetInit/efm32gg11_sfr.h
};

#define QSPI0 (*(volatile struct QSPI0_tag *) 0x4001c400)

struct LEUART0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t AUTOTRI:1;
      uint64_t DATABITS:1;
      uint64_t PARITY:2;
      uint64_t STOPBITS:1;
      uint64_t INV:1;
      uint64_t ERRSDMA:1;
      uint64_t LOOPBK:1;
      uint64_t SFUBRX:1;
      uint64_t MPM:1;
      uint64_t MPAB:1;
      uint64_t BIT8DV:1;
      uint64_t RXDMAWU:1;
      uint64_t TXDMAWU:1;
      uint64_t TXDELAY:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXEN:1;
      uint64_t RXDIS:1;
      uint64_t TXEN:1;
      uint64_t TXDIS:1;
      uint64_t RXBLOCKEN:1;
      uint64_t RXBLOCKDIS:1;
      uint64_t CLEARTX:1;
      uint64_t CLEARRX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXENS:1;
      uint64_t TXENS:1;
      uint64_t RXBLOCK:1;
      uint64_t TXC:1;
      uint64_t TXBL:1;
      uint64_t RXDATAV:1;
      uint64_t TXIDLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t DIV:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLKDIV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STARTFRAME:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STARTFRAME;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIGFRAME:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIGFRAME;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:9;
      uint64_t reservedSpace0:5;
      uint64_t PERR:1;
      uint64_t FERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXDATAX;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXDATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATAP:9;
      uint64_t reservedSpace0:5;
      uint64_t PERRP:1;
      uint64_t FERRP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXDATAXP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:9;
      uint64_t reservedSpace0:4;
      uint64_t TXBREAK:1;
      uint64_t TXDISAT:1;
      uint64_t RXENAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXDATAX;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXDATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXC:1;
      uint64_t TXBL:1;
      uint64_t RXDATAV:1;
      uint64_t RXOF:1;
      uint64_t RXUF:1;
      uint64_t TXOF:1;
      uint64_t PERR:1;
      uint64_t FERR:1;
      uint64_t MPAF:1;
      uint64_t STARTF:1;
      uint64_t SIGF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXC:1;
      uint64_t reservedSpace0:2;
      uint64_t RXOF:1;
      uint64_t RXUF:1;
      uint64_t TXOF:1;
      uint64_t PERR:1;
      uint64_t FERR:1;
      uint64_t MPAF:1;
      uint64_t STARTF:1;
      uint64_t SIGF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXC:1;
      uint64_t reservedSpace0:2;
      uint64_t RXOF:1;
      uint64_t RXUF:1;
      uint64_t TXOF:1;
      uint64_t PERR:1;
      uint64_t FERR:1;
      uint64_t MPAF:1;
      uint64_t STARTF:1;
      uint64_t SIGF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXC:1;
      uint64_t TXBL:1;
      uint64_t RXDATAV:1;
      uint64_t RXOF:1;
      uint64_t RXUF:1;
      uint64_t TXOF:1;
      uint64_t PERR:1;
      uint64_t FERR:1;
      uint64_t MPAF:1;
      uint64_t STARTF:1;
      uint64_t SIGF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PULSEW:4;
      uint64_t PULSEEN:1;
      uint64_t PULSEFILT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PULSECTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGFREEZE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FREEZE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTRL:1;
      uint64_t CMD:1;
      uint64_t CLKDIV:1;
      uint64_t STARTFRAME:1;
      uint64_t SIGFRAME:1;
      uint64_t TXDATAX:1;
      uint64_t TXDATA:1;
      uint64_t PULSECTRL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYNCBUSY;

  uint8_t res0[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXPEN:1;
      uint64_t TXPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ROUTEPEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXLOC:6;
      uint64_t reservedSpace0:2;
      uint64_t TXLOC:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ROUTELOC0;

  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXPRSSEL:5;
      uint64_t RXPRS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INPUT;

};

#define LEUART0 (*(volatile struct LEUART0_tag *) 0x4006a000)

struct LEUART1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t AUTOTRI:1;
      uint64_t DATABITS:1;
      uint64_t PARITY:2;
      uint64_t STOPBITS:1;
      uint64_t INV:1;
      uint64_t ERRSDMA:1;
      uint64_t LOOPBK:1;
      uint64_t SFUBRX:1;
      uint64_t MPM:1;
      uint64_t MPAB:1;
      uint64_t BIT8DV:1;
      uint64_t RXDMAWU:1;
      uint64_t TXDMAWU:1;
      uint64_t TXDELAY:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXEN:1;
      uint64_t RXDIS:1;
      uint64_t TXEN:1;
      uint64_t TXDIS:1;
      uint64_t RXBLOCKEN:1;
      uint64_t RXBLOCKDIS:1;
      uint64_t CLEARTX:1;
      uint64_t CLEARRX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXENS:1;
      uint64_t TXENS:1;
      uint64_t RXBLOCK:1;
      uint64_t TXC:1;
      uint64_t TXBL:1;
      uint64_t RXDATAV:1;
      uint64_t TXIDLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t DIV:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLKDIV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STARTFRAME:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STARTFRAME;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIGFRAME:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIGFRAME;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:9;
      uint64_t reservedSpace0:5;
      uint64_t PERR:1;
      uint64_t FERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXDATAX;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXDATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATAP:9;
      uint64_t reservedSpace0:5;
      uint64_t PERRP:1;
      uint64_t FERRP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXDATAXP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:9;
      uint64_t reservedSpace0:4;
      uint64_t TXBREAK:1;
      uint64_t TXDISAT:1;
      uint64_t RXENAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXDATAX;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXDATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXC:1;
      uint64_t TXBL:1;
      uint64_t RXDATAV:1;
      uint64_t RXOF:1;
      uint64_t RXUF:1;
      uint64_t TXOF:1;
      uint64_t PERR:1;
      uint64_t FERR:1;
      uint64_t MPAF:1;
      uint64_t STARTF:1;
      uint64_t SIGF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXC:1;
      uint64_t reservedSpace0:2;
      uint64_t RXOF:1;
      uint64_t RXUF:1;
      uint64_t TXOF:1;
      uint64_t PERR:1;
      uint64_t FERR:1;
      uint64_t MPAF:1;
      uint64_t STARTF:1;
      uint64_t SIGF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXC:1;
      uint64_t reservedSpace0:2;
      uint64_t RXOF:1;
      uint64_t RXUF:1;
      uint64_t TXOF:1;
      uint64_t PERR:1;
      uint64_t FERR:1;
      uint64_t MPAF:1;
      uint64_t STARTF:1;
      uint64_t SIGF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXC:1;
      uint64_t TXBL:1;
      uint64_t RXDATAV:1;
      uint64_t RXOF:1;
      uint64_t RXUF:1;
      uint64_t TXOF:1;
      uint64_t PERR:1;
      uint64_t FERR:1;
      uint64_t MPAF:1;
      uint64_t STARTF:1;
      uint64_t SIGF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PULSEW:4;
      uint64_t PULSEEN:1;
      uint64_t PULSEFILT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PULSECTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGFREEZE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FREEZE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTRL:1;
      uint64_t CMD:1;
      uint64_t CLKDIV:1;
      uint64_t STARTFRAME:1;
      uint64_t SIGFRAME:1;
      uint64_t TXDATAX:1;
      uint64_t TXDATA:1;
      uint64_t PULSECTRL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYNCBUSY;

  uint8_t res0[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXPEN:1;
      uint64_t TXPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ROUTEPEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXLOC:6;
      uint64_t reservedSpace0:2;
      uint64_t TXLOC:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ROUTELOC0;

