iSYSTEMLabs/winIDEAExampleWorkspaces/SiliconLabs/EFM32GG11/targetInit/efm32gg11_sfr.h
  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXPRSSEL:5;
      uint64_t RXPRS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INPUT;

};

#define LEUART1 (*(volatile struct LEUART1_tag *) 0x4006a400)

struct LETIMER0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t REPMODE:2;
      uint64_t UFOA0:2;
      uint64_t UFOA1:2;
      uint64_t OPOL0:1;
      uint64_t OPOL1:1;
      uint64_t BUFTOP:1;
      uint64_t COMP0TOP:1;
      uint64_t reservedSpace0:2;
      uint64_t DEBUGRUN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t START:1;
      uint64_t STOP:1;
      uint64_t CLEAR:1;
      uint64_t CTO0:1;
      uint64_t CTO1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUNNING:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP0:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COMP0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP1:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COMP1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REP0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REP0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REP1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REP1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP0:1;
      uint64_t COMP1:1;
      uint64_t UF:1;
      uint64_t REP0:1;
      uint64_t REP1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP0:1;
      uint64_t COMP1:1;
      uint64_t UF:1;
      uint64_t REP0:1;
      uint64_t REP1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP0:1;
      uint64_t COMP1:1;
      uint64_t UF:1;
      uint64_t REP0:1;
      uint64_t REP1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP0:1;
      uint64_t COMP1:1;
      uint64_t UF:1;
      uint64_t REP0:1;
      uint64_t REP1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IEN;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t CMD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYNCBUSY;

  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OUT0PEN:1;
      uint64_t OUT1PEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ROUTEPEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OUT0LOC:6;
      uint64_t reservedSpace0:2;
      uint64_t OUT1LOC:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ROUTELOC0;

  uint8_t res2[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRSSTARTSEL:5;
      uint64_t reservedSpace0:1;
      uint64_t PRSSTOPSEL:5;
      uint64_t reservedSpace1:1;
      uint64_t PRSCLEARSEL:5;
      uint64_t reservedSpace2:1;
      uint64_t PRSSTARTMODE:2;
      uint64_t reservedSpace3:2;
      uint64_t PRSSTOPMODE:2;
      uint64_t reservedSpace4:2;
      uint64_t PRSCLEARMODE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRSSEL;

};

#define LETIMER0 (*(volatile struct LETIMER0_tag *) 0x40066000)

struct LETIMER1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t REPMODE:2;
      uint64_t UFOA0:2;
      uint64_t UFOA1:2;
      uint64_t OPOL0:1;
      uint64_t OPOL1:1;
      uint64_t BUFTOP:1;
      uint64_t COMP0TOP:1;
      uint64_t reservedSpace0:2;
      uint64_t DEBUGRUN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t START:1;
      uint64_t STOP:1;
      uint64_t CLEAR:1;
      uint64_t CTO0:1;
      uint64_t CTO1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUNNING:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP0:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COMP0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP1:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COMP1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REP0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REP0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REP1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REP1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP0:1;
      uint64_t COMP1:1;
      uint64_t UF:1;
      uint64_t REP0:1;
      uint64_t REP1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP0:1;
      uint64_t COMP1:1;
      uint64_t UF:1;
      uint64_t REP0:1;
      uint64_t REP1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP0:1;
      uint64_t COMP1:1;
      uint64_t UF:1;
      uint64_t REP0:1;
      uint64_t REP1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP0:1;
      uint64_t COMP1:1;
      uint64_t UF:1;
      uint64_t REP0:1;
      uint64_t REP1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IEN;

