iSYSTEMLabs/winIDEAExampleWorkspaces/SiliconLabs/EFM32GG11/targetInit/efm32gg11_sfr.h
};

#define PCNT0 (*(volatile struct PCNT0_tag *) 0x4006e000)

struct PCNT1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t FILT:1;
      uint64_t RSTEN:1;
      uint64_t CNTRSTEN:1;
      uint64_t AUXCNTRSTEN:1;
      uint64_t DEBUGHALT:1;
      uint64_t HYST:1;
      uint64_t S1CDIR:1;
      uint64_t CNTEV:2;
      uint64_t AUXCNTEV:2;
      uint64_t CNTDIR:1;
      uint64_t EDGE:1;
      uint64_t TCCMODE:2;
      uint64_t reservedSpace0:1;
      uint64_t TCCPRESC:2;
      uint64_t reservedSpace1:1;
      uint64_t TCCCOMP:2;
      uint64_t PRSGATEEN:1;
      uint64_t TCCPRSPOL:1;
      uint64_t TCCPRSSEL:5;
      uint64_t TOPBHFSEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LCNTIM:1;
      uint64_t LTOPBIM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TOP:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TOP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TOPB:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TOPB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UF:1;
      uint64_t OF:1;
      uint64_t DIRCNG:1;
      uint64_t AUXOF:1;
      uint64_t TCC:1;
      uint64_t OQSTERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UF:1;
      uint64_t OF:1;
      uint64_t DIRCNG:1;
      uint64_t AUXOF:1;
      uint64_t TCC:1;
      uint64_t OQSTERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UF:1;
      uint64_t OF:1;
      uint64_t DIRCNG:1;
      uint64_t AUXOF:1;
      uint64_t TCC:1;
      uint64_t OQSTERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UF:1;
      uint64_t OF:1;
      uint64_t DIRCNG:1;
      uint64_t AUXOF:1;
      uint64_t TCC:1;
      uint64_t OQSTERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IEN;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S0INLOC:6;
      uint64_t reservedSpace0:2;
      uint64_t S1INLOC:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ROUTELOC0;

  uint8_t res1[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGFREEZE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FREEZE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTRL:1;
      uint64_t CMD:1;
      uint64_t TOPB:1;
      uint64_t OVSCFG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYNCBUSY;

  uint8_t res2[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AUXCNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AUXCNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S0PRSSEL:5;
      uint64_t S0PRSEN:1;
      uint64_t S1PRSSEL:5;
      uint64_t S1PRSEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INPUT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FILTLEN:8;
      uint64_t reservedSpace0:4;
      uint64_t FLUTTERRM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OVSCFG;

};

#define PCNT1 (*(volatile struct PCNT1_tag *) 0x4006e400)

struct PCNT2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t FILT:1;
      uint64_t RSTEN:1;
      uint64_t CNTRSTEN:1;
      uint64_t AUXCNTRSTEN:1;
      uint64_t DEBUGHALT:1;
      uint64_t HYST:1;
      uint64_t S1CDIR:1;
      uint64_t CNTEV:2;
      uint64_t AUXCNTEV:2;
      uint64_t CNTDIR:1;
      uint64_t EDGE:1;
      uint64_t TCCMODE:2;
      uint64_t reservedSpace0:1;
      uint64_t TCCPRESC:2;
      uint64_t reservedSpace1:1;
      uint64_t TCCCOMP:2;
      uint64_t PRSGATEEN:1;
      uint64_t TCCPRSPOL:1;
      uint64_t TCCPRSSEL:5;
      uint64_t TOPBHFSEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LCNTIM:1;
      uint64_t LTOPBIM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TOP:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TOP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TOPB:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TOPB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UF:1;
      uint64_t OF:1;
      uint64_t DIRCNG:1;
      uint64_t AUXOF:1;
      uint64_t TCC:1;
      uint64_t OQSTERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UF:1;
      uint64_t OF:1;
      uint64_t DIRCNG:1;
      uint64_t AUXOF:1;
      uint64_t TCC:1;
      uint64_t OQSTERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UF:1;
      uint64_t OF:1;
      uint64_t DIRCNG:1;
      uint64_t AUXOF:1;
      uint64_t TCC:1;
      uint64_t OQSTERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UF:1;
      uint64_t OF:1;
      uint64_t DIRCNG:1;
      uint64_t AUXOF:1;
      uint64_t TCC:1;
      uint64_t OQSTERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IEN;

