iSYSTEMLabs/winIDEAExampleWorkspaces/SiliconLabs/EFM32GG11/targetInit/efm32gg11_sfr.h
  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S0INLOC:6;
      uint64_t reservedSpace0:2;
      uint64_t S1INLOC:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ROUTELOC0;

  uint8_t res1[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGFREEZE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FREEZE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTRL:1;
      uint64_t CMD:1;
      uint64_t TOPB:1;
      uint64_t OVSCFG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYNCBUSY;

  uint8_t res2[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AUXCNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AUXCNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S0PRSSEL:5;
      uint64_t S0PRSEN:1;
      uint64_t S1PRSSEL:5;
      uint64_t S1PRSEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INPUT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FILTLEN:8;
      uint64_t reservedSpace0:4;
      uint64_t FLUTTERRM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OVSCFG;

};

#define PCNT2 (*(volatile struct PCNT2_tag *) 0x4006e800)

struct I2C0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t SLAVE:1;
      uint64_t AUTOACK:1;
      uint64_t AUTOSE:1;
      uint64_t AUTOSN:1;
      uint64_t ARBDIS:1;
      uint64_t GCAMEN:1;
      uint64_t TXBIL:1;
      uint64_t CLHR:2;
      uint64_t reservedSpace0:2;
      uint64_t BITO:2;
      uint64_t reservedSpace1:1;
      uint64_t GIBITO:1;
      uint64_t CLTO:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t START:1;
      uint64_t STOP:1;
      uint64_t ACK:1;
      uint64_t NACK:1;
      uint64_t CONT:1;
      uint64_t ABORT:1;
      uint64_t CLEARTX:1;
      uint64_t CLEARPC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BUSY:1;
      uint64_t MASTER:1;
      uint64_t TRANSMITTER:1;
      uint64_t NACKED:1;
      uint64_t BUSHOLD:1;
      uint64_t STATE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PSTART:1;
      uint64_t PSTOP:1;
      uint64_t PACK:1;
      uint64_t PNACK:1;
      uint64_t PCONT:1;
      uint64_t PABORT:1;
      uint64_t TXC:1;
      uint64_t TXBL:1;
      uint64_t RXDATAV:1;
      uint64_t RXFULL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLKDIV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t ADDR:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t MASK:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SADDRMASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXDATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA0:8;
      uint64_t RXDATA1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXDOUBLE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATAP:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXDATAP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATAP0:8;
      uint64_t RXDATAP1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXDOUBLEP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXDATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA0:8;
      uint64_t TXDATA1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXDOUBLE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t START:1;
      uint64_t RSTART:1;
      uint64_t ADDR:1;
      uint64_t TXC:1;
      uint64_t TXBL:1;
      uint64_t RXDATAV:1;
      uint64_t ACK:1;
      uint64_t NACK:1;
      uint64_t MSTOP:1;
      uint64_t ARBLOST:1;
      uint64_t BUSERR:1;
      uint64_t BUSHOLD:1;
      uint64_t TXOF:1;
      uint64_t RXUF:1;
      uint64_t BITO:1;
      uint64_t CLTO:1;
      uint64_t SSTOP:1;
      uint64_t RXFULL:1;
      uint64_t CLERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t START:1;
      uint64_t RSTART:1;
      uint64_t ADDR:1;
      uint64_t TXC:1;
      uint64_t reservedSpace0:2;
      uint64_t ACK:1;
      uint64_t NACK:1;
      uint64_t MSTOP:1;
      uint64_t ARBLOST:1;
      uint64_t BUSERR:1;
      uint64_t BUSHOLD:1;
      uint64_t TXOF:1;
      uint64_t RXUF:1;
      uint64_t BITO:1;
      uint64_t CLTO:1;
      uint64_t SSTOP:1;
      uint64_t RXFULL:1;
      uint64_t CLERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t START:1;
      uint64_t RSTART:1;
      uint64_t ADDR:1;
      uint64_t TXC:1;
      uint64_t reservedSpace0:2;
      uint64_t ACK:1;
      uint64_t NACK:1;
      uint64_t MSTOP:1;
      uint64_t ARBLOST:1;
      uint64_t BUSERR:1;
      uint64_t BUSHOLD:1;
      uint64_t TXOF:1;
      uint64_t RXUF:1;
      uint64_t BITO:1;
      uint64_t CLTO:1;
      uint64_t SSTOP:1;
      uint64_t RXFULL:1;
      uint64_t CLERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t START:1;
      uint64_t RSTART:1;
      uint64_t ADDR:1;
      uint64_t TXC:1;
      uint64_t TXBL:1;
      uint64_t RXDATAV:1;
      uint64_t ACK:1;
      uint64_t NACK:1;
      uint64_t MSTOP:1;
      uint64_t ARBLOST:1;
      uint64_t BUSERR:1;
      uint64_t BUSHOLD:1;
      uint64_t TXOF:1;
      uint64_t RXUF:1;
      uint64_t BITO:1;
      uint64_t CLTO:1;
      uint64_t SSTOP:1;
      uint64_t RXFULL:1;
      uint64_t CLERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SDAPEN:1;
      uint64_t SCLPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ROUTEPEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SDALOC:6;
      uint64_t reservedSpace0:2;
      uint64_t SCLLOC:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ROUTELOC0;

