iSYSTEMLabs/winIDEAExampleWorkspaces/SiliconLabs/EFM32GG11/targetInit/efm32gg11_sfr.h
};

#define I2C0 (*(volatile struct I2C0_tag *) 0x40089000)

struct I2C1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t SLAVE:1;
      uint64_t AUTOACK:1;
      uint64_t AUTOSE:1;
      uint64_t AUTOSN:1;
      uint64_t ARBDIS:1;
      uint64_t GCAMEN:1;
      uint64_t TXBIL:1;
      uint64_t CLHR:2;
      uint64_t reservedSpace0:2;
      uint64_t BITO:2;
      uint64_t reservedSpace1:1;
      uint64_t GIBITO:1;
      uint64_t CLTO:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t START:1;
      uint64_t STOP:1;
      uint64_t ACK:1;
      uint64_t NACK:1;
      uint64_t CONT:1;
      uint64_t ABORT:1;
      uint64_t CLEARTX:1;
      uint64_t CLEARPC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BUSY:1;
      uint64_t MASTER:1;
      uint64_t TRANSMITTER:1;
      uint64_t NACKED:1;
      uint64_t BUSHOLD:1;
      uint64_t STATE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PSTART:1;
      uint64_t PSTOP:1;
      uint64_t PACK:1;
      uint64_t PNACK:1;
      uint64_t PCONT:1;
      uint64_t PABORT:1;
      uint64_t TXC:1;
      uint64_t TXBL:1;
      uint64_t RXDATAV:1;
      uint64_t RXFULL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLKDIV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t ADDR:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t MASK:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SADDRMASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXDATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA0:8;
      uint64_t RXDATA1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXDOUBLE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATAP:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXDATAP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATAP0:8;
      uint64_t RXDATAP1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXDOUBLEP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXDATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA0:8;
      uint64_t TXDATA1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXDOUBLE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t START:1;
      uint64_t RSTART:1;
      uint64_t ADDR:1;
      uint64_t TXC:1;
      uint64_t TXBL:1;
      uint64_t RXDATAV:1;
      uint64_t ACK:1;
      uint64_t NACK:1;
      uint64_t MSTOP:1;
      uint64_t ARBLOST:1;
      uint64_t BUSERR:1;
      uint64_t BUSHOLD:1;
      uint64_t TXOF:1;
      uint64_t RXUF:1;
      uint64_t BITO:1;
      uint64_t CLTO:1;
      uint64_t SSTOP:1;
      uint64_t RXFULL:1;
      uint64_t CLERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t START:1;
      uint64_t RSTART:1;
      uint64_t ADDR:1;
      uint64_t TXC:1;
      uint64_t reservedSpace0:2;
      uint64_t ACK:1;
      uint64_t NACK:1;
      uint64_t MSTOP:1;
      uint64_t ARBLOST:1;
      uint64_t BUSERR:1;
      uint64_t BUSHOLD:1;
      uint64_t TXOF:1;
      uint64_t RXUF:1;
      uint64_t BITO:1;
      uint64_t CLTO:1;
      uint64_t SSTOP:1;
      uint64_t RXFULL:1;
      uint64_t CLERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t START:1;
      uint64_t RSTART:1;
      uint64_t ADDR:1;
      uint64_t TXC:1;
      uint64_t reservedSpace0:2;
      uint64_t ACK:1;
      uint64_t NACK:1;
      uint64_t MSTOP:1;
      uint64_t ARBLOST:1;
      uint64_t BUSERR:1;
      uint64_t BUSHOLD:1;
      uint64_t TXOF:1;
      uint64_t RXUF:1;
      uint64_t BITO:1;
      uint64_t CLTO:1;
      uint64_t SSTOP:1;
      uint64_t RXFULL:1;
      uint64_t CLERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t START:1;
      uint64_t RSTART:1;
      uint64_t ADDR:1;
      uint64_t TXC:1;
      uint64_t TXBL:1;
      uint64_t RXDATAV:1;
      uint64_t ACK:1;
      uint64_t NACK:1;
      uint64_t MSTOP:1;
      uint64_t ARBLOST:1;
      uint64_t BUSERR:1;
      uint64_t BUSHOLD:1;
      uint64_t TXOF:1;
      uint64_t RXUF:1;
      uint64_t BITO:1;
      uint64_t CLTO:1;
      uint64_t SSTOP:1;
      uint64_t RXFULL:1;
      uint64_t CLERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SDAPEN:1;
      uint64_t SCLPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ROUTEPEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SDALOC:6;
      uint64_t reservedSpace0:2;
      uint64_t SCLLOC:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ROUTELOC0;

};

#define I2C1 (*(volatile struct I2C1_tag *) 0x40089400)

struct I2C2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t SLAVE:1;
      uint64_t AUTOACK:1;
      uint64_t AUTOSE:1;
      uint64_t AUTOSN:1;
      uint64_t ARBDIS:1;
      uint64_t GCAMEN:1;
      uint64_t TXBIL:1;
      uint64_t CLHR:2;
      uint64_t reservedSpace0:2;
      uint64_t BITO:2;
      uint64_t reservedSpace1:1;
      uint64_t GIBITO:1;
      uint64_t CLTO:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t START:1;
      uint64_t STOP:1;
      uint64_t ACK:1;
      uint64_t NACK:1;
      uint64_t CONT:1;
      uint64_t ABORT:1;
      uint64_t CLEARTX:1;
      uint64_t CLEARPC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BUSY:1;
      uint64_t MASTER:1;
      uint64_t TRANSMITTER:1;
      uint64_t NACKED:1;
      uint64_t BUSHOLD:1;
      uint64_t STATE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PSTART:1;
      uint64_t PSTOP:1;
      uint64_t PACK:1;
      uint64_t PNACK:1;
      uint64_t PCONT:1;
      uint64_t PABORT:1;
      uint64_t TXC:1;
      uint64_t TXBL:1;
      uint64_t RXDATAV:1;
      uint64_t RXFULL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLKDIV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t ADDR:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t MASK:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SADDRMASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXDATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA0:8;
      uint64_t RXDATA1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXDOUBLE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATAP:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXDATAP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATAP0:8;
      uint64_t RXDATAP1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXDOUBLEP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXDATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA0:8;
      uint64_t TXDATA1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXDOUBLE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t START:1;
      uint64_t RSTART:1;
      uint64_t ADDR:1;
      uint64_t TXC:1;
      uint64_t TXBL:1;
      uint64_t RXDATAV:1;
      uint64_t ACK:1;
      uint64_t NACK:1;
      uint64_t MSTOP:1;
      uint64_t ARBLOST:1;
      uint64_t BUSERR:1;
      uint64_t BUSHOLD:1;
      uint64_t TXOF:1;
      uint64_t RXUF:1;
      uint64_t BITO:1;
      uint64_t CLTO:1;
      uint64_t SSTOP:1;
      uint64_t RXFULL:1;
      uint64_t CLERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t START:1;
      uint64_t RSTART:1;
      uint64_t ADDR:1;
      uint64_t TXC:1;
      uint64_t reservedSpace0:2;
      uint64_t ACK:1;
      uint64_t NACK:1;
      uint64_t MSTOP:1;
      uint64_t ARBLOST:1;
      uint64_t BUSERR:1;
      uint64_t BUSHOLD:1;
      uint64_t TXOF:1;
      uint64_t RXUF:1;
      uint64_t BITO:1;
      uint64_t CLTO:1;
      uint64_t SSTOP:1;
      uint64_t RXFULL:1;
      uint64_t CLERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t START:1;
      uint64_t RSTART:1;
      uint64_t ADDR:1;
      uint64_t TXC:1;
      uint64_t reservedSpace0:2;
      uint64_t ACK:1;
      uint64_t NACK:1;
      uint64_t MSTOP:1;
      uint64_t ARBLOST:1;
      uint64_t BUSERR:1;
      uint64_t BUSHOLD:1;
      uint64_t TXOF:1;
      uint64_t RXUF:1;
      uint64_t BITO:1;
      uint64_t CLTO:1;
      uint64_t SSTOP:1;
      uint64_t RXFULL:1;
      uint64_t CLERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t START:1;
      uint64_t RSTART:1;
      uint64_t ADDR:1;
      uint64_t TXC:1;
      uint64_t TXBL:1;
      uint64_t RXDATAV:1;
      uint64_t ACK:1;
      uint64_t NACK:1;
      uint64_t MSTOP:1;
      uint64_t ARBLOST:1;
      uint64_t BUSERR:1;
      uint64_t BUSHOLD:1;
      uint64_t TXOF:1;
      uint64_t RXUF:1;
      uint64_t BITO:1;
      uint64_t CLTO:1;
      uint64_t SSTOP:1;
      uint64_t RXFULL:1;
      uint64_t CLERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SDAPEN:1;
      uint64_t SCLPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ROUTEPEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SDALOC:6;
      uint64_t reservedSpace0:2;
      uint64_t SCLLOC:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ROUTELOC0;

