iSYSTEMLabs/winIDEAExampleWorkspaces/SiliconLabs/EFM32GG11/targetInit/efm32gg11_sfr.h
  uint8_t res2[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t APORT0XREQ:1;
      uint64_t APORT0YREQ:1;
      uint64_t APORT1XREQ:1;
      uint64_t APORT1YREQ:1;
      uint64_t APORT2XREQ:1;
      uint64_t APORT2YREQ:1;
      uint64_t APORT3XREQ:1;
      uint64_t APORT3YREQ:1;
      uint64_t APORT4XREQ:1;
      uint64_t APORT4YREQ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APORTREQ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t APORT0XCONFLICT:1;
      uint64_t APORT0YCONFLICT:1;
      uint64_t APORT1XCONFLICT:1;
      uint64_t APORT1YCONFLICT:1;
      uint64_t APORT2XCONFLICT:1;
      uint64_t APORT2YCONFLICT:1;
      uint64_t APORT3XCONFLICT:1;
      uint64_t APORT3YCONFLICT:1;
      uint64_t APORT4XCONFLICT:1;
      uint64_t APORT4YCONFLICT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APORTCONFLICT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SINGLEDC:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SINGLEFIFOCOUNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCANDC:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCANFIFOCOUNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SINGLEFIFOCLEAR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SINGLEFIFOCLEAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCANFIFOCLEAR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCANFIFOCLEAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t APORT1XMASTERDIS:1;
      uint64_t APORT1YMASTERDIS:1;
      uint64_t APORT2XMASTERDIS:1;
      uint64_t APORT2YMASTERDIS:1;
      uint64_t APORT3XMASTERDIS:1;
      uint64_t APORT3YMASTERDIS:1;
      uint64_t APORT4XMASTERDIS:1;
      uint64_t APORT4YMASTERDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APORTMASTERDIS;

};

#define ADC1 (*(volatile struct ADC1_tag *) 0x40082400)

struct ACMP0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:1;
      uint64_t INACTVAL:1;
      uint64_t GPIOINV:1;
      uint64_t reservedSpace1:4;
      uint64_t APORTXMASTERDIS:1;
      uint64_t APORTYMASTERDIS:1;
      uint64_t APORTVMASTERDIS:1;
      uint64_t reservedSpace2:1;
      uint64_t PWRSEL:3;
      uint64_t ACCURACY:1;
      uint64_t reservedSpace3:2;
      uint64_t INPUTRANGE:2;
      uint64_t IRISE:1;
      uint64_t IFALL:1;
      uint64_t reservedSpace4:2;
      uint64_t BIASPROG:6;
      uint64_t reservedSpace5:1;
      uint64_t FULLBIAS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t POSSEL:8;
      uint64_t NEGSEL:8;
      uint64_t VASEL:6;
      uint64_t VBSEL:1;
      uint64_t reservedSpace0:1;
      uint64_t VLPSEL:1;
      uint64_t reservedSpace1:1;
      uint64_t CSRESEN:1;
      uint64_t reservedSpace2:1;
      uint64_t CSRESSEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INPUTSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACMPACT:1;
      uint64_t ACMPOUT:1;
      uint64_t APORTCONFLICT:1;
      uint64_t EXTIFACT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EDGE:1;
      uint64_t WARMUP:1;
      uint64_t APORTCONFLICT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EDGE:1;
      uint64_t WARMUP:1;
      uint64_t APORTCONFLICT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EDGE:1;
      uint64_t WARMUP:1;
      uint64_t APORTCONFLICT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EDGE:1;
      uint64_t WARMUP:1;
      uint64_t APORTCONFLICT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IEN;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t APORT0XREQ:1;
      uint64_t APORT0YREQ:1;
      uint64_t APORT1XREQ:1;
      uint64_t APORT1YREQ:1;
      uint64_t APORT2XREQ:1;
      uint64_t APORT2YREQ:1;
      uint64_t APORT3XREQ:1;
      uint64_t APORT3YREQ:1;
      uint64_t APORT4XREQ:1;
      uint64_t APORT4YREQ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APORTREQ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t APORT0XCONFLICT:1;
      uint64_t APORT0YCONFLICT:1;
      uint64_t APORT1XCONFLICT:1;
      uint64_t APORT1YCONFLICT:1;
      uint64_t APORT2XCONFLICT:1;
      uint64_t APORT2YCONFLICT:1;
      uint64_t APORT3XCONFLICT:1;
      uint64_t APORT3YCONFLICT:1;
      uint64_t APORT4XCONFLICT:1;
      uint64_t APORT4YCONFLICT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APORTCONFLICT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HYST:4;
      uint64_t reservedSpace0:12;
      uint64_t DIVVA:6;
      uint64_t reservedSpace1:2;
      uint64_t DIVVB:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HYSTERESIS0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HYST:4;
      uint64_t reservedSpace0:12;
      uint64_t DIVVA:6;
      uint64_t reservedSpace1:2;
      uint64_t DIVVB:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HYSTERESIS1;

  uint8_t res1[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OUTPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ROUTEPEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OUTLOC:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ROUTELOC0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:3;
      uint64_t APORTSEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EXTIFCTRL;

