iSYSTEMLabs/winIDEAExampleWorkspaces/SiliconLabs/EFM32GG11/targetInit/efm32gg11_sfr.h
};

#define ACMP3 (*(volatile struct ACMP3_tag *) 0x40080c00)

struct VDAC0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIFF:1;
      uint64_t reservedSpace0:3;
      uint64_t SINEMODE:1;
      uint64_t OUTENPRS:1;
      uint64_t CH0PRESCRST:1;
      uint64_t reservedSpace1:1;
      uint64_t REFSEL:3;
      uint64_t reservedSpace2:5;
      uint64_t PRESC:7;
      uint64_t reservedSpace3:1;
      uint64_t REFRESHPERIOD:2;
      uint64_t reservedSpace4:2;
      uint64_t WARMUPMODE:1;
      uint64_t reservedSpace5:2;
      uint64_t DACCLKMODE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0ENS:1;
      uint64_t CH1ENS:1;
      uint64_t CH0BL:1;
      uint64_t CH1BL:1;
      uint64_t CH0WARM:1;
      uint64_t CH1WARM:1;
      uint64_t reservedSpace0:10;
      uint64_t OPA0APORTCONFLICT:1;
      uint64_t OPA1APORTCONFLICT:1;
      uint64_t OPA2APORTCONFLICT:1;
      uint64_t OPA3APORTCONFLICT:1;
      uint64_t OPA0ENS:1;
      uint64_t OPA1ENS:1;
      uint64_t OPA2ENS:1;
      uint64_t OPA3ENS:1;
      uint64_t OPA0WARM:1;
      uint64_t OPA1WARM:1;
      uint64_t OPA2WARM:1;
      uint64_t OPA3WARM:1;
      uint64_t OPA0OUTVALID:1;
      uint64_t OPA1OUTVALID:1;
      uint64_t OPA2OUTVALID:1;
      uint64_t OPA3OUTVALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONVMODE:1;
      uint64_t reservedSpace0:3;
      uint64_t TRIGMODE:3;
      uint64_t reservedSpace1:1;
      uint64_t PRSASYNC:1;
      uint64_t reservedSpace2:3;
      uint64_t PRSSEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH0CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONVMODE:1;
      uint64_t reservedSpace0:3;
      uint64_t TRIGMODE:3;
      uint64_t reservedSpace1:1;
      uint64_t PRSASYNC:1;
      uint64_t reservedSpace2:3;
      uint64_t PRSSEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH1CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0EN:1;
      uint64_t CH0DIS:1;
      uint64_t CH1EN:1;
      uint64_t CH1DIS:1;
      uint64_t reservedSpace0:12;
      uint64_t OPA0EN:1;
      uint64_t OPA0DIS:1;
      uint64_t OPA1EN:1;
      uint64_t OPA1DIS:1;
      uint64_t OPA2EN:1;
      uint64_t OPA2DIS:1;
      uint64_t OPA3EN:1;
      uint64_t OPA3DIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0CD:1;
      uint64_t CH1CD:1;
      uint64_t CH0OF:1;
      uint64_t CH1OF:1;
      uint64_t CH0UF:1;
      uint64_t CH1UF:1;
      uint64_t CH0BL:1;
      uint64_t CH1BL:1;
      uint64_t reservedSpace0:7;
      uint64_t EM23ERR:1;
      uint64_t OPA0APORTCONFLICT:1;
      uint64_t OPA1APORTCONFLICT:1;
      uint64_t OPA2APORTCONFLICT:1;
      uint64_t OPA3APORTCONFLICT:1;
      uint64_t OPA0PRSTIMEDERR:1;
      uint64_t OPA1PRSTIMEDERR:1;
      uint64_t OPA2PRSTIMEDERR:1;
      uint64_t OPA3PRSTIMEDERR:1;
      uint64_t reservedSpace1:4;
      uint64_t OPA0OUTVALID:1;
      uint64_t OPA1OUTVALID:1;
      uint64_t OPA2OUTVALID:1;
      uint64_t OPA3OUTVALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0CD:1;
      uint64_t CH1CD:1;
      uint64_t CH0OF:1;
      uint64_t CH1OF:1;
      uint64_t CH0UF:1;
      uint64_t CH1UF:1;
      uint64_t reservedSpace0:9;
      uint64_t EM23ERR:1;
      uint64_t OPA0APORTCONFLICT:1;
      uint64_t OPA1APORTCONFLICT:1;
      uint64_t OPA2APORTCONFLICT:1;
      uint64_t OPA3APORTCONFLICT:1;
      uint64_t OPA0PRSTIMEDERR:1;
      uint64_t OPA1PRSTIMEDERR:1;
      uint64_t OPA2PRSTIMEDERR:1;
      uint64_t OPA3PRSTIMEDERR:1;
      uint64_t reservedSpace1:4;
      uint64_t OPA0OUTVALID:1;
      uint64_t OPA1OUTVALID:1;
      uint64_t OPA2OUTVALID:1;
      uint64_t OPA3OUTVALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0CD:1;
      uint64_t CH1CD:1;
      uint64_t CH0OF:1;
      uint64_t CH1OF:1;
      uint64_t CH0UF:1;
      uint64_t CH1UF:1;
      uint64_t reservedSpace0:9;
      uint64_t EM23ERR:1;
      uint64_t OPA0APORTCONFLICT:1;
      uint64_t OPA1APORTCONFLICT:1;
      uint64_t OPA2APORTCONFLICT:1;
      uint64_t OPA3APORTCONFLICT:1;
      uint64_t OPA0PRSTIMEDERR:1;
      uint64_t OPA1PRSTIMEDERR:1;
      uint64_t OPA2PRSTIMEDERR:1;
      uint64_t OPA3PRSTIMEDERR:1;
      uint64_t reservedSpace1:4;
      uint64_t OPA0OUTVALID:1;
      uint64_t OPA1OUTVALID:1;
      uint64_t OPA2OUTVALID:1;
      uint64_t OPA3OUTVALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0CD:1;
      uint64_t CH1CD:1;
      uint64_t CH0OF:1;
      uint64_t CH1OF:1;
      uint64_t CH0UF:1;
      uint64_t CH1UF:1;
      uint64_t CH0BL:1;
      uint64_t CH1BL:1;
      uint64_t reservedSpace0:7;
      uint64_t EM23ERR:1;
      uint64_t OPA0APORTCONFLICT:1;
      uint64_t OPA1APORTCONFLICT:1;
      uint64_t OPA2APORTCONFLICT:1;
      uint64_t OPA3APORTCONFLICT:1;
      uint64_t OPA0PRSTIMEDERR:1;
      uint64_t OPA1PRSTIMEDERR:1;
      uint64_t OPA2PRSTIMEDERR:1;
      uint64_t OPA3PRSTIMEDERR:1;
      uint64_t reservedSpace1:4;
      uint64_t OPA0OUTVALID:1;
      uint64_t OPA1OUTVALID:1;
      uint64_t OPA2OUTVALID:1;
      uint64_t OPA3OUTVALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH0DATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH1DATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0DATA:12;
      uint64_t reservedSpace0:4;
      uint64_t CH1DATA:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COMBDATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OFFSETTRIM:3;
      uint64_t reservedSpace0:5;
      uint64_t GAINERRTRIM:6;
      uint64_t reservedSpace1:2;
      uint64_t GAINERRTRIMCH1:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAL;

  uint8_t res0[108];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t APORT1XREQ:1;
      uint64_t APORT1YREQ:1;
      uint64_t APORT2XREQ:1;
      uint64_t APORT2YREQ:1;
      uint64_t APORT3XREQ:1;
      uint64_t APORT3YREQ:1;
      uint64_t APORT4XREQ:1;
      uint64_t APORT4YREQ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPA0_APORTREQ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t APORT1XCONFLICT:1;
      uint64_t APORT1YCONFLICT:1;
      uint64_t APORT2XCONFLICT:1;
      uint64_t APORT2YCONFLICT:1;
      uint64_t APORT3XCONFLICT:1;
      uint64_t APORT3YCONFLICT:1;
      uint64_t APORT4XCONFLICT:1;
      uint64_t APORT4YCONFLICT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPA0_APORTCONFLICT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DRIVESTRENGTH:2;
      uint64_t INCBW:1;
      uint64_t HCMDIS:1;
      uint64_t OUTSCALE:1;
      uint64_t reservedSpace0:3;
      uint64_t PRSEN:1;
      uint64_t PRSMODE:1;
      uint64_t PRSSEL:5;
      uint64_t reservedSpace1:1;
      uint64_t PRSOUTMODE:1;
      uint64_t reservedSpace2:3;
      uint64_t APORTXMASTERDIS:1;
      uint64_t APORTYMASTERDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPA0_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STARTUPDLY:6;
      uint64_t reservedSpace0:2;
      uint64_t WARMUPTIME:7;
      uint64_t reservedSpace1:1;
      uint64_t SETTLETIME:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPA0_TIMER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t POSSEL:8;
      uint64_t NEGSEL:8;
      uint64_t RESINMUX:3;
      uint64_t reservedSpace0:1;
      uint64_t GAIN3X:1;
      uint64_t reservedSpace1:3;
      uint64_t RESSEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPA0_MUX;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAINOUTEN:1;
      uint64_t ALTOUTEN:1;
      uint64_t APORTOUTEN:1;
      uint64_t SHORT:1;
      uint64_t ALTOUTPADEN:5;
      uint64_t reservedSpace0:7;
      uint64_t APORTOUTSEL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPA0_OUT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CM1:4;
      uint64_t reservedSpace0:1;
      uint64_t CM2:4;
      uint64_t reservedSpace1:1;
      uint64_t CM3:2;
      uint64_t reservedSpace2:1;
      uint64_t GM:3;
      uint64_t reservedSpace3:1;
      uint64_t GM3:2;
      uint64_t reservedSpace4:1;
      uint64_t OFFSETP:5;
      uint64_t reservedSpace5:1;
      uint64_t OFFSETN:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPA0_CAL;

