iSYSTEMLabs/winIDEAExampleWorkspaces/SiliconLabs/EFM32GG11/targetInit/efm32gg11_sfr.h
  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t APORT1XREQ:1;
      uint64_t APORT1YREQ:1;
      uint64_t APORT2XREQ:1;
      uint64_t APORT2YREQ:1;
      uint64_t APORT3XREQ:1;
      uint64_t APORT3YREQ:1;
      uint64_t APORT4XREQ:1;
      uint64_t APORT4YREQ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPA1_APORTREQ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t APORT1XCONFLICT:1;
      uint64_t APORT1YCONFLICT:1;
      uint64_t APORT2XCONFLICT:1;
      uint64_t APORT2YCONFLICT:1;
      uint64_t APORT3XCONFLICT:1;
      uint64_t APORT3YCONFLICT:1;
      uint64_t APORT4XCONFLICT:1;
      uint64_t APORT4YCONFLICT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPA1_APORTCONFLICT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DRIVESTRENGTH:2;
      uint64_t INCBW:1;
      uint64_t HCMDIS:1;
      uint64_t OUTSCALE:1;
      uint64_t reservedSpace0:3;
      uint64_t PRSEN:1;
      uint64_t PRSMODE:1;
      uint64_t PRSSEL:5;
      uint64_t reservedSpace1:1;
      uint64_t PRSOUTMODE:1;
      uint64_t reservedSpace2:3;
      uint64_t APORTXMASTERDIS:1;
      uint64_t APORTYMASTERDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPA1_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STARTUPDLY:6;
      uint64_t reservedSpace0:2;
      uint64_t WARMUPTIME:7;
      uint64_t reservedSpace1:1;
      uint64_t SETTLETIME:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPA1_TIMER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t POSSEL:8;
      uint64_t NEGSEL:8;
      uint64_t RESINMUX:3;
      uint64_t reservedSpace0:1;
      uint64_t GAIN3X:1;
      uint64_t reservedSpace1:3;
      uint64_t RESSEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPA1_MUX;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAINOUTEN:1;
      uint64_t ALTOUTEN:1;
      uint64_t APORTOUTEN:1;
      uint64_t SHORT:1;
      uint64_t ALTOUTPADEN:5;
      uint64_t reservedSpace0:7;
      uint64_t APORTOUTSEL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPA1_OUT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CM1:4;
      uint64_t reservedSpace0:1;
      uint64_t CM2:4;
      uint64_t reservedSpace1:1;
      uint64_t CM3:2;
      uint64_t reservedSpace2:1;
      uint64_t GM:3;
      uint64_t reservedSpace3:1;
      uint64_t GM3:2;
      uint64_t reservedSpace4:1;
      uint64_t OFFSETP:5;
      uint64_t reservedSpace5:1;
      uint64_t OFFSETN:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPA1_CAL;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t APORT1XREQ:1;
      uint64_t APORT1YREQ:1;
      uint64_t APORT2XREQ:1;
      uint64_t APORT2YREQ:1;
      uint64_t APORT3XREQ:1;
      uint64_t APORT3YREQ:1;
      uint64_t APORT4XREQ:1;
      uint64_t APORT4YREQ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPA2_APORTREQ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t APORT1XCONFLICT:1;
      uint64_t APORT1YCONFLICT:1;
      uint64_t APORT2XCONFLICT:1;
      uint64_t APORT2YCONFLICT:1;
      uint64_t APORT3XCONFLICT:1;
      uint64_t APORT3YCONFLICT:1;
      uint64_t APORT4XCONFLICT:1;
      uint64_t APORT4YCONFLICT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPA2_APORTCONFLICT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DRIVESTRENGTH:2;
      uint64_t INCBW:1;
      uint64_t HCMDIS:1;
      uint64_t OUTSCALE:1;
      uint64_t reservedSpace0:3;
      uint64_t PRSEN:1;
      uint64_t PRSMODE:1;
      uint64_t PRSSEL:5;
      uint64_t reservedSpace1:1;
      uint64_t PRSOUTMODE:1;
      uint64_t reservedSpace2:3;
      uint64_t APORTXMASTERDIS:1;
      uint64_t APORTYMASTERDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPA2_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STARTUPDLY:6;
      uint64_t reservedSpace0:2;
      uint64_t WARMUPTIME:7;
      uint64_t reservedSpace1:1;
      uint64_t SETTLETIME:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPA2_TIMER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t POSSEL:8;
      uint64_t NEGSEL:8;
      uint64_t RESINMUX:3;
      uint64_t reservedSpace0:1;
      uint64_t GAIN3X:1;
      uint64_t reservedSpace1:3;
      uint64_t RESSEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPA2_MUX;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAINOUTEN:1;
      uint64_t ALTOUTEN:1;
      uint64_t APORTOUTEN:1;
      uint64_t SHORT:1;
      uint64_t ALTOUTPADEN:5;
      uint64_t reservedSpace0:7;
      uint64_t APORTOUTSEL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPA2_OUT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CM1:4;
      uint64_t reservedSpace0:1;
      uint64_t CM2:4;
      uint64_t reservedSpace1:1;
      uint64_t CM3:2;
      uint64_t reservedSpace2:1;
      uint64_t GM:3;
      uint64_t reservedSpace3:1;
      uint64_t GM3:2;
      uint64_t reservedSpace4:1;
      uint64_t OFFSETP:5;
      uint64_t reservedSpace5:1;
      uint64_t OFFSETN:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPA2_CAL;

  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t APORT1XREQ:1;
      uint64_t APORT1YREQ:1;
      uint64_t APORT2XREQ:1;
      uint64_t APORT2YREQ:1;
      uint64_t APORT3XREQ:1;
      uint64_t APORT3YREQ:1;
      uint64_t APORT4XREQ:1;
      uint64_t APORT4YREQ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPA3_APORTREQ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t APORT1XCONFLICT:1;
      uint64_t APORT1YCONFLICT:1;
      uint64_t APORT2XCONFLICT:1;
      uint64_t APORT2YCONFLICT:1;
      uint64_t APORT3XCONFLICT:1;
      uint64_t APORT3YCONFLICT:1;
      uint64_t APORT4XCONFLICT:1;
      uint64_t APORT4YCONFLICT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPA3_APORTCONFLICT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DRIVESTRENGTH:2;
      uint64_t INCBW:1;
      uint64_t HCMDIS:1;
      uint64_t OUTSCALE:1;
      uint64_t reservedSpace0:3;
      uint64_t PRSEN:1;
      uint64_t PRSMODE:1;
      uint64_t PRSSEL:5;
      uint64_t reservedSpace1:1;
      uint64_t PRSOUTMODE:1;
      uint64_t reservedSpace2:3;
      uint64_t APORTXMASTERDIS:1;
      uint64_t APORTYMASTERDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPA3_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STARTUPDLY:6;
      uint64_t reservedSpace0:2;
      uint64_t WARMUPTIME:7;
      uint64_t reservedSpace1:1;
      uint64_t SETTLETIME:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPA3_TIMER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t POSSEL:8;
      uint64_t NEGSEL:8;
      uint64_t RESINMUX:3;
      uint64_t reservedSpace0:1;
      uint64_t GAIN3X:1;
      uint64_t reservedSpace1:3;
      uint64_t RESSEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPA3_MUX;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAINOUTEN:1;
      uint64_t ALTOUTEN:1;
      uint64_t APORTOUTEN:1;
      uint64_t SHORT:1;
      uint64_t ALTOUTPADEN:5;
      uint64_t reservedSpace0:7;
      uint64_t APORTOUTSEL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPA3_OUT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CM1:4;
      uint64_t reservedSpace0:1;
      uint64_t CM2:4;
      uint64_t reservedSpace1:1;
      uint64_t CM3:2;
      uint64_t reservedSpace2:1;
      uint64_t GM:3;
      uint64_t reservedSpace3:1;
      uint64_t GM3:2;
      uint64_t reservedSpace4:1;
      uint64_t OFFSETP:5;
      uint64_t reservedSpace5:1;
      uint64_t OFFSETN:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPA3_CAL;

