iSYSTEMLabs/winIDEAExampleWorkspaces/SiliconLabs/EFM32GG11/targetInit/efm32gg11_sfr.h
};

#define VDAC0 (*(volatile struct VDAC0_tag *) 0x40086000)

struct USB_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t VBUSENAP:1;
      uint64_t reservedSpace0:2;
      uint64_t SELFPOWERED:1;
      uint64_t LEMOSCCTRL:2;
      uint64_t reservedSpace1:1;
      uint64_t LEMPHYCTRL:1;
      uint64_t reservedSpace2:1;
      uint64_t LEMIDLEEN:1;
      uint64_t reservedSpace3:2;
      uint64_t IDCDEN:1;
      uint64_t reservedSpace4:12;
      uint64_t OTGCLKCDIS:1;
      uint64_t OTGIDINDIS:1;
      uint64_t OTGPHYCTRLDIS:1;
      uint64_t DCDEN:2;
      uint64_t PDEN:1;
      uint64_t SDEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VBUSDETH:1;
      uint64_t reservedSpace0:1;
      uint64_t LEMACTIVE:1;
      uint64_t reservedSpace1:5;
      uint64_t DCDTO:1;
      uint64_t SDP:1;
      uint64_t CDP:1;
      uint64_t DCP:1;
      uint64_t ACAFS:1;
      uint64_t ACALS:1;
      uint64_t reservedSpace2:1;
      uint64_t USBCDBUSY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VBUSDETH:1;
      uint64_t VBUSDETL:1;
      uint64_t reservedSpace0:6;
      uint64_t ERR:1;
      uint64_t DCD:1;
      uint64_t PD:1;
      uint64_t SD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VBUSDETH:1;
      uint64_t VBUSDETL:1;
      uint64_t reservedSpace0:6;
      uint64_t ERR:1;
      uint64_t DCD:1;
      uint64_t PD:1;
      uint64_t SD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VBUSDETH:1;
      uint64_t VBUSDETL:1;
      uint64_t reservedSpace0:6;
      uint64_t ERR:1;
      uint64_t DCD:1;
      uint64_t PD:1;
      uint64_t SD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VBUSDETH:1;
      uint64_t VBUSDETL:1;
      uint64_t reservedSpace0:6;
      uint64_t ERR:1;
      uint64_t DCD:1;
      uint64_t PD:1;
      uint64_t SD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PHYPEN:1;
      uint64_t VBUSENPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ROUTE;

  uint8_t res0[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCDTOCONF:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CDCONF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STARTCD:1;
      uint64_t STOPCD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMD;

  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMEBASE:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LEMCTRL;

  uint8_t res2[909248];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SESREQSCS:1;
      uint64_t SESREQ:1;
      uint64_t VBVALIDOVEN:1;
      uint64_t VBVALIDOVVAL:1;
      uint64_t AVALIDOVEN:1;
      uint64_t AVALIDOVVAL:1;
      uint64_t BVALIDOVEN:1;
      uint64_t BVALIDOVVAL:1;
      uint64_t HSTNEGSCS:1;
      uint64_t HNPREQ:1;
      uint64_t HSTSETHNPEN:1;
      uint64_t DEVHNPEN:1;
      uint64_t EHEN:1;
      uint64_t reservedSpace0:2;
      uint64_t DBNCEFLTRBYPASS:1;
      uint64_t CONIDSTS:1;
      uint64_t DBNCTIME:1;
      uint64_t ASESVLD:1;
      uint64_t BSESVLD:1;
      uint64_t OTGVER:1;
      uint64_t CURMOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GOTGCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t SESENDDET:1;
      uint64_t reservedSpace1:5;
      uint64_t SESREQSUCSTSCHNG:1;
      uint64_t HSTNEGSUCSTSCHNG:1;
      uint64_t reservedSpace2:7;
      uint64_t HSTNEGDET:1;
      uint64_t ADEVTOUTCHG:1;
      uint64_t DBNCEDONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GOTGINT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GLBLINTRMSK:1;
      uint64_t HBSTLEN:4;
      uint64_t DMAEN:1;
      uint64_t reservedSpace0:1;
      uint64_t NPTXFEMPLVL:1;
      uint64_t PTXFEMPLVL:1;
      uint64_t reservedSpace1:12;
      uint64_t REMMEMSUPP:1;
      uint64_t NOTIALLDMAWRIT:1;
      uint64_t AHBSINGLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GAHBCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TOUTCAL:3;
      uint64_t PHYIF:1;
      uint64_t reservedSpace0:1;
      uint64_t FSINTF:1;
      uint64_t reservedSpace1:2;
      uint64_t SRPCAP:1;
      uint64_t HNPCAP:1;
      uint64_t USBTRDTIM:4;
      uint64_t reservedSpace2:8;
      uint64_t TERMSELDLPULSE:1;
      uint64_t reservedSpace3:5;
      uint64_t TXENDDELAY:1;
      uint64_t FORCEHSTMODE:1;
      uint64_t FORCEDEVMODE:1;
      uint64_t CORRUPTTXPKT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GUSBCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSFTRST:1;
      uint64_t PIUFSSFTRST:1;
      uint64_t FRMCNTRRST:1;
      uint64_t reservedSpace0:1;
      uint64_t RXFFLSH:1;
      uint64_t TXFFLSH:1;
      uint64_t TXFNUM:5;
      uint64_t reservedSpace1:19;
      uint64_t DMAREQ:1;
      uint64_t AHBIDLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GRSTCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CURMOD:1;
      uint64_t MODEMIS:1;
      uint64_t OTGINT:1;
      uint64_t SOF:1;
      uint64_t RXFLVL:1;
      uint64_t NPTXFEMP:1;
      uint64_t GINNAKEFF:1;
      uint64_t GOUTNAKEFF:1;
      uint64_t reservedSpace0:2;
      uint64_t ERLYSUSP:1;
      uint64_t USBSUSP:1;
      uint64_t USBRST:1;
      uint64_t ENUMDONE:1;
      uint64_t ISOOUTDROP:1;
      uint64_t EOPF:1;
      uint64_t reservedSpace1:2;
      uint64_t IEPINT:1;
      uint64_t OEPINT:1;
      uint64_t INCOMPISOIN:1;
      uint64_t INCOMPLP:1;
      uint64_t FETSUSP:1;
      uint64_t RESETDET:1;
      uint64_t PRTINT:1;
      uint64_t HCHINT:1;
      uint64_t PTXFEMP:1;
      uint64_t reservedSpace2:1;
      uint64_t CONIDSTSCHNG:1;
      uint64_t DISCONNINT:1;
      uint64_t SESSREQINT:1;
      uint64_t WKUPINT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GINTSTS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t MODEMISMSK:1;
      uint64_t OTGINTMSK:1;
      uint64_t SOFMSK:1;
      uint64_t RXFLVLMSK:1;
      uint64_t NPTXFEMPMSK:1;
      uint64_t GINNAKEFFMSK:1;
      uint64_t GOUTNAKEFFMSK:1;
      uint64_t reservedSpace1:2;
      uint64_t ERLYSUSPMSK:1;
      uint64_t USBSUSPMSK:1;
      uint64_t USBRSTMSK:1;
      uint64_t ENUMDONEMSK:1;
      uint64_t ISOOUTDROPMSK:1;
      uint64_t EOPFMSK:1;
      uint64_t reservedSpace2:1;
      uint64_t EPMISMSK:1;
      uint64_t IEPINTMSK:1;
      uint64_t OEPINTMSK:1;
      uint64_t INCOMPISOINMSK:1;
      uint64_t INCOMPLPMSK:1;
      uint64_t FETSUSPMSK:1;
      uint64_t RESETDETMSK:1;
      uint64_t PRTINTMSK:1;
      uint64_t HCHINTMSK:1;
      uint64_t PTXFEMPMSK:1;
      uint64_t reservedSpace3:1;
      uint64_t CONIDSTSCHNGMSK:1;
      uint64_t DISCONNINTMSK:1;
      uint64_t SESSREQINTMSK:1;
      uint64_t WKUPINTMSK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GINTMSK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHNUM:4;
      uint64_t BCNT:11;
      uint64_t DPID:2;
      uint64_t PKTSTS:4;
      uint64_t FN:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GRXSTSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHNUM:4;
      uint64_t BCNT:11;
      uint64_t DPID:2;
      uint64_t PKTSTS:4;
      uint64_t FN:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GRXSTSP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXFDEP:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GRXFSIZ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NPTXFSTADDR:16;
      uint64_t NPTXFDEP:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GNPTXFSIZ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NPTXFSPCAVAIL:16;
      uint64_t NPTXQSPCAVAIL:8;
      uint64_t NPTXQTOP:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GNPTXSTS;

  uint8_t res3[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYNOPSYSID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GSNPSID;

  uint8_t res4[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GDFIFOCFG:16;
      uint64_t EPINFOBASEADDR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GDFIFOCFG;

  uint8_t res5[160];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PTXFSTADDR:11;
      uint64_t reservedSpace0:5;
      uint64_t PTXFSIZE:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HPTXFSIZ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INEPNTXFSTADDR:11;
      uint64_t reservedSpace0:5;
      uint64_t INEPNTXFDEP:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEPTXF1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INEPNTXFSTADDR:11;
      uint64_t reservedSpace0:5;
      uint64_t INEPNTXFDEP:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEPTXF2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INEPNTXFSTADDR:12;
      uint64_t reservedSpace0:4;
      uint64_t INEPNTXFDEP:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEPTXF3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INEPNTXFSTADDR:12;
      uint64_t reservedSpace0:4;
      uint64_t INEPNTXFDEP:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEPTXF4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INEPNTXFSTADDR:12;
      uint64_t reservedSpace0:4;
      uint64_t INEPNTXFDEP:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEPTXF5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INEPNTXFSTADDR:12;
      uint64_t reservedSpace0:4;
      uint64_t INEPNTXFDEP:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEPTXF6;

