iSYSTEMLabs/winIDEAExampleWorkspaces/SiliconLabs/EFM32GG11/targetInit/efm32gg11_sfr.h
  uint8_t res6[740];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSLSPCLKSEL:2;
      uint64_t FSLSSUPP:1;
      uint64_t reservedSpace0:4;
      uint64_t ENA32KHZS:1;
      uint64_t RESVALID:8;
      uint64_t reservedSpace1:15;
      uint64_t MODECHTIMEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRINT:16;
      uint64_t HFIRRLDCTRL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HFIR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRNUM:16;
      uint64_t FRREM:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HFNUM;

  uint8_t res7[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PTXFSPCAVAIL:16;
      uint64_t PTXQSPCAVAIL:8;
      uint64_t PTXQTOP:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HPTXSTS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HAINT:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HAINT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HAINTMSK:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HAINTMSK;

  uint8_t res8[36];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRTCONNSTS:1;
      uint64_t PRTCONNDET:1;
      uint64_t PRTENA:1;
      uint64_t PRTENCHNG:1;
      uint64_t PRTOVRCURRACT:1;
      uint64_t PRTOVRCURRCHNG:1;
      uint64_t PRTRES:1;
      uint64_t PRTSUSP:1;
      uint64_t PRTRST:1;
      uint64_t reservedSpace0:1;
      uint64_t PRTLNSTS:2;
      uint64_t PRTPWR:1;
      uint64_t PRTTSTCTL:4;
      uint64_t PRTSPD:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HPRT;

  uint8_t res9[188];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPS:11;
      uint64_t EPNUM:4;
      uint64_t EPDIR:1;
      uint64_t reservedSpace0:1;
      uint64_t LSPDDEV:1;
      uint64_t EPTYPE:2;
      uint64_t MC:2;
      uint64_t DEVADDR:7;
      uint64_t ODDFRM:1;
      uint64_t CHDIS:1;
      uint64_t CHENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC0_CHAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRTADDR:7;
      uint64_t HUBADDR:7;
      uint64_t XACTPOS:2;
      uint64_t COMPSPLT:1;
      uint64_t reservedSpace0:14;
      uint64_t SPLTENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC0_SPLT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFERCOMPL:1;
      uint64_t CHHLTD:1;
      uint64_t AHBERR:1;
      uint64_t STALL:1;
      uint64_t NAK:1;
      uint64_t ACK:1;
      uint64_t reservedSpace0:1;
      uint64_t XACTERR:1;
      uint64_t BBLERR:1;
      uint64_t FRMOVRUN:1;
      uint64_t DATATGLERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC0_INT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFERCOMPLMSK:1;
      uint64_t CHHLTDMSK:1;
      uint64_t AHBERRMSK:1;
      uint64_t STALLMSK:1;
      uint64_t NAKMSK:1;
      uint64_t ACKMSK:1;
      uint64_t reservedSpace0:1;
      uint64_t XACTERRMSK:1;
      uint64_t BBLERRMSK:1;
      uint64_t FRMOVRUNMSK:1;
      uint64_t DATATGLERRMSK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC0_INTMSK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFERSIZE:19;
      uint64_t PKTCNT:10;
      uint64_t PID:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC0_TSIZ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC0_DMAADDR;

  uint8_t res10[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPS:11;
      uint64_t EPNUM:4;
      uint64_t EPDIR:1;
      uint64_t reservedSpace0:1;
      uint64_t LSPDDEV:1;
      uint64_t EPTYPE:2;
      uint64_t MC:2;
      uint64_t DEVADDR:7;
      uint64_t ODDFRM:1;
      uint64_t CHDIS:1;
      uint64_t CHENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC1_CHAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRTADDR:7;
      uint64_t HUBADDR:7;
      uint64_t XACTPOS:2;
      uint64_t COMPSPLT:1;
      uint64_t reservedSpace0:14;
      uint64_t SPLTENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC1_SPLT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFERCOMPL:1;
      uint64_t CHHLTD:1;
      uint64_t AHBERR:1;
      uint64_t STALL:1;
      uint64_t NAK:1;
      uint64_t ACK:1;
      uint64_t reservedSpace0:1;
      uint64_t XACTERR:1;
      uint64_t BBLERR:1;
      uint64_t FRMOVRUN:1;
      uint64_t DATATGLERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC1_INT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFERCOMPLMSK:1;
      uint64_t CHHLTDMSK:1;
      uint64_t AHBERRMSK:1;
      uint64_t STALLMSK:1;
      uint64_t NAKMSK:1;
      uint64_t ACKMSK:1;
      uint64_t reservedSpace0:1;
      uint64_t XACTERRMSK:1;
      uint64_t BBLERRMSK:1;
      uint64_t FRMOVRUNMSK:1;
      uint64_t DATATGLERRMSK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC1_INTMSK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFERSIZE:19;
      uint64_t PKTCNT:10;
      uint64_t PID:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC1_TSIZ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC1_DMAADDR;

  uint8_t res11[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPS:11;
      uint64_t EPNUM:4;
      uint64_t EPDIR:1;
      uint64_t reservedSpace0:1;
      uint64_t LSPDDEV:1;
      uint64_t EPTYPE:2;
      uint64_t MC:2;
      uint64_t DEVADDR:7;
      uint64_t ODDFRM:1;
      uint64_t CHDIS:1;
      uint64_t CHENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC2_CHAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRTADDR:7;
      uint64_t HUBADDR:7;
      uint64_t XACTPOS:2;
      uint64_t COMPSPLT:1;
      uint64_t reservedSpace0:14;
      uint64_t SPLTENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC2_SPLT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFERCOMPL:1;
      uint64_t CHHLTD:1;
      uint64_t AHBERR:1;
      uint64_t STALL:1;
      uint64_t NAK:1;
      uint64_t ACK:1;
      uint64_t reservedSpace0:1;
      uint64_t XACTERR:1;
      uint64_t BBLERR:1;
      uint64_t FRMOVRUN:1;
      uint64_t DATATGLERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC2_INT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFERCOMPLMSK:1;
      uint64_t CHHLTDMSK:1;
      uint64_t AHBERRMSK:1;
      uint64_t STALLMSK:1;
      uint64_t NAKMSK:1;
      uint64_t ACKMSK:1;
      uint64_t reservedSpace0:1;
      uint64_t XACTERRMSK:1;
      uint64_t BBLERRMSK:1;
      uint64_t FRMOVRUNMSK:1;
      uint64_t DATATGLERRMSK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC2_INTMSK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFERSIZE:19;
      uint64_t PKTCNT:10;
      uint64_t PID:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC2_TSIZ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC2_DMAADDR;

  uint8_t res12[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPS:11;
      uint64_t EPNUM:4;
      uint64_t EPDIR:1;
      uint64_t reservedSpace0:1;
      uint64_t LSPDDEV:1;
      uint64_t EPTYPE:2;
      uint64_t MC:2;
      uint64_t DEVADDR:7;
      uint64_t ODDFRM:1;
      uint64_t CHDIS:1;
      uint64_t CHENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC3_CHAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRTADDR:7;
      uint64_t HUBADDR:7;
      uint64_t XACTPOS:2;
      uint64_t COMPSPLT:1;
      uint64_t reservedSpace0:14;
      uint64_t SPLTENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC3_SPLT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFERCOMPL:1;
      uint64_t CHHLTD:1;
      uint64_t AHBERR:1;
      uint64_t STALL:1;
      uint64_t NAK:1;
      uint64_t ACK:1;
      uint64_t reservedSpace0:1;
      uint64_t XACTERR:1;
      uint64_t BBLERR:1;
      uint64_t FRMOVRUN:1;
      uint64_t DATATGLERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC3_INT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFERCOMPLMSK:1;
      uint64_t CHHLTDMSK:1;
      uint64_t AHBERRMSK:1;
      uint64_t STALLMSK:1;
      uint64_t NAKMSK:1;
      uint64_t ACKMSK:1;
      uint64_t reservedSpace0:1;
      uint64_t XACTERRMSK:1;
      uint64_t BBLERRMSK:1;
      uint64_t FRMOVRUNMSK:1;
      uint64_t DATATGLERRMSK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC3_INTMSK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFERSIZE:19;
      uint64_t PKTCNT:10;
      uint64_t PID:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC3_TSIZ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC3_DMAADDR;

  uint8_t res13[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPS:11;
      uint64_t EPNUM:4;
      uint64_t EPDIR:1;
      uint64_t reservedSpace0:1;
      uint64_t LSPDDEV:1;
      uint64_t EPTYPE:2;
      uint64_t MC:2;
      uint64_t DEVADDR:7;
      uint64_t ODDFRM:1;
      uint64_t CHDIS:1;
      uint64_t CHENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC4_CHAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRTADDR:7;
      uint64_t HUBADDR:7;
      uint64_t XACTPOS:2;
      uint64_t COMPSPLT:1;
      uint64_t reservedSpace0:14;
      uint64_t SPLTENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC4_SPLT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFERCOMPL:1;
      uint64_t CHHLTD:1;
      uint64_t AHBERR:1;
      uint64_t STALL:1;
      uint64_t NAK:1;
      uint64_t ACK:1;
      uint64_t reservedSpace0:1;
      uint64_t XACTERR:1;
      uint64_t BBLERR:1;
      uint64_t FRMOVRUN:1;
      uint64_t DATATGLERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC4_INT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFERCOMPLMSK:1;
      uint64_t CHHLTDMSK:1;
      uint64_t AHBERRMSK:1;
      uint64_t STALLMSK:1;
      uint64_t NAKMSK:1;
      uint64_t ACKMSK:1;
      uint64_t reservedSpace0:1;
      uint64_t XACTERRMSK:1;
      uint64_t BBLERRMSK:1;
      uint64_t FRMOVRUNMSK:1;
      uint64_t DATATGLERRMSK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC4_INTMSK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFERSIZE:19;
      uint64_t PKTCNT:10;
      uint64_t PID:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC4_TSIZ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC4_DMAADDR;

  uint8_t res14[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPS:11;
      uint64_t EPNUM:4;
      uint64_t EPDIR:1;
      uint64_t reservedSpace0:1;
      uint64_t LSPDDEV:1;
      uint64_t EPTYPE:2;
      uint64_t MC:2;
      uint64_t DEVADDR:7;
      uint64_t ODDFRM:1;
      uint64_t CHDIS:1;
      uint64_t CHENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC5_CHAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRTADDR:7;
      uint64_t HUBADDR:7;
      uint64_t XACTPOS:2;
      uint64_t COMPSPLT:1;
      uint64_t reservedSpace0:14;
      uint64_t SPLTENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC5_SPLT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFERCOMPL:1;
      uint64_t CHHLTD:1;
      uint64_t AHBERR:1;
      uint64_t STALL:1;
      uint64_t NAK:1;
      uint64_t ACK:1;
      uint64_t reservedSpace0:1;
      uint64_t XACTERR:1;
      uint64_t BBLERR:1;
      uint64_t FRMOVRUN:1;
      uint64_t DATATGLERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC5_INT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFERCOMPLMSK:1;
      uint64_t CHHLTDMSK:1;
      uint64_t AHBERRMSK:1;
      uint64_t STALLMSK:1;
      uint64_t NAKMSK:1;
      uint64_t ACKMSK:1;
      uint64_t reservedSpace0:1;
      uint64_t XACTERRMSK:1;
      uint64_t BBLERRMSK:1;
      uint64_t FRMOVRUNMSK:1;
      uint64_t DATATGLERRMSK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC5_INTMSK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFERSIZE:19;
      uint64_t PKTCNT:10;
      uint64_t PID:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC5_TSIZ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC5_DMAADDR;

  uint8_t res15[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPS:11;
      uint64_t EPNUM:4;
      uint64_t EPDIR:1;
      uint64_t reservedSpace0:1;
      uint64_t LSPDDEV:1;
      uint64_t EPTYPE:2;
      uint64_t MC:2;
      uint64_t DEVADDR:7;
      uint64_t ODDFRM:1;
      uint64_t CHDIS:1;
      uint64_t CHENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC6_CHAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRTADDR:7;
      uint64_t HUBADDR:7;
      uint64_t XACTPOS:2;
      uint64_t COMPSPLT:1;
      uint64_t reservedSpace0:14;
      uint64_t SPLTENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC6_SPLT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFERCOMPL:1;
      uint64_t CHHLTD:1;
      uint64_t AHBERR:1;
      uint64_t STALL:1;
      uint64_t NAK:1;
      uint64_t ACK:1;
      uint64_t reservedSpace0:1;
      uint64_t XACTERR:1;
      uint64_t BBLERR:1;
      uint64_t FRMOVRUN:1;
      uint64_t DATATGLERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC6_INT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFERCOMPLMSK:1;
      uint64_t CHHLTDMSK:1;
      uint64_t AHBERRMSK:1;
      uint64_t STALLMSK:1;
      uint64_t NAKMSK:1;
      uint64_t ACKMSK:1;
      uint64_t reservedSpace0:1;
      uint64_t XACTERRMSK:1;
      uint64_t BBLERRMSK:1;
      uint64_t FRMOVRUNMSK:1;
      uint64_t DATATGLERRMSK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC6_INTMSK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFERSIZE:19;
      uint64_t PKTCNT:10;
      uint64_t PID:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC6_TSIZ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC6_DMAADDR;

  uint8_t res16[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPS:11;
      uint64_t EPNUM:4;
      uint64_t EPDIR:1;
      uint64_t reservedSpace0:1;
      uint64_t LSPDDEV:1;
      uint64_t EPTYPE:2;
      uint64_t MC:2;
      uint64_t DEVADDR:7;
      uint64_t ODDFRM:1;
      uint64_t CHDIS:1;
      uint64_t CHENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC7_CHAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRTADDR:7;
      uint64_t HUBADDR:7;
      uint64_t XACTPOS:2;
      uint64_t COMPSPLT:1;
      uint64_t reservedSpace0:14;
      uint64_t SPLTENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC7_SPLT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFERCOMPL:1;
      uint64_t CHHLTD:1;
      uint64_t AHBERR:1;
      uint64_t STALL:1;
      uint64_t NAK:1;
      uint64_t ACK:1;
      uint64_t reservedSpace0:1;
      uint64_t XACTERR:1;
      uint64_t BBLERR:1;
      uint64_t FRMOVRUN:1;
      uint64_t DATATGLERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC7_INT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFERCOMPLMSK:1;
      uint64_t CHHLTDMSK:1;
      uint64_t AHBERRMSK:1;
      uint64_t STALLMSK:1;
      uint64_t NAKMSK:1;
      uint64_t ACKMSK:1;
      uint64_t reservedSpace0:1;
      uint64_t XACTERRMSK:1;
      uint64_t BBLERRMSK:1;
      uint64_t FRMOVRUNMSK:1;
      uint64_t DATATGLERRMSK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC7_INTMSK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFERSIZE:19;
      uint64_t PKTCNT:10;
      uint64_t PID:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC7_TSIZ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC7_DMAADDR;

  uint8_t res17[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPS:11;
      uint64_t EPNUM:4;
      uint64_t EPDIR:1;
      uint64_t reservedSpace0:1;
      uint64_t LSPDDEV:1;
      uint64_t EPTYPE:2;
      uint64_t MC:2;
      uint64_t DEVADDR:7;
      uint64_t ODDFRM:1;
      uint64_t CHDIS:1;
      uint64_t CHENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC8_CHAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRTADDR:7;
      uint64_t HUBADDR:7;
      uint64_t XACTPOS:2;
      uint64_t COMPSPLT:1;
      uint64_t reservedSpace0:14;
      uint64_t SPLTENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC8_SPLT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFERCOMPL:1;
      uint64_t CHHLTD:1;
      uint64_t AHBERR:1;
      uint64_t STALL:1;
      uint64_t NAK:1;
      uint64_t ACK:1;
      uint64_t reservedSpace0:1;
      uint64_t XACTERR:1;
      uint64_t BBLERR:1;
      uint64_t FRMOVRUN:1;
      uint64_t DATATGLERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC8_INT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFERCOMPLMSK:1;
      uint64_t CHHLTDMSK:1;
      uint64_t AHBERRMSK:1;
      uint64_t STALLMSK:1;
      uint64_t NAKMSK:1;
      uint64_t ACKMSK:1;
      uint64_t reservedSpace0:1;
      uint64_t XACTERRMSK:1;
      uint64_t BBLERRMSK:1;
      uint64_t FRMOVRUNMSK:1;
      uint64_t DATATGLERRMSK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC8_INTMSK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFERSIZE:19;
      uint64_t PKTCNT:10;
      uint64_t PID:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC8_TSIZ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC8_DMAADDR;

  uint8_t res18[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPS:11;
      uint64_t EPNUM:4;
      uint64_t EPDIR:1;
      uint64_t reservedSpace0:1;
      uint64_t LSPDDEV:1;
      uint64_t EPTYPE:2;
      uint64_t MC:2;
      uint64_t DEVADDR:7;
      uint64_t ODDFRM:1;
      uint64_t CHDIS:1;
      uint64_t CHENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC9_CHAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRTADDR:7;
      uint64_t HUBADDR:7;
      uint64_t XACTPOS:2;
      uint64_t COMPSPLT:1;
      uint64_t reservedSpace0:14;
      uint64_t SPLTENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC9_SPLT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFERCOMPL:1;
      uint64_t CHHLTD:1;
      uint64_t AHBERR:1;
      uint64_t STALL:1;
      uint64_t NAK:1;
      uint64_t ACK:1;
      uint64_t reservedSpace0:1;
      uint64_t XACTERR:1;
      uint64_t BBLERR:1;
      uint64_t FRMOVRUN:1;
      uint64_t DATATGLERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC9_INT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFERCOMPLMSK:1;
      uint64_t CHHLTDMSK:1;
      uint64_t AHBERRMSK:1;
      uint64_t STALLMSK:1;
      uint64_t NAKMSK:1;
      uint64_t ACKMSK:1;
      uint64_t reservedSpace0:1;
      uint64_t XACTERRMSK:1;
      uint64_t BBLERRMSK:1;
      uint64_t FRMOVRUNMSK:1;
      uint64_t DATATGLERRMSK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC9_INTMSK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFERSIZE:19;
      uint64_t PKTCNT:10;
      uint64_t PID:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC9_TSIZ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC9_DMAADDR;

  uint8_t res19[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPS:11;
      uint64_t EPNUM:4;
      uint64_t EPDIR:1;
      uint64_t reservedSpace0:1;
      uint64_t LSPDDEV:1;
      uint64_t EPTYPE:2;
      uint64_t MC:2;
      uint64_t DEVADDR:7;
      uint64_t ODDFRM:1;
      uint64_t CHDIS:1;
      uint64_t CHENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC10_CHAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRTADDR:7;
      uint64_t HUBADDR:7;
      uint64_t XACTPOS:2;
      uint64_t COMPSPLT:1;
      uint64_t reservedSpace0:14;
      uint64_t SPLTENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC10_SPLT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFERCOMPL:1;
      uint64_t CHHLTD:1;
      uint64_t AHBERR:1;
      uint64_t STALL:1;
      uint64_t NAK:1;
      uint64_t ACK:1;
      uint64_t reservedSpace0:1;
      uint64_t XACTERR:1;
      uint64_t BBLERR:1;
      uint64_t FRMOVRUN:1;
      uint64_t DATATGLERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC10_INT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFERCOMPLMSK:1;
      uint64_t CHHLTDMSK:1;
      uint64_t AHBERRMSK:1;
      uint64_t STALLMSK:1;
      uint64_t NAKMSK:1;
      uint64_t ACKMSK:1;
      uint64_t reservedSpace0:1;
      uint64_t XACTERRMSK:1;
      uint64_t BBLERRMSK:1;
      uint64_t FRMOVRUNMSK:1;
      uint64_t DATATGLERRMSK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC10_INTMSK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFERSIZE:19;
      uint64_t PKTCNT:10;
      uint64_t PID:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC10_TSIZ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC10_DMAADDR;

  uint8_t res20[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPS:11;
      uint64_t EPNUM:4;
      uint64_t EPDIR:1;
      uint64_t reservedSpace0:1;
      uint64_t LSPDDEV:1;
      uint64_t EPTYPE:2;
      uint64_t MC:2;
      uint64_t DEVADDR:7;
      uint64_t ODDFRM:1;
      uint64_t CHDIS:1;
      uint64_t CHENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC11_CHAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRTADDR:7;
      uint64_t HUBADDR:7;
      uint64_t XACTPOS:2;
      uint64_t COMPSPLT:1;
      uint64_t reservedSpace0:14;
      uint64_t SPLTENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC11_SPLT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFERCOMPL:1;
      uint64_t CHHLTD:1;
      uint64_t AHBERR:1;
      uint64_t STALL:1;
      uint64_t NAK:1;
      uint64_t ACK:1;
      uint64_t reservedSpace0:1;
      uint64_t XACTERR:1;
      uint64_t BBLERR:1;
      uint64_t FRMOVRUN:1;
      uint64_t DATATGLERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC11_INT;

