iSYSTEMLabs/winIDEAExampleWorkspaces/SiliconLabs/EFM32GG11/targetInit/efm32gg11_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFERCOMPLMSK:1;
      uint64_t CHHLTDMSK:1;
      uint64_t AHBERRMSK:1;
      uint64_t STALLMSK:1;
      uint64_t NAKMSK:1;
      uint64_t ACKMSK:1;
      uint64_t reservedSpace0:1;
      uint64_t XACTERRMSK:1;
      uint64_t BBLERRMSK:1;
      uint64_t FRMOVRUNMSK:1;
      uint64_t DATATGLERRMSK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC11_INTMSK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFERSIZE:19;
      uint64_t PKTCNT:10;
      uint64_t PID:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC11_TSIZ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC11_DMAADDR;

  uint8_t res21[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPS:11;
      uint64_t EPNUM:4;
      uint64_t EPDIR:1;
      uint64_t reservedSpace0:1;
      uint64_t LSPDDEV:1;
      uint64_t EPTYPE:2;
      uint64_t MC:2;
      uint64_t DEVADDR:7;
      uint64_t ODDFRM:1;
      uint64_t CHDIS:1;
      uint64_t CHENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC12_CHAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRTADDR:7;
      uint64_t HUBADDR:7;
      uint64_t XACTPOS:2;
      uint64_t COMPSPLT:1;
      uint64_t reservedSpace0:14;
      uint64_t SPLTENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC12_SPLT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFERCOMPL:1;
      uint64_t CHHLTD:1;
      uint64_t AHBERR:1;
      uint64_t STALL:1;
      uint64_t NAK:1;
      uint64_t ACK:1;
      uint64_t reservedSpace0:1;
      uint64_t XACTERR:1;
      uint64_t BBLERR:1;
      uint64_t FRMOVRUN:1;
      uint64_t DATATGLERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC12_INT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFERCOMPLMSK:1;
      uint64_t CHHLTDMSK:1;
      uint64_t AHBERRMSK:1;
      uint64_t STALLMSK:1;
      uint64_t NAKMSK:1;
      uint64_t ACKMSK:1;
      uint64_t reservedSpace0:1;
      uint64_t XACTERRMSK:1;
      uint64_t BBLERRMSK:1;
      uint64_t FRMOVRUNMSK:1;
      uint64_t DATATGLERRMSK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC12_INTMSK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFERSIZE:19;
      uint64_t PKTCNT:10;
      uint64_t PID:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC12_TSIZ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC12_DMAADDR;

  uint8_t res22[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPS:11;
      uint64_t EPNUM:4;
      uint64_t EPDIR:1;
      uint64_t reservedSpace0:1;
      uint64_t LSPDDEV:1;
      uint64_t EPTYPE:2;
      uint64_t MC:2;
      uint64_t DEVADDR:7;
      uint64_t ODDFRM:1;
      uint64_t CHDIS:1;
      uint64_t CHENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC13_CHAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRTADDR:7;
      uint64_t HUBADDR:7;
      uint64_t XACTPOS:2;
      uint64_t COMPSPLT:1;
      uint64_t reservedSpace0:14;
      uint64_t SPLTENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC13_SPLT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFERCOMPL:1;
      uint64_t CHHLTD:1;
      uint64_t AHBERR:1;
      uint64_t STALL:1;
      uint64_t NAK:1;
      uint64_t ACK:1;
      uint64_t reservedSpace0:1;
      uint64_t XACTERR:1;
      uint64_t BBLERR:1;
      uint64_t FRMOVRUN:1;
      uint64_t DATATGLERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC13_INT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFERCOMPLMSK:1;
      uint64_t CHHLTDMSK:1;
      uint64_t AHBERRMSK:1;
      uint64_t STALLMSK:1;
      uint64_t NAKMSK:1;
      uint64_t ACKMSK:1;
      uint64_t reservedSpace0:1;
      uint64_t XACTERRMSK:1;
      uint64_t BBLERRMSK:1;
      uint64_t FRMOVRUNMSK:1;
      uint64_t DATATGLERRMSK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC13_INTMSK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFERSIZE:19;
      uint64_t PKTCNT:10;
      uint64_t PID:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC13_TSIZ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HC13_DMAADDR;

  uint8_t res23[328];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DEVSPD:2;
      uint64_t NZSTSOUTHSHK:1;
      uint64_t ENA32KHZSUSP:1;
      uint64_t DEVADDR:7;
      uint64_t PERFRINT:2;
      uint64_t ENDEVOUTNAK:1;
      uint64_t XCVRDLY:1;
      uint64_t ERRATICINTMSK:1;
      uint64_t reservedSpace0:10;
      uint64_t RESVALID:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RMTWKUPSIG:1;
      uint64_t SFTDISCON:1;
      uint64_t GNPINNAKSTS:1;
      uint64_t GOUTNAKSTS:1;
      uint64_t TSTCTL:3;
      uint64_t SGNPINNAK:1;
      uint64_t CGNPINNAK:1;
      uint64_t SGOUTNAK:1;
      uint64_t CGOUTNAK:1;
      uint64_t PWRONPRGDONE:1;
      uint64_t reservedSpace0:3;
      uint64_t IGNRFRMNUM:1;
      uint64_t NAKONBBLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SUSPSTS:1;
      uint64_t ENUMSPD:2;
      uint64_t ERRTICERR:1;
      uint64_t reservedSpace0:4;
      uint64_t SOFFN:14;
      uint64_t DEVLNSTS:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSTS;

  uint8_t res24[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFERCOMPLMSK:1;
      uint64_t EPDISBLDMSK:1;
      uint64_t AHBERRMSK:1;
      uint64_t TIMEOUTMSK:1;
      uint64_t INTKNTXFEMPMSK:1;
      uint64_t INTKNEPMISMSK:1;
      uint64_t INEPNAKEFFMSK:1;
      uint64_t reservedSpace0:1;
      uint64_t TXFIFOUNDRNMSK:1;
      uint64_t reservedSpace1:4;
      uint64_t NAKMSK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEPMSK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFERCOMPLMSK:1;
      uint64_t EPDISBLDMSK:1;
      uint64_t AHBERRMSK:1;
      uint64_t SETUPMSK:1;
      uint64_t OUTTKNEPDISMSK:1;
      uint64_t STSPHSERCVDMSK:1;
      uint64_t BACK2BACKSETUP:1;
      uint64_t reservedSpace0:1;
      uint64_t OUTPKTERRMSK:1;
      uint64_t reservedSpace1:3;
      uint64_t BBLEERRMSK:1;
      uint64_t NAKMSK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOEPMSK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INEPINT0:1;
      uint64_t INEPINT1:1;
      uint64_t INEPINT2:1;
      uint64_t INEPINT3:1;
      uint64_t INEPINT4:1;
      uint64_t INEPINT5:1;
      uint64_t INEPINT6:1;
      uint64_t reservedSpace0:9;
      uint64_t OUTEPINT0:1;
      uint64_t OUTEPINT1:1;
      uint64_t OUTEPINT2:1;
      uint64_t OUTEPINT3:1;
      uint64_t OUTEPINT4:1;
      uint64_t OUTEPINT5:1;
      uint64_t OUTEPINT6:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAINT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INEPMSK0:1;
      uint64_t INEPMSK1:1;
      uint64_t INEPMSK2:1;
      uint64_t INEPMSK3:1;
      uint64_t INEPMSK4:1;
      uint64_t INEPMSK5:1;
      uint64_t INEPMSK6:1;
      uint64_t reservedSpace0:9;
      uint64_t OUTEPMSK0:1;
      uint64_t OUTEPMSK1:1;
      uint64_t OUTEPMSK2:1;
      uint64_t OUTEPMSK3:1;
      uint64_t OUTEPMSK4:1;
      uint64_t OUTEPMSK5:1;
      uint64_t OUTEPMSK6:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAINTMSK;

  uint8_t res25[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DVBUSDIS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DVBUSDIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DVBUSPULSE:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DVBUSPULSE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NONISOTHREN:1;
      uint64_t ISOTHREN:1;
      uint64_t TXTHRLEN:9;
      uint64_t AHBTHRRATIO:2;
      uint64_t reservedSpace0:3;
      uint64_t RXTHREN:1;
      uint64_t RXTHRLEN:9;
      uint64_t reservedSpace1:1;
      uint64_t ARBPRKEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DTHRCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INEPTXFEMPMSK:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEPEMPMSK;

  uint8_t res26[200];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPS:2;
      uint64_t reservedSpace0:13;
      uint64_t USBACTEP:1;
      uint64_t reservedSpace1:1;
      uint64_t NAKSTS:1;
      uint64_t EPTYPE:2;
      uint64_t reservedSpace2:1;
      uint64_t STALL:1;
      uint64_t TXFNUM:4;
      uint64_t CNAK:1;
      uint64_t SNAK:1;
      uint64_t reservedSpace3:2;
      uint64_t EPDIS:1;
      uint64_t EPENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEP0CTL;

  uint8_t res27[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFERCOMPL:1;
      uint64_t EPDISBLD:1;
      uint64_t AHBERR:1;
      uint64_t TIMEOUT:1;
      uint64_t INTKNTXFEMP:1;
      uint64_t INTKNEPMIS:1;
      uint64_t INEPNAKEFF:1;
      uint64_t TXFEMP:1;
      uint64_t TXFIFOUNDRN:1;
      uint64_t reservedSpace0:2;
      uint64_t PKTDRPSTS:1;
      uint64_t BBLEERR:1;
      uint64_t NAKINTRPT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEP0INT;

