iSYSTEMLabs/winIDEAExampleWorkspaces/SiliconLabs/EFM32GG11/targetInit/efm32gg11_sfr.h
  uint8_t res28[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFERSIZE:7;
      uint64_t reservedSpace0:12;
      uint64_t PKTCNT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEP0TSIZ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEP0DMAADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SPCAVAIL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEP0TXFSTS;

  uint8_t res29[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPS:11;
      uint64_t reservedSpace0:4;
      uint64_t USBACTEP:1;
      uint64_t DPID:1;
      uint64_t NAKSTS:1;
      uint64_t EPTYPE:2;
      uint64_t reservedSpace1:1;
      uint64_t STALL:1;
      uint64_t TXFNUM:4;
      uint64_t CNAK:1;
      uint64_t SNAK:1;
      uint64_t SETD0PIDEF:1;
      uint64_t SETD1PIDOF:1;
      uint64_t EPDIS:1;
      uint64_t EPENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEP0_CTL;

  uint8_t res30[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFERCOMPL:1;
      uint64_t EPDISBLD:1;
      uint64_t AHBERR:1;
      uint64_t TIMEOUT:1;
      uint64_t INTKNTXFEMP:1;
      uint64_t INTKNEPMIS:1;
      uint64_t INEPNAKEFF:1;
      uint64_t TXFEMP:1;
      uint64_t TXFIFOUNDRN:1;
      uint64_t reservedSpace0:2;
      uint64_t PKTDRPSTS:1;
      uint64_t BBLEERR:1;
      uint64_t NAKINTRPT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEP0_INT;

  uint8_t res31[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFERSIZE:19;
      uint64_t PKTCNT:10;
      uint64_t MC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEP0_TSIZ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEP0_DMAADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SPCAVAIL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEP0_DTXFSTS;

  uint8_t res32[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPS:11;
      uint64_t reservedSpace0:4;
      uint64_t USBACTEP:1;
      uint64_t DPID:1;
      uint64_t NAKSTS:1;
      uint64_t EPTYPE:2;
      uint64_t reservedSpace1:1;
      uint64_t STALL:1;
      uint64_t TXFNUM:4;
      uint64_t CNAK:1;
      uint64_t SNAK:1;
      uint64_t SETD0PIDEF:1;
      uint64_t SETD1PIDOF:1;
      uint64_t EPDIS:1;
      uint64_t EPENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEP1_CTL;

  uint8_t res33[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFERCOMPL:1;
      uint64_t EPDISBLD:1;
      uint64_t AHBERR:1;
      uint64_t TIMEOUT:1;
      uint64_t INTKNTXFEMP:1;
      uint64_t INTKNEPMIS:1;
      uint64_t INEPNAKEFF:1;
      uint64_t TXFEMP:1;
      uint64_t TXFIFOUNDRN:1;
      uint64_t reservedSpace0:2;
      uint64_t PKTDRPSTS:1;
      uint64_t BBLEERR:1;
      uint64_t NAKINTRPT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEP1_INT;

  uint8_t res34[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFERSIZE:19;
      uint64_t PKTCNT:10;
      uint64_t MC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEP1_TSIZ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEP1_DMAADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SPCAVAIL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEP1_DTXFSTS;

  uint8_t res35[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPS:11;
      uint64_t reservedSpace0:4;
      uint64_t USBACTEP:1;
      uint64_t DPID:1;
      uint64_t NAKSTS:1;
      uint64_t EPTYPE:2;
      uint64_t reservedSpace1:1;
      uint64_t STALL:1;
      uint64_t TXFNUM:4;
      uint64_t CNAK:1;
      uint64_t SNAK:1;
      uint64_t SETD0PIDEF:1;
      uint64_t SETD1PIDOF:1;
      uint64_t EPDIS:1;
      uint64_t EPENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEP2_CTL;

  uint8_t res36[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFERCOMPL:1;
      uint64_t EPDISBLD:1;
      uint64_t AHBERR:1;
      uint64_t TIMEOUT:1;
      uint64_t INTKNTXFEMP:1;
      uint64_t INTKNEPMIS:1;
      uint64_t INEPNAKEFF:1;
      uint64_t TXFEMP:1;
      uint64_t TXFIFOUNDRN:1;
      uint64_t reservedSpace0:2;
      uint64_t PKTDRPSTS:1;
      uint64_t BBLEERR:1;
      uint64_t NAKINTRPT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEP2_INT;

  uint8_t res37[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFERSIZE:19;
      uint64_t PKTCNT:10;
      uint64_t MC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEP2_TSIZ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEP2_DMAADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SPCAVAIL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEP2_DTXFSTS;

  uint8_t res38[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPS:11;
      uint64_t reservedSpace0:4;
      uint64_t USBACTEP:1;
      uint64_t DPID:1;
      uint64_t NAKSTS:1;
      uint64_t EPTYPE:2;
      uint64_t reservedSpace1:1;
      uint64_t STALL:1;
      uint64_t TXFNUM:4;
      uint64_t CNAK:1;
      uint64_t SNAK:1;
      uint64_t SETD0PIDEF:1;
      uint64_t SETD1PIDOF:1;
      uint64_t EPDIS:1;
      uint64_t EPENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEP3_CTL;

  uint8_t res39[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFERCOMPL:1;
      uint64_t EPDISBLD:1;
      uint64_t AHBERR:1;
      uint64_t TIMEOUT:1;
      uint64_t INTKNTXFEMP:1;
      uint64_t INTKNEPMIS:1;
      uint64_t INEPNAKEFF:1;
      uint64_t TXFEMP:1;
      uint64_t TXFIFOUNDRN:1;
      uint64_t reservedSpace0:2;
      uint64_t PKTDRPSTS:1;
      uint64_t BBLEERR:1;
      uint64_t NAKINTRPT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEP3_INT;

