iSYSTEMLabs/winIDEAExampleWorkspaces/SiliconLabs/EFM32GG11/targetInit/efm32gg11_sfr.h
  uint8_t res58[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFERSIZE:19;
      uint64_t PKTCNT:10;
      uint64_t RXDPID:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOEP2_TSIZ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOEP2_DMAADDR;

  uint8_t res59[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPS:11;
      uint64_t reservedSpace0:4;
      uint64_t USBACTEP:1;
      uint64_t DPID:1;
      uint64_t NAKSTS:1;
      uint64_t EPTYPE:2;
      uint64_t SNP:1;
      uint64_t STALL:1;
      uint64_t reservedSpace1:4;
      uint64_t CNAK:1;
      uint64_t SNAK:1;
      uint64_t SETD0PIDEF:1;
      uint64_t SETD1PIDOF:1;
      uint64_t EPDIS:1;
      uint64_t EPENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOEP3_CTL;

  uint8_t res60[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFERCOMPL:1;
      uint64_t EPDISBLD:1;
      uint64_t AHBERR:1;
      uint64_t SETUP:1;
      uint64_t OUTTKNEPDIS:1;
      uint64_t STSPHSERCVD:1;
      uint64_t BACK2BACKSETUP:1;
      uint64_t reservedSpace0:1;
      uint64_t OUTPKTERR:1;
      uint64_t reservedSpace1:2;
      uint64_t PKTDRPSTS:1;
      uint64_t BBLEERR:1;
      uint64_t NAKINTRPT:1;
      uint64_t reservedSpace2:1;
      uint64_t STUPPKTRCVD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOEP3_INT;

  uint8_t res61[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFERSIZE:19;
      uint64_t PKTCNT:10;
      uint64_t RXDPID:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOEP3_TSIZ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOEP3_DMAADDR;

  uint8_t res62[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPS:11;
      uint64_t reservedSpace0:4;
      uint64_t USBACTEP:1;
      uint64_t DPID:1;
      uint64_t NAKSTS:1;
      uint64_t EPTYPE:2;
      uint64_t SNP:1;
      uint64_t STALL:1;
      uint64_t reservedSpace1:4;
      uint64_t CNAK:1;
      uint64_t SNAK:1;
      uint64_t SETD0PIDEF:1;
      uint64_t SETD1PIDOF:1;
      uint64_t EPDIS:1;
      uint64_t EPENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOEP4_CTL;

  uint8_t res63[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFERCOMPL:1;
      uint64_t EPDISBLD:1;
      uint64_t AHBERR:1;
      uint64_t SETUP:1;
      uint64_t OUTTKNEPDIS:1;
      uint64_t STSPHSERCVD:1;
      uint64_t BACK2BACKSETUP:1;
      uint64_t reservedSpace0:1;
      uint64_t OUTPKTERR:1;
      uint64_t reservedSpace1:2;
      uint64_t PKTDRPSTS:1;
      uint64_t BBLEERR:1;
      uint64_t NAKINTRPT:1;
      uint64_t reservedSpace2:1;
      uint64_t STUPPKTRCVD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOEP4_INT;

  uint8_t res64[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFERSIZE:19;
      uint64_t PKTCNT:10;
      uint64_t RXDPID:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOEP4_TSIZ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOEP4_DMAADDR;

  uint8_t res65[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPS:11;
      uint64_t reservedSpace0:4;
      uint64_t USBACTEP:1;
      uint64_t DPID:1;
      uint64_t NAKSTS:1;
      uint64_t EPTYPE:2;
      uint64_t SNP:1;
      uint64_t STALL:1;
      uint64_t reservedSpace1:4;
      uint64_t CNAK:1;
      uint64_t SNAK:1;
      uint64_t SETD0PIDEF:1;
      uint64_t SETD1PIDOF:1;
      uint64_t EPDIS:1;
      uint64_t EPENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOEP5_CTL;

  uint8_t res66[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFERCOMPL:1;
      uint64_t EPDISBLD:1;
      uint64_t AHBERR:1;
      uint64_t SETUP:1;
      uint64_t OUTTKNEPDIS:1;
      uint64_t STSPHSERCVD:1;
      uint64_t BACK2BACKSETUP:1;
      uint64_t reservedSpace0:1;
      uint64_t OUTPKTERR:1;
      uint64_t reservedSpace1:2;
      uint64_t PKTDRPSTS:1;
      uint64_t BBLEERR:1;
      uint64_t NAKINTRPT:1;
      uint64_t reservedSpace2:1;
      uint64_t STUPPKTRCVD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOEP5_INT;

  uint8_t res67[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFERSIZE:19;
      uint64_t PKTCNT:10;
      uint64_t RXDPID:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOEP5_TSIZ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOEP5_DMAADDR;

  uint8_t res68[552];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STOPPCLK:1;
      uint64_t GATEHCLK:1;
      uint64_t PWRCLMP:1;
      uint64_t RSTPDWNMODULE:1;
      uint64_t reservedSpace0:2;
      uint64_t PHYSLEEP:1;
      uint64_t L1SUSPENDED:1;
      uint64_t RESETAFTERSUSP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCGCCTL;

};

#define USB (*(volatile struct USB_tag *) 0x40022000)

struct IDAC0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t CURSINK:1;
      uint64_t MINOUTTRANS:1;
      uint64_t APORTOUTEN:1;
      uint64_t APORTOUTSEL:8;
      uint64_t PWRSEL:1;
      uint64_t EM2DELAY:1;
      uint64_t APORTMASTERDIS:1;
      uint64_t reservedSpace0:1;
      uint64_t APORTOUTENPRS:1;
      uint64_t reservedSpace1:1;
      uint64_t MAINOUTEN:1;
      uint64_t MAINOUTENPRS:1;
      uint64_t PRSSEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RANGESEL:2;
      uint64_t reservedSpace0:6;
      uint64_t STEPSEL:5;
      uint64_t reservedSpace1:3;
      uint64_t TUNING:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CURPROG;

