iSYSTEMLabs/winIDEAExampleWorkspaces/SiliconLabs/EFM32GG11/targetInit/efm32gg11_sfr.h
  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t EM2DUTYCYCLEDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DUTYCONFIG;

  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CURSTABLE:1;
      uint64_t APORTCONFLICT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATUS;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CURSTABLE:1;
      uint64_t APORTCONFLICT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CURSTABLE:1;
      uint64_t APORTCONFLICT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CURSTABLE:1;
      uint64_t APORTCONFLICT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CURSTABLE:1;
      uint64_t APORTCONFLICT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IEN;

  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t APORT1XREQ:1;
      uint64_t APORT1YREQ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APORTREQ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t APORT1XCONFLICT:1;
      uint64_t APORT1YCONFLICT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APORTCONFLICT;

};

#define IDAC0 (*(volatile struct IDAC0_tag *) 0x40084000)

struct CSEN_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t EN:1;
      uint64_t CMPPOL:1;
      uint64_t reservedSpace1:1;
      uint64_t CM:2;
      uint64_t reservedSpace2:2;
      uint64_t SARCR:2;
      uint64_t reservedSpace3:2;
      uint64_t ACU:3;
      uint64_t MCEN:1;
      uint64_t STM:2;
      uint64_t CMPEN:1;
      uint64_t DRSF:1;
      uint64_t DMAEN:1;
      uint64_t CONVSEL:1;
      uint64_t CHOPEN:1;
      uint64_t AUTOGND:1;
      uint64_t MXUC:1;
      uint64_t EMACMPEN:1;
      uint64_t WARMUPMODE:1;
      uint64_t LOCALSENS:1;
      uint64_t CPACCURACY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCPRESC:3;
      uint64_t reservedSpace0:5;
      uint64_t PCTOP:8;
      uint64_t WARMUPCNT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t START:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSENBUSY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRSSEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRSSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCANINPUTEN:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCANMASK0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INPUT0TO7SEL:4;
      uint64_t reservedSpace0:4;
      uint64_t INPUT8TO15SEL:4;
      uint64_t reservedSpace1:4;
      uint64_t INPUT16TO23SEL:4;
      uint64_t reservedSpace2:4;
      uint64_t INPUT24TO31SEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCANINPUTSEL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCANINPUTEN:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCANMASK1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INPUT32TO39SEL:4;
      uint64_t reservedSpace0:4;
      uint64_t INPUT40TO47SEL:4;
      uint64_t reservedSpace1:4;
      uint64_t INPUT48TO55SEL:4;
      uint64_t reservedSpace2:4;
      uint64_t INPUT56TO63SEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCANINPUTSEL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t APORT1XREQ:1;
      uint64_t APORT1YREQ:1;
      uint64_t APORT2XREQ:1;
      uint64_t APORT2YREQ:1;
      uint64_t APORT3XREQ:1;
      uint64_t APORT3YREQ:1;
      uint64_t APORT4XREQ:1;
      uint64_t APORT4YREQ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APORTREQ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t APORT1XCONFLICT:1;
      uint64_t APORT1YCONFLICT:1;
      uint64_t APORT2XCONFLICT:1;
      uint64_t APORT2YCONFLICT:1;
      uint64_t APORT3XCONFLICT:1;
      uint64_t APORT3YCONFLICT:1;
      uint64_t APORT4XCONFLICT:1;
      uint64_t APORT4YCONFLICT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APORTCONFLICT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMPTHR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMPTHR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMA:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMASAMPLE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMACTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t SINGLESEL:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SINGLECTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BASELINEUP:16;
      uint64_t BASELINEDN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMBASELINE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMG:8;
      uint64_t DMR:4;
      uint64_t reservedSpace0:4;
      uint64_t DMCR:4;
      uint64_t CRMODE:2;
      uint64_t reservedSpace1:6;
      uint64_t DMGRDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t IREFPROG:3;
      uint64_t reservedSpace1:1;
      uint64_t IDACIREFS:3;
      uint64_t reservedSpace2:9;
      uint64_t TRSTPROG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ANACTRL;

