iSYSTEMLabs/winIDEAExampleWorkspaces/SiliconLabs/EFM32GG11/targetInit/efm32gg11_sfr.h
  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMP:1;
      uint64_t CONV:1;
      uint64_t EOS:1;
      uint64_t DMAOF:1;
      uint64_t APORTCONFLICT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMP:1;
      uint64_t CONV:1;
      uint64_t EOS:1;
      uint64_t DMAOF:1;
      uint64_t APORTCONFLICT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMP:1;
      uint64_t CONV:1;
      uint64_t EOS:1;
      uint64_t DMAOF:1;
      uint64_t APORTCONFLICT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMP:1;
      uint64_t CONV:1;
      uint64_t EOS:1;
      uint64_t DMAOF:1;
      uint64_t APORTCONFLICT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IEN;

};

#define CSEN (*(volatile struct CSEN_tag *) 0x4008e000)

struct LCD_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t UDCTRL:2;
      uint64_t reservedSpace0:20;
      uint64_t DSC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MUX:3;
      uint64_t reservedSpace0:1;
      uint64_t WAVE:1;
      uint64_t reservedSpace1:3;
      uint64_t CONTRAST:6;
      uint64_t reservedSpace2:6;
      uint64_t CHGRDST:3;
      uint64_t reservedSpace3:1;
      uint64_t BIAS:2;
      uint64_t reservedSpace4:2;
      uint64_t MODE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DISPCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEGEN:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEGEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLINKEN:1;
      uint64_t BLANK:1;
      uint64_t AEN:1;
      uint64_t AREGASC:2;
      uint64_t AREGBSC:2;
      uint64_t ALOGSEL:1;
      uint64_t FCEN:1;
      uint64_t reservedSpace0:7;
      uint64_t FCPRESC:2;
      uint64_t FCTOP:6;
      uint64_t reservedSpace1:4;
      uint64_t ALOC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BACTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ASTATE:4;
      uint64_t reservedSpace0:4;
      uint64_t BLINK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AREGA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AREGA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AREGB:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AREGB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IEN;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SPEED:3;
      uint64_t reservedSpace0:1;
      uint64_t BUFDRV:4;
      uint64_t reservedSpace1:2;
      uint64_t BUFBIAS:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BIASCTRL;

  uint8_t res1[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEGD0L:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEGD0L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEGD1L:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEGD1L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEGD2L:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEGD2L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEGD3L:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEGD3L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEGD0H:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEGD0H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEGD1H:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEGD1H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEGD2H:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEGD2H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEGD3H:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEGD3H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEGD4L:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEGD4L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEGD5L:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEGD5L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEGD6L:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEGD6L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEGD7L:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEGD7L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEGD4H:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEGD4H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEGD5H:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEGD5H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEGD6H:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEGD6H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEGD7H:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEGD7H;

  uint8_t res2[64];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGFREEZE:1;
      uint64_t LCDGATE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FREEZE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTRL:1;
      uint64_t BACTRL:1;
      uint64_t AREGA:1;
      uint64_t AREGB:1;
      uint64_t SEGD0L:1;
      uint64_t SEGD1L:1;
      uint64_t SEGD2L:1;
      uint64_t SEGD3L:1;
      uint64_t SEGD0H:1;
      uint64_t SEGD1H:1;
      uint64_t SEGD2H:1;
      uint64_t SEGD3H:1;
      uint64_t SEGD4L:1;
      uint64_t SEGD5L:1;
      uint64_t SEGD6L:1;
      uint64_t SEGD7L:1;
      uint64_t SEGD4H:1;
      uint64_t SEGD5H:1;
      uint64_t SEGD6H:1;
      uint64_t SEGD7H:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYNCBUSY;

  uint8_t res3[40];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRDIV:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRAMERATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEGEN2:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEGEN2;

