iSYSTEMLabs/winIDEAExampleWorkspaces/SiliconLabs/EFM32GG11/targetInit/efm32gg11_sfr.h
};

#define LCD (*(volatile struct LCD_tag *) 0x40054000)

struct RTC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t DEBUGRUN:1;
      uint64_t COMP0TOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNT:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OF:1;
      uint64_t COMP:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OF:1;
      uint64_t COMP:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OF:1;
      uint64_t COMP:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OF:1;
      uint64_t COMP:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IEN;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COMPA_COMP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COMPB_COMP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COMPC_COMP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COMPD_COMP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COMPE_COMP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COMPF_COMP;

};

#define RTC (*(volatile struct RTC_tag *) 0x40060000)

struct RTCC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t reservedSpace0:1;
      uint64_t DEBUGRUN:1;
      uint64_t reservedSpace1:1;
      uint64_t PRECCV0TOP:1;
      uint64_t CCV1TOP:1;
      uint64_t reservedSpace2:2;
      uint64_t CNTPRESC:4;
      uint64_t CNTTICK:1;
      uint64_t reservedSpace3:1;
      uint64_t BUMODETSEN:1;
      uint64_t OSCFDETEN:1;
      uint64_t CNTMODE:1;
      uint64_t LYEARCORRDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRECNT:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRECNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRECNT:15;
      uint64_t CNTLSB:17;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COMBCNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SECU:4;
      uint64_t SECT:3;
      uint64_t reservedSpace0:1;
      uint64_t MINU:4;
      uint64_t MINT:3;
      uint64_t reservedSpace1:1;
      uint64_t HOURU:4;
      uint64_t HOURT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIME;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DAYOMU:4;
      uint64_t DAYOMT:2;
      uint64_t reservedSpace0:2;
      uint64_t MONTHU:4;
      uint64_t MONTHT:1;
      uint64_t reservedSpace1:3;
      uint64_t YEARU:4;
      uint64_t YEART:4;
      uint64_t DAYOW:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OF:1;
      uint64_t CC0:1;
      uint64_t CC1:1;
      uint64_t CC2:1;
      uint64_t OSCFAIL:1;
      uint64_t CNTTICK:1;
      uint64_t MINTICK:1;
      uint64_t HOURTICK:1;
      uint64_t DAYTICK:1;
      uint64_t DAYOWOF:1;
      uint64_t MONTHTICK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OF:1;
      uint64_t CC0:1;
      uint64_t CC1:1;
      uint64_t CC2:1;
      uint64_t OSCFAIL:1;
      uint64_t CNTTICK:1;
      uint64_t MINTICK:1;
      uint64_t HOURTICK:1;
      uint64_t DAYTICK:1;
      uint64_t DAYOWOF:1;
      uint64_t MONTHTICK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OF:1;
      uint64_t CC0:1;
      uint64_t CC1:1;
      uint64_t CC2:1;
      uint64_t OSCFAIL:1;
      uint64_t CNTTICK:1;
      uint64_t MINTICK:1;
      uint64_t HOURTICK:1;
      uint64_t DAYTICK:1;
      uint64_t DAYOWOF:1;
      uint64_t MONTHTICK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OF:1;
      uint64_t CC0:1;
      uint64_t CC1:1;
      uint64_t CC2:1;
      uint64_t OSCFAIL:1;
      uint64_t CNTTICK:1;
      uint64_t MINTICK:1;
      uint64_t HOURTICK:1;
      uint64_t DAYTICK:1;
      uint64_t DAYOWOF:1;
      uint64_t MONTHTICK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BUMODETS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRSTATUS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t CMD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYNCBUSY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RAM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) POWERDOWN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKKEY:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LOCK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EM4WU:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EM4WUEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:2;
      uint64_t CMOA:2;
      uint64_t ICEDGE:2;
      uint64_t PRSSEL:5;
      uint64_t COMPBASE:1;
      uint64_t COMPMASK:5;
      uint64_t DAYCC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CC0_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CCV:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CC0_CCV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SECU:4;
      uint64_t SECT:3;
      uint64_t reservedSpace0:1;
      uint64_t MINU:4;
      uint64_t MINT:3;
      uint64_t reservedSpace1:1;
      uint64_t HOURU:4;
      uint64_t HOURT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CC0_TIME;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DAYU:4;
      uint64_t DAYT:2;
      uint64_t reservedSpace0:2;
      uint64_t MONTHU:4;
      uint64_t MONTHT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CC0_DATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:2;
      uint64_t CMOA:2;
      uint64_t ICEDGE:2;
      uint64_t PRSSEL:5;
      uint64_t COMPBASE:1;
      uint64_t COMPMASK:5;
      uint64_t DAYCC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CC1_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CCV:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CC1_CCV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SECU:4;
      uint64_t SECT:3;
      uint64_t reservedSpace0:1;
      uint64_t MINU:4;
      uint64_t MINT:3;
      uint64_t reservedSpace1:1;
      uint64_t HOURU:4;
      uint64_t HOURT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CC1_TIME;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DAYU:4;
      uint64_t DAYT:2;
      uint64_t reservedSpace0:2;
      uint64_t MONTHU:4;
      uint64_t MONTHT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CC1_DATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:2;
      uint64_t CMOA:2;
      uint64_t ICEDGE:2;
      uint64_t PRSSEL:5;
      uint64_t COMPBASE:1;
      uint64_t COMPMASK:5;
      uint64_t DAYCC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CC2_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CCV:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CC2_CCV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SECU:4;
      uint64_t SECT:3;
      uint64_t reservedSpace0:1;
      uint64_t MINU:4;
      uint64_t MINT:3;
      uint64_t reservedSpace1:1;
      uint64_t HOURU:4;
      uint64_t HOURT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CC2_TIME;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DAYU:4;
      uint64_t DAYT:2;
      uint64_t reservedSpace0:2;
      uint64_t MONTHU:4;
      uint64_t MONTHT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CC2_DATE;

  uint8_t res0[148];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RET0_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RET1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RET2_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RET3_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RET4_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RET5_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RET6_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RET7_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RET8_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RET9_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RET10_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RET11_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RET12_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RET13_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RET14_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RET15_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RET16_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RET17_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RET18_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RET19_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RET20_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RET21_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RET22_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RET23_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RET24_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RET25_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RET26_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RET27_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RET28_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RET29_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RET30_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RET31_REG;

