iSYSTEMLabs/winIDEAExampleWorkspaces/SiliconLabs/EFM32GG11/targetInit/efm32gg11_sfr.h
};

#define RTCC (*(volatile struct RTCC_tag *) 0x40062000)

struct WDOG0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t DEBUGRUN:1;
      uint64_t EM2RUN:1;
      uint64_t EM3RUN:1;
      uint64_t LOCK:1;
      uint64_t EM4BLOCK:1;
      uint64_t SWOSCBLOCK:1;
      uint64_t reservedSpace0:1;
      uint64_t PERSEL:4;
      uint64_t CLKSEL:2;
      uint64_t reservedSpace1:2;
      uint64_t WARNSEL:2;
      uint64_t reservedSpace2:6;
      uint64_t WINSEL:3;
      uint64_t reservedSpace3:3;
      uint64_t CLRSRC:1;
      uint64_t WDOGRSTDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLEAR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTRL:1;
      uint64_t CMD:1;
      uint64_t PCH0_PRSCTRL:1;
      uint64_t PCH1_PRSCTRL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYNCBUSY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRSSEL:5;
      uint64_t reservedSpace0:3;
      uint64_t PRSMISSRSTEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCH0_PRSCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRSSEL:5;
      uint64_t reservedSpace0:3;
      uint64_t PRSMISSRSTEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCH1_PRSCTRL;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TOUT:1;
      uint64_t WARN:1;
      uint64_t WIN:1;
      uint64_t PEM0:1;
      uint64_t PEM1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TOUT:1;
      uint64_t WARN:1;
      uint64_t WIN:1;
      uint64_t PEM0:1;
      uint64_t PEM1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TOUT:1;
      uint64_t WARN:1;
      uint64_t WIN:1;
      uint64_t PEM0:1;
      uint64_t PEM1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TOUT:1;
      uint64_t WARN:1;
      uint64_t WIN:1;
      uint64_t PEM0:1;
      uint64_t PEM1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IEN;

};

#define WDOG0 (*(volatile struct WDOG0_tag *) 0x40052000)

struct WDOG1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t DEBUGRUN:1;
      uint64_t EM2RUN:1;
      uint64_t EM3RUN:1;
      uint64_t LOCK:1;
      uint64_t EM4BLOCK:1;
      uint64_t SWOSCBLOCK:1;
      uint64_t reservedSpace0:1;
      uint64_t PERSEL:4;
      uint64_t CLKSEL:2;
      uint64_t reservedSpace1:2;
      uint64_t WARNSEL:2;
      uint64_t reservedSpace2:6;
      uint64_t WINSEL:3;
      uint64_t reservedSpace3:3;
      uint64_t CLRSRC:1;
      uint64_t WDOGRSTDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLEAR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTRL:1;
      uint64_t CMD:1;
      uint64_t PCH0_PRSCTRL:1;
      uint64_t PCH1_PRSCTRL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYNCBUSY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRSSEL:5;
      uint64_t reservedSpace0:3;
      uint64_t PRSMISSRSTEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCH0_PRSCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRSSEL:5;
      uint64_t reservedSpace0:3;
      uint64_t PRSMISSRSTEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCH1_PRSCTRL;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TOUT:1;
      uint64_t WARN:1;
      uint64_t WIN:1;
      uint64_t PEM0:1;
      uint64_t PEM1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TOUT:1;
      uint64_t WARN:1;
      uint64_t WIN:1;
      uint64_t PEM0:1;
      uint64_t PEM1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TOUT:1;
      uint64_t WARN:1;
      uint64_t WIN:1;
      uint64_t PEM0:1;
      uint64_t PEM1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TOUT:1;
      uint64_t WARN:1;
      uint64_t WIN:1;
      uint64_t PEM0:1;
      uint64_t PEM1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IEN;

};

#define WDOG1 (*(volatile struct WDOG1_tag *) 0x40052400)

struct ETM_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t POWERDWN:1;
      uint64_t reservedSpace0:3;
      uint64_t PORTSIZE:3;
      uint64_t STALL:1;
      uint64_t BRANCHOUTPUT:1;
      uint64_t DBGREQCTRL:1;
      uint64_t ETMPROG:1;
      uint64_t ETMPORTSEL:1;
      uint64_t reservedSpace1:1;
      uint64_t PORTMODE2:1;
      uint64_t reservedSpace2:2;
      uint64_t PORTMODE:2;
      uint64_t reservedSpace3:3;
      uint64_t EPORTSIZE:2;
      uint64_t reservedSpace4:5;
      uint64_t TSTAMPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ETMCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADRCMPPAIR:4;
      uint64_t DATACMPNUM:4;
      uint64_t MMDECCNT:5;
      uint64_t COUNTNUM:3;
      uint64_t SEQPRES:1;
      uint64_t EXTINPNUM:3;
      uint64_t EXTOUTNUM:3;
      uint64_t FIFOFULLPRES:1;
      uint64_t IDCOMPNUM:2;
      uint64_t TRACESS:1;
      uint64_t MMACCESS:1;
      uint64_t reservedSpace0:3;
      uint64_t ETMID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ETMCCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESA:7;
      uint64_t RESB:7;
      uint64_t ETMFCN:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ETMTRIGGER;

