iSYSTEMLabs/winIDEAExampleWorkspaces/SiliconLabs/EFM32GG11/targetInit/efm32gg11_sfr.h
  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ETHOF:1;
      uint64_t ETMPROGBIT:1;
      uint64_t TRACESTAT:1;
      uint64_t TRIGBIT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ETMSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXPORTSIZE:3;
      uint64_t reservedSpace0:5;
      uint64_t FIFOFULL:1;
      uint64_t MAXPORTSIZE3:1;
      uint64_t PORTSIZE:1;
      uint64_t PORTMODE:1;
      uint64_t PROCNUM:3;
      uint64_t reservedSpace1:2;
      uint64_t NOFETCHCOMP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ETMSCR;

  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESA:7;
      uint64_t RESB:7;
      uint64_t ETMFCNEN:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ETMTEEVR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADRCMP:8;
      uint64_t MEMMAP:16;
      uint64_t INCEXCTL:1;
      uint64_t TCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ETMTECR1;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BYTENUM:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ETMFFLR;

  uint8_t res3[272];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ETMCNTRLDVR1;

  uint8_t res4[156];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FREQ:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ETMSYNCFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IMPVER:4;
      uint64_t ETMMINVER:4;
      uint64_t ETMMAJVER:4;
      uint64_t PROCFAM:4;
      uint64_t LPCF:1;
      uint64_t reservedSpace0:1;
      uint64_t THUMBT:1;
      uint64_t SECEXT:1;
      uint64_t BPE:1;
      uint64_t reservedSpace1:3;
      uint64_t IMPCODE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ETMIDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTINPSEL:2;
      uint64_t reservedSpace0:1;
      uint64_t EXTINPBUS:8;
      uint64_t READREGS:1;
      uint64_t DADDRCMP:1;
      uint64_t INSTRES:3;
      uint64_t EICEWPNT:4;
      uint64_t TEICEWPNT:1;
      uint64_t EICEIMP:1;
      uint64_t TIMP:1;
      uint64_t reservedSpace1:4;
      uint64_t RFCNT:1;
      uint64_t TENC:1;
      uint64_t TSIZE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ETMCCER;

  uint8_t res5[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STARTRSEL:4;
      uint64_t reservedSpace0:12;
      uint64_t STOPRSEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ETMTESSEICR;

  uint8_t res6[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESAEVT:7;
      uint64_t RESBEVT:7;
      uint64_t ETMFCNEVT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ETMTSEVR;

  uint8_t res7[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRACEID:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ETMTRACEIDR;

  uint8_t res8[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFE:1;
      uint64_t SWP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ETMIDR2;

  uint8_t res9[264];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ETMUP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ETMPDSR;

  uint8_t res10[3016];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTIN:2;
      uint64_t reservedSpace0:2;
      uint64_t COREHALT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ETMISCIN;

  uint8_t res11[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRIGGEROUT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ITTRIGOUT;

  uint8_t res12[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ATREADY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ETMITATBCTR2;

  uint8_t res13[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ATVALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ETMITATBCTR0;

  uint8_t res14[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ITEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ETMITCTRL;

  uint8_t res15[156];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETTAG:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ETMCLAIMSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRTAG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ETMCLAIMCLR;

  uint8_t res16[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ETMLAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKIMP:1;
      uint64_t LOCKED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ETMLSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NONSECINVDBG:2;
      uint64_t NONSECNONINVDBG:2;
      uint64_t SECINVDBG:2;
      uint64_t SECNONINVDBG:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ETMAUTHSTATUS;

  uint8_t res17[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRACESRC:4;
      uint64_t PROCTRACE:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ETMDEVTYPE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONTCODE:4;
      uint64_t COUNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ETMPIDR4;

  uint32_t ETMPIDR5;
  uint32_t ETMPIDR6;
  uint32_t ETMPIDR7;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARTNUM:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ETMPIDR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARTNUM:4;
      uint64_t IDCODE:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ETMPIDR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IDCODE:3;
      uint64_t ALWAYS1:1;
      uint64_t REV:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ETMPIDR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CUSTMOD:4;
      uint64_t REVAND:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ETMPIDR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PREAMB:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ETMCIDR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PREAMB:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ETMCIDR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PREAMB:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ETMCIDR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PREAMB:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ETMCIDR3;

