iSYSTEMLabs/winIDEAExampleWorkspaces/SiliconLabs/EFM32GG11/targetInit/efm32gg11_sfr.h
};

#define ETM (*(volatile struct ETM_tag *) 0xe0041000)

struct SMU_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPUPRIV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPUPRIV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPUPRIV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPUPRIV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IEN;

  uint8_t res0[36];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPUCTRL;

  uint8_t res1[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACMP0_bitfield:1;
      uint64_t ACMP1_bitfield:1;
      uint64_t ACMP2_bitfield:1;
      uint64_t ACMP3_bitfield:1;
      uint64_t ADC0_bitfield:1;
      uint64_t ADC1_bitfield:1;
      uint64_t CAN0_bitfield:1;
      uint64_t CAN1_bitfield:1;
      uint64_t CMU_bitfield:1;
      uint64_t CRYOTIMER_bitfield:1;
      uint64_t CRYPTO0_bitfield:1;
      uint64_t CSEN_bitfield:1;
      uint64_t VDAC0_bitfield:1;
      uint64_t PRS_bitfield:1;
      uint64_t EBI_bitfield:1;
      uint64_t EMU_bitfield:1;
      uint64_t ETH_bitfield:1;
      uint64_t FPUEH_bitfield:1;
      uint64_t GPCRC_bitfield:1;
      uint64_t GPIO_bitfield:1;
      uint64_t I2C0_bitfield:1;
      uint64_t I2C1_bitfield:1;
      uint64_t I2C2_bitfield:1;
      uint64_t IDAC0_bitfield:1;
      uint64_t MSC_bitfield:1;
      uint64_t LCD_bitfield:1;
      uint64_t LDMA_bitfield:1;
      uint64_t LESENSE_bitfield:1;
      uint64_t LETIMER0_bitfield:1;
      uint64_t LETIMER1_bitfield:1;
      uint64_t LEUART0_bitfield:1;
      uint64_t LEUART1_bitfield:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPUPATD0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCNT0_bitfield:1;
      uint64_t PCNT1_bitfield:1;
      uint64_t PCNT2_bitfield:1;
      uint64_t QSPI0_bitfield:1;
      uint64_t RMU_bitfield:1;
      uint64_t RTC_bitfield:1;
      uint64_t RTCC_bitfield:1;
      uint64_t SDIO_bitfield:1;
      uint64_t SMU_bitfield:1;
      uint64_t TIMER0_bitfield:1;
      uint64_t TIMER1_bitfield:1;
      uint64_t TIMER2_bitfield:1;
      uint64_t TIMER3_bitfield:1;
      uint64_t TIMER4_bitfield:1;
      uint64_t TIMER5_bitfield:1;
      uint64_t TIMER6_bitfield:1;
      uint64_t TRNG0_bitfield:1;
      uint64_t UART0_bitfield:1;
      uint64_t UART1_bitfield:1;
      uint64_t USART0_bitfield:1;
      uint64_t USART1_bitfield:1;
      uint64_t USART2_bitfield:1;
      uint64_t USART3_bitfield:1;
      uint64_t USART4_bitfield:1;
      uint64_t USART5_bitfield:1;
      uint64_t USB_bitfield:1;
      uint64_t WDOG0_bitfield:1;
      uint64_t WDOG1_bitfield:1;
      uint64_t WTIMER0_bitfield:1;
      uint64_t WTIMER1_bitfield:1;
      uint64_t WTIMER2_bitfield:1;
      uint64_t WTIMER3_bitfield:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPUPATD1;

  uint32_t PPUPATD2;
  uint8_t res2[52];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIPHID:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPUFS;

};

#define SMU (*(volatile struct SMU_tag *) 0x4002000c)

struct TRNG0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t reservedSpace0:1;
      uint64_t TESTEN:1;
      uint64_t CONDBYPASS:1;
      uint64_t REPCOUNTIEN:1;
      uint64_t APT64IEN:1;
      uint64_t APT4096IEN:1;
      uint64_t FULLIEN:1;
      uint64_t SOFTRESET:1;
      uint64_t PREIEN:1;
      uint64_t ALMIEN:1;
      uint64_t FORCERUN:1;
      uint64_t BYPNIST:1;
      uint64_t BYPAIS31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CONTROL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOLEVEL;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFODEPTH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) KEY0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) KEY1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) KEY2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) KEY3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TESTDATA;

  uint8_t res1[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TESTDATABUSY:1;
      uint64_t reservedSpace0:3;
      uint64_t REPCOUNTIF:1;
      uint64_t APT64IF:1;
      uint64_t APT4096IF:1;
      uint64_t FULLIF:1;
      uint64_t PREIF:1;
      uint64_t ALMIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALUE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INITWAITVAL;

  uint8_t res2[200];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFO;

};

#define TRNG0 (*(volatile struct TRNG0_tag *) 0x4001d000)

